-----------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/instrumental_variables/iv.log
  log type:  text
 opened on:  15 May 2017, 14:39:05

. 
. /* Instrumental Variables */
. /* Will Doyle */
. /* 170515 */
. /* Practicum Folder */
. 
. clear 

. 
. global ddir "../../data/"

. 
. use "${ddir}nlsy_2010.dta", clear

. 
. 
. // Interaction variable
. gen moth_prox= mothed*prox
(974 missing values generated)

. 
. local y lyinc

. local x ccol

. local controls female black multiracial hispanic asvab i.quarter

. local z prox

. local z1 prox moth_prox

. 
. // gen z= 1 + 2*ccol + rnorm(10)
. 
. // Basic regression with endog regressor
. 
. reg `y' `x'

      Source |       SS       df       MS              Number of obs =    5302
-------------+------------------------------           F(  1,  5300) =  245.79
       Model |  339.270927     1  339.270927           Prob > F      =  0.0000
    Residual |  7315.73074  5300  1.38032655           R-squared     =  0.0443
-------------+------------------------------           Adj R-squared =  0.0441
       Total |  7655.00167  5301  1.44406747           Root MSE      =  1.1749

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |   .0975965   .0062252    15.68   0.000     .0853926    .1098004
       _cons |   9.808505   .0232423   422.01   0.000      9.76294    9.854069
------------------------------------------------------------------------------

. reg `y' `x' `controls'

      Source |       SS       df       MS              Number of obs =    4368
-------------+------------------------------           F( 25,  4342) =   17.99
       Model |   606.42834    25  24.2571336           Prob > F      =  0.0000
    Residual |  5855.79058  4342  1.34863901           R-squared     =  0.0938
-------------+------------------------------           Adj R-squared =  0.0886
       Total |  6462.21892  4367   1.4797845           Root MSE      =  1.1613

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |   .0701574   .0080185     8.75   0.000      .054437    .0858778
      female |  -.3100471   .0358142    -8.66   0.000    -.3802613   -.2398329
       black |  -.2091958    .047897    -4.37   0.000    -.3030984   -.1152932
 multiracial |   .1220832    .181033     0.67   0.500    -.2328338    .4770003
    hispanic |   .0237899   .0483232     0.49   0.623    -.0709484    .1185281
       asvab |   .5774314   .0773854     7.46   0.000     .4257165    .7291464
             |
     quarter |
          2  |      .0052   .1176955     0.04   0.965    -.2255432    .2359433
          3  |  -.1704338   .1170825    -1.46   0.146    -.3999752    .0591076
          4  |  -.1056638   .1168133    -0.90   0.366    -.3346776      .12335
          5  |  -.1765472   .1148719    -1.54   0.124    -.4017547    .0486603
          6  |  -.0438619    .114912    -0.38   0.703    -.2691482    .1814243
          7  |  -.1404778   .1093725    -1.28   0.199    -.3549037    .0739481
          8  |  -.2294765   .1128513    -2.03   0.042    -.4507227   -.0082302
          9  |  -.1883844   .1145721    -1.64   0.100    -.4130042    .0362354
         10  |  -.0512959   .1147415    -0.45   0.655    -.2762478    .1736559
         11  |  -.1201981   .1114782    -1.08   0.281    -.3387523    .0983562
         12  |  -.2666132   .1147002    -2.32   0.020    -.4914841   -.0417422
         13  |  -.1146033   .1135978    -1.01   0.313    -.3373131    .1081064
         14  |  -.2548109   .1151355    -2.21   0.027    -.4805353   -.0290865
         15  |  -.3752216   .1117929    -3.36   0.001    -.5943928   -.1560505
         16  |  -.1237362   .1120099    -1.10   0.269    -.3433328    .0958604
         17  |  -.2951264   .1116064    -2.64   0.008    -.5139318    -.076321
         18  |  -.3133218   .1148571    -2.73   0.006    -.5385003   -.0881432
         19  |   -.191894   .1131301    -1.70   0.090    -.4136868    .0298987
         20  |  -.5237935   .1161868    -4.51   0.000    -.7515789   -.2960081
             |
       _cons |   9.978806    .094987   105.05   0.000     9.792583    10.16503
------------------------------------------------------------------------------

. 
. // "First Stage": does instrument predict endog regressor?
. 
. reg `x' `z' if `y' !=.

      Source |       SS       df       MS              Number of obs =    5302
-------------+------------------------------           F(  1,  5300) =  643.03
       Model |  3853.90856     1  3853.90856           Prob > F      =  0.0000
    Residual |  31764.7918  5300  5.99335695           R-squared     =  0.1082
-------------+------------------------------           Adj R-squared =  0.1080
       Total |  35618.7004  5301  6.71924172           Root MSE      =  2.4481

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |   .0536081    .002114    25.36   0.000     .0494637    .0577525
       _cons |   1.808385   .0482889    37.45   0.000     1.713719    1.903051
------------------------------------------------------------------------------

. reg `x' `z' `controls' if `y' !=.

      Source |       SS       df       MS              Number of obs =    4368
-------------+------------------------------           F( 25,  4342) =   93.08
       Model |  10239.4868    25  409.579473           Prob > F      =  0.0000
    Residual |  19106.0826  4342  4.40029538           R-squared     =  0.3489
-------------+------------------------------           Adj R-squared =  0.3452
       Total |  29345.5694  4367  6.71984644           Root MSE      =  2.0977

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |   .0418766   .0020319    20.61   0.000      .037893    .0458601
      female |   .6184683   .0640156     9.66   0.000      .492965    .7439716
       black |   .5959402   .0860471     6.93   0.000     .4272439    .7646364
 multiracial |  -.0831667   .3271235    -0.25   0.799    -.7244958    .5581624
    hispanic |   .2678116   .0872083     3.07   0.002     .0968388    .4387845
       asvab |   4.429018   .1225854    36.13   0.000     4.188688    4.669348
             |
     quarter |
          2  |   .0178432   .2125992     0.08   0.933    -.3989597    .4346462
          3  |   .2675146   .2114487     1.27   0.206    -.1470328    .6820621
          4  |   .0691132   .2110147     0.33   0.743    -.3445834    .4828099
          5  |  -.0273442   .2075606    -0.13   0.895     -.434269    .3795805
          6  |   .2248106   .2075408     1.08   0.279    -.1820753    .6316966
          7  |  -.1431568   .1975603    -0.72   0.469    -.5304758    .2441621
          8  |   .2249495   .2038264     1.10   0.270    -.1746543    .6245533
          9  |   .0361397   .2069525     0.17   0.861    -.3695927    .4418722
         10  |   .3352572   .2071976     1.62   0.106    -.0709559    .7414702
         11  |    .010482   .2013652     0.05   0.958    -.3842965    .4052606
         12  |   -.101571   .2071796    -0.49   0.624    -.5077488    .3046068
         13  |   .0143475   .2052088     0.07   0.944    -.3879666    .4166616
         14  |  -.0598266   .2079963    -0.29   0.774    -.4676056    .3479524
         15  |  -.2190259   .2019103    -1.08   0.278     -.614873    .1768213
         16  |  -.0115415   .2023363    -0.06   0.955    -.4082239    .3851408
         17  |  -.1869136   .2015808    -0.93   0.354    -.5821149    .2082877
         18  |  -.1549728   .2074546    -0.75   0.455    -.5616897    .2517441
         19  |  -.3654002   .2043022    -1.79   0.074    -.7659368    .0351364
         20  |   .0219913   .2099407     0.10   0.917    -.3895996    .4335822
             |
       _cons |  -.5532096   .1731542    -3.19   0.001    -.8926802    -.213739
------------------------------------------------------------------------------

. 
. // "Reduced form": does instrument predict outcome (omitting endog regressor)
. 
. reg `y' `z'

      Source |       SS       df       MS              Number of obs =    5302
-------------+------------------------------           F(  1,  5300) =   33.20
       Model |  47.6531825     1  47.6531825           Prob > F      =  0.0000
    Residual |  7607.34848  5300  1.43534877           R-squared     =  0.0062
-------------+------------------------------           Adj R-squared =  0.0060
       Total |  7655.00167  5301  1.44406747           Root MSE      =  1.1981

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |   .0059611   .0010346     5.76   0.000     .0039329    .0079893
       _cons |   9.973042   .0236315   422.02   0.000     9.926715    10.01937
------------------------------------------------------------------------------

. reg `y' `z' `controls'

      Source |       SS       df       MS              Number of obs =    4368
-------------+------------------------------           F( 25,  4342) =   15.09
       Model |  516.681988    25  20.6672795           Prob > F      =  0.0000
    Residual |  5945.53693  4342  1.36930837           R-squared     =  0.0800
-------------+------------------------------           Adj R-squared =  0.0747
       Total |  6462.21892  4367   1.4797845           Root MSE      =  1.1702

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |   .0035583   .0011335     3.14   0.002     .0013361    .0057804
      female |  -.2672218   .0357105    -7.48   0.000    -.3372325    -.197211
       black |  -.1685182   .0480005    -3.51   0.000    -.2626238   -.0744127
 multiracial |   .1134922   .1824826     0.62   0.534    -.2442668    .4712513
    hispanic |   .0427266   .0486483     0.88   0.380    -.0526489    .1381021
       asvab |    .882516    .068383    12.91   0.000     .7484503    1.016582
             |
     quarter |
          2  |   .0068663   .1185964     0.06   0.954    -.2256431    .2393757
          3  |   -.151991   .1179546    -1.29   0.198    -.3832422    .0792601
          4  |  -.1017429   .1177125    -0.86   0.387    -.3325194    .1290337
          5  |   -.176746   .1157856    -1.53   0.127    -.4037449    .0502529
          6  |  -.0286873   .1157746    -0.25   0.804    -.2556646      .19829
          7  |  -.1496393    .110207    -1.36   0.175    -.3657013    .0664227
          8  |   -.213371   .1137025    -1.88   0.061     -.436286     .009544
          9  |  -.1859684   .1154464    -1.61   0.107    -.4123022    .0403654
         10  |  -.0280492   .1155831    -0.24   0.808    -.2546511    .1985528
         11  |  -.1196401   .1123296    -1.07   0.287    -.3398634    .1005832
         12  |  -.2734059   .1155731    -2.37   0.018    -.4999881   -.0468236
         13  |   -.112806   .1144737    -0.99   0.324    -.3372329     .111621
         14  |  -.2600038   .1160287    -2.24   0.025    -.4874793   -.0325284
         15  |  -.3907083   .1126336    -3.47   0.001    -.6115278   -.1698889
         16  |  -.1238433   .1128713    -1.10   0.273    -.3451286     .097442
         17  |  -.3075271   .1124499    -2.73   0.006    -.5279862    -.087068
         18  |   -.323989   .1157265    -2.80   0.005     -.550872    -.097106
         19  |  -.2181022   .1139679    -1.91   0.056    -.4415376    .0053331
         20  |  -.5205332   .1171133    -4.44   0.000    -.7501351   -.2909313
             |
       _cons |   9.932867   .0965924   102.83   0.000     9.743497    10.12224
------------------------------------------------------------------------------

. 
. 
. // Basic IV estimate
. 
. eststo basic_iv:ivregress 2sls `y' (`x'=`z'), first

First-stage regressions
-----------------------

                                                  Number of obs   =       5302
                                                  F(   1,   5300) =     643.03
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1082
                                                  Adj R-squared   =     0.1080
                                                  Root MSE        =     2.4481

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |   .0536081    .002114    25.36   0.000     .0494637    .0577525
       _cons |   1.808385   .0482889    37.45   0.000     1.713719    1.903051
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    5302
                                                       Wald chi2(1)  =   34.51
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0435
                                                       Root MSE      =  1.1752

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |   .1111976   .0189301     5.87   0.000     .0740952    .1482999
       _cons |   9.771954   .0533704   183.10   0.000      9.66735    9.876558
------------------------------------------------------------------------------
Instrumented:  ccol
Instruments:   prox

. 
. eststo basic_iv_controls:ivregress 2sls `y' `controls' (`x'=`z'), first

First-stage regressions
-----------------------

                                                  Number of obs   =       4368
                                                  F(  25,   4342) =      93.08
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3489
                                                  Adj R-squared   =     0.3452
                                                  Root MSE        =     2.0977

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   .6184683   .0640156     9.66   0.000      .492965    .7439716
       black |   .5959402   .0860471     6.93   0.000     .4272439    .7646364
 multiracial |  -.0831667   .3271235    -0.25   0.799    -.7244958    .5581624
    hispanic |   .2678116   .0872083     3.07   0.002     .0968388    .4387845
       asvab |   4.429018   .1225854    36.13   0.000     4.188688    4.669348
             |
     quarter |
          2  |   .0178432   .2125992     0.08   0.933    -.3989597    .4346462
          3  |   .2675146   .2114487     1.27   0.206    -.1470328    .6820621
          4  |   .0691132   .2110147     0.33   0.743    -.3445834    .4828099
          5  |  -.0273442   .2075606    -0.13   0.895     -.434269    .3795805
          6  |   .2248106   .2075408     1.08   0.279    -.1820753    .6316966
          7  |  -.1431568   .1975603    -0.72   0.469    -.5304758    .2441621
          8  |   .2249495   .2038264     1.10   0.270    -.1746543    .6245533
          9  |   .0361397   .2069525     0.17   0.861    -.3695927    .4418722
         10  |   .3352572   .2071976     1.62   0.106    -.0709559    .7414702
         11  |    .010482   .2013652     0.05   0.958    -.3842965    .4052606
         12  |   -.101571   .2071796    -0.49   0.624    -.5077488    .3046068
         13  |   .0143475   .2052088     0.07   0.944    -.3879666    .4166616
         14  |  -.0598266   .2079963    -0.29   0.774    -.4676056    .3479524
         15  |  -.2190259   .2019103    -1.08   0.278     -.614873    .1768213
         16  |  -.0115415   .2023363    -0.06   0.955    -.4082239    .3851408
         17  |  -.1869136   .2015808    -0.93   0.354    -.5821149    .2082877
         18  |  -.1549728   .2074546    -0.75   0.455    -.5616897    .2517441
         19  |  -.3654002   .2043022    -1.79   0.074    -.7659368    .0351364
         20  |   .0219913   .2099407     0.10   0.917    -.3895996    .4335822
             |
        prox |   .0418766   .0020319    20.61   0.000      .037893    .0458601
       _cons |  -.5532096   .1731542    -3.19   0.001    -.8926802    -.213739
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    4368
                                                       Wald chi2(25) =  385.11
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0931
                                                       Root MSE      =  1.1583

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |   .0849703   .0267921     3.17   0.002     .0324587     .137482
      female |  -.3197732   .0394704    -8.10   0.000    -.3971339   -.2424126
       black |  -.2191555   .0507725    -4.32   0.000    -.3186678   -.1196431
 multiracial |   .1205589   .1805835     0.67   0.504    -.2333782    .4744961
    hispanic |   .0199706    .048647     0.41   0.681    -.0753758    .1153169
       asvab |   .5061808   .1452079     3.49   0.000     .2215785    .7907831
             |
     quarter |
          2  |   .0053501   .1173911     0.05   0.964    -.2247321    .2354324
          3  |  -.1747219   .1170137    -1.49   0.135    -.4040645    .0546208
          4  |  -.1076154   .1165596    -0.92   0.356    -.3360681    .1208372
          5  |  -.1744225   .1146332    -1.52   0.128    -.3990994    .0502543
          6  |  -.0477895   .1148149    -0.42   0.677    -.2728226    .1772435
          7  |  -.1374752   .1092124    -1.26   0.208    -.3515275    .0765771
          8  |  -.2324851   .1126789    -2.06   0.039    -.4533317   -.0116384
          9  |  -.1890392   .1142811    -1.65   0.098     -.413026    .0349475
         10  |  -.0565361   .1148013    -0.49   0.622    -.2815426    .1684704
         11  |  -.1205308   .1111911    -1.08   0.278    -.3384613    .0973998
         12  |  -.2647754   .1144472    -2.31   0.021    -.4890878   -.0404629
         13  |  -.1140251   .1133081    -1.01   0.314     -.336105    .1080548
         14  |  -.2549204   .1148376    -2.22   0.026    -.4799979   -.0298428
         15  |  -.3720976   .1116338    -3.33   0.001    -.5908959   -.1532994
         16  |  -.1228626   .1117301    -1.10   0.271    -.3418496    .0961243
         17  |   -.291645   .1114795    -2.62   0.009    -.5101408   -.0731491
         18  |  -.3108209   .1146411    -2.71   0.007    -.5355132   -.0861285
         19  |  -.1870541   .1131461    -1.65   0.098    -.4088163    .0347082
         20  |  -.5224018   .1159109    -4.51   0.000    -.7495829   -.2952206
             |
       _cons |   9.979873   .0947591   105.32   0.000     9.794149     10.1656
------------------------------------------------------------------------------
Instrumented:  ccol
Instruments:   female black multiracial hispanic asvab 2.quarter 3.quarter
               4.quarter 5.quarter 6.quarter 7.quarter 8.quarter 9.quarter
               10.quarter 11.quarter 12.quarter 13.quarter 14.quarter
               15.quarter 16.quarter 17.quarter 18.quarter 19.quarter
               20.quarter prox

. 
. estat endogenous

  Tests of endogeneity
  Ho: variables are exogenous

  Durbin (score) chi2(1)          =  .335848  (p = 0.5622)
  Wu-Hausman F(1,4341)            =  .333798  (p = 0.5635)

. 
. estat first

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial
      Variable |   R-sq.       R-sq.        R-sq.     F(1,4342)   Prob > F
  -------------+------------------------------------------------------------
          ccol |  0.3489      0.3452       0.0891       424.764    0.0000
  --------------------------------------------------------------------------


  Minimum eigenvalue statistic = 424.764     

  Critical Values                      # of endogenous regressors:    1
  Ho: Instruments are weak             # of excluded instruments:     1
  ---------------------------------------------------------------------
                                     |    5%     10%     20%     30%
  2SLS relative bias                 |         (not available)
  -----------------------------------+---------------------------------
                                     |   10%     15%     20%     25%
  2SLS Size of nominal 5% Wald test  |  16.38    8.96    6.66    5.53
  LIML Size of nominal 5% Wald test  |  16.38    8.96    6.66    5.53
  ---------------------------------------------------------------------


. 
. // Overidentification
. 
. eststo overid:ivregress 2sls `y' (`x'=`z1'), first

First-stage regressions
-----------------------

                                                  Number of obs   =       4789
                                                  F(   2,   4786) =     445.48
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.1569
                                                  Adj R-squared   =     0.1566
                                                  Root MSE        =     2.3795

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        prox |  -.0494803   .0065432    -7.56   0.000    -.0623079   -.0366526
   moth_prox |   .0079572   .0004765    16.70   0.000     .0070231    .0088912
       _cons |   1.859573   .0496796    37.43   0.000     1.762178    1.956968
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    4789
                                                       Wald chi2(1)  =   48.63
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0398
                                                       Root MSE      =  1.1661

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |   .1144925   .0164186     6.97   0.000     .0823126    .1466724
       _cons |   9.773615   .0481815   202.85   0.000     9.679181    9.868049
------------------------------------------------------------------------------
Instrumented:  ccol
Instruments:   prox moth_prox

. 
. eststo overid_controls:ivregress 2sls `y'  `controls' (`x'=`z1'), first

First-stage regressions
-----------------------

                                                  Number of obs   =       3977
                                                  F(  26,   3950) =      84.93
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3586
                                                  Adj R-squared   =     0.3543
                                                  Root MSE        =     2.0826

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   .6278349   .0666627     9.42   0.000     .4971384    .7585314
       black |   .6170494   .0905516     6.81   0.000     .4395171    .7945817
 multiracial |  -.0867883   .3606037    -0.24   0.810    -.7937753    .6201986
    hispanic |   .3959606   .0933629     4.24   0.000     .2129166    .5790047
       asvab |   4.209758   .1308307    32.18   0.000     3.953256     4.46626
             |
     quarter |
          2  |   .1052764   .2214406     0.48   0.635    -.3288722     .539425
          3  |   .4275488    .223523     1.91   0.056    -.0106825    .8657801
          4  |   .0003151    .221997     0.00   0.999    -.4349243    .4355546
          5  |  -.0076427   .2162824    -0.04   0.972    -.4316783     .416393
          6  |   .2769082   .2187824     1.27   0.206    -.1520289    .7058452
          7  |   -.079424   .2059264    -0.39   0.700     -.483156    .3243081
          8  |   .2273353   .2124547     1.07   0.285    -.1891959    .6438666
          9  |  -.0100769   .2178055    -0.05   0.963    -.4370986    .4169448
         10  |   .4494235    .215411     2.09   0.037     .0270963    .8717508
         11  |   -.011158    .211635    -0.05   0.958    -.4260822    .4037662
         12  |  -.0130642   .2169377    -0.06   0.952    -.4383846    .4122561
         13  |   .0357306    .215076     0.17   0.868    -.3859399    .4574011
         14  |  -.0333124   .2178602    -0.15   0.878    -.4604415    .3938166
         15  |  -.2832282   .2115872    -1.34   0.181    -.6980585    .1316022
         16  |   .0332363   .2112449     0.16   0.875    -.3809231    .4473957
         17  |  -.1622147   .2096774    -0.77   0.439    -.5733008    .2488715
         18  |  -.0778598   .2160064    -0.36   0.719    -.5013544    .3456348
         19  |  -.3711379   .2132859    -1.74   0.082    -.7892987    .0470229
         20  |   .0609638   .2191592     0.28   0.781     -.368712    .4906396
             |
        prox |  -.0059497   .0067027    -0.89   0.375    -.0190908    .0071915
   moth_prox |   .0036571   .0004921     7.43   0.000     .0026924    .0046219
       _cons |  -.4920204    .181558    -2.71   0.007    -.8479767   -.1360642
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression               Number of obs =    3977
                                                       Wald chi2(25) =  337.22
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0906
                                                       Root MSE      =  1.1499

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |    .074745   .0264997     2.82   0.005     .0228065    .1266835
      female |  -.3230529   .0406657    -7.94   0.000    -.4027561   -.2433496
       black |  -.2033485   .0534269    -3.81   0.000    -.3080633   -.0986336
 multiracial |   .0931275   .1990473     0.47   0.640     -.296998     .483253
    hispanic |   .0141471   .0508615     0.28   0.781    -.0855395    .1138337
       asvab |   .5182655   .1451781     3.57   0.000     .2337216    .8028094
             |
     quarter |
          2  |  -.0128465   .1221979    -0.11   0.916      -.25235     .226657
          3  |  -.2312774   .1238245    -1.87   0.062     -.473969    .0114142
          4  |  -.1333097   .1225418    -1.09   0.277    -.3734872    .1068678
          5  |  -.2265301   .1194051    -1.90   0.058    -.4605598    .0074996
          6  |  -.0606426   .1210396    -0.50   0.616    -.2978758    .1765907
          7  |   -.202304   .1136908    -1.78   0.075    -.4251338    .0205258
          8  |  -.2669459   .1173705    -2.27   0.023    -.4969878    -.036904
          9  |  -.2070863   .1201973    -1.72   0.085    -.4426686    .0284961
         10  |  -.1068851    .119483    -0.89   0.371    -.3410674    .1272973
         11  |  -.1392318   .1168447    -1.19   0.233    -.3682432    .0897795
         12  |  -.3068547   .1197177    -2.56   0.010     -.541497   -.0722124
         13  |  -.1689369   .1187445    -1.42   0.155    -.4016718    .0637981
         14  |  -.2860186   .1202675    -2.38   0.017    -.5217387   -.0502986
         15  |  -.4669383   .1170515    -3.99   0.000     -.696355   -.2375215
         16  |  -.1720196   .1166141    -1.48   0.140    -.4005791    .0565399
         17  |  -.3432307   .1158985    -2.96   0.003    -.5703877   -.1160738
         18  |   -.350335    .119213    -2.94   0.003    -.5839882   -.1166818
         19  |  -.2016756   .1181323    -1.71   0.088    -.4332108    .0298595
         20  |  -.5051611   .1209867    -4.18   0.000    -.7422907   -.2680315
             |
       _cons |   10.04195   .0994224   101.00   0.000      9.84709    10.23682
------------------------------------------------------------------------------
Instrumented:  ccol
Instruments:   female black multiracial hispanic asvab 2.quarter 3.quarter
               4.quarter 5.quarter 6.quarter 7.quarter 8.quarter 9.quarter
               10.quarter 11.quarter 12.quarter 13.quarter 14.quarter
               15.quarter 16.quarter 17.quarter 18.quarter 19.quarter
               20.quarter prox moth_prox

. 
. estat endogenous

  Tests of endogeneity
  Ho: variables are exogenous

  Durbin (score) chi2(1)          =  .060516  (p = 0.8057)
  Wu-Hausman F(1,3950)            =  .060106  (p = 0.8063)

. 
. estat first

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial
      Variable |   R-sq.       R-sq.        R-sq.     F(2,3950)   Prob > F
  -------------+------------------------------------------------------------
          ccol |  0.3586      0.3543       0.0990       217.058    0.0000
  --------------------------------------------------------------------------


  Minimum eigenvalue statistic = 217.058     

  Critical Values                      # of endogenous regressors:    1
  Ho: Instruments are weak             # of excluded instruments:     2
  ---------------------------------------------------------------------
                                     |    5%     10%     20%     30%
  2SLS relative bias                 |         (not available)
  -----------------------------------+---------------------------------
                                     |   10%     15%     20%     25%
  2SLS Size of nominal 5% Wald test  |  19.93   11.59    8.75    7.25
  LIML Size of nominal 5% Wald test  |   8.68    5.33    4.42    3.92
  ---------------------------------------------------------------------


. 
. estat overid

  Tests of overidentifying restrictions:

  Sargan (score) chi2(1) =   .00003  (p = 0.9956)
  Basmann chi2(1)        =   .00003  (p = 0.9957)

. 
. // Check against LIML
. eststo overid_controls_liml:ivregress liml `y'  `controls' (`x'=`z1'), first

First-stage regressions
-----------------------

                                                  Number of obs   =       3977
                                                  F(  26,   3950) =      84.93
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.3586
                                                  Adj R-squared   =     0.3543
                                                  Root MSE        =     2.0826

------------------------------------------------------------------------------
        ccol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      female |   .6278349   .0666627     9.42   0.000     .4971384    .7585314
       black |   .6170494   .0905516     6.81   0.000     .4395171    .7945817
 multiracial |  -.0867883   .3606037    -0.24   0.810    -.7937753    .6201986
    hispanic |   .3959606   .0933629     4.24   0.000     .2129166    .5790047
       asvab |   4.209758   .1308307    32.18   0.000     3.953256     4.46626
             |
     quarter |
          2  |   .1052764   .2214406     0.48   0.635    -.3288722     .539425
          3  |   .4275488    .223523     1.91   0.056    -.0106825    .8657801
          4  |   .0003151    .221997     0.00   0.999    -.4349243    .4355546
          5  |  -.0076427   .2162824    -0.04   0.972    -.4316783     .416393
          6  |   .2769082   .2187824     1.27   0.206    -.1520289    .7058452
          7  |   -.079424   .2059264    -0.39   0.700     -.483156    .3243081
          8  |   .2273353   .2124547     1.07   0.285    -.1891959    .6438666
          9  |  -.0100769   .2178055    -0.05   0.963    -.4370986    .4169448
         10  |   .4494235    .215411     2.09   0.037     .0270963    .8717508
         11  |   -.011158    .211635    -0.05   0.958    -.4260822    .4037662
         12  |  -.0130642   .2169377    -0.06   0.952    -.4383846    .4122561
         13  |   .0357306    .215076     0.17   0.868    -.3859399    .4574011
         14  |  -.0333124   .2178602    -0.15   0.878    -.4604415    .3938166
         15  |  -.2832282   .2115872    -1.34   0.181    -.6980585    .1316022
         16  |   .0332363   .2112449     0.16   0.875    -.3809231    .4473957
         17  |  -.1622147   .2096774    -0.77   0.439    -.5733008    .2488715
         18  |  -.0778598   .2160064    -0.36   0.719    -.5013544    .3456348
         19  |  -.3711379   .2132859    -1.74   0.082    -.7892987    .0470229
         20  |   .0609638   .2191592     0.28   0.781     -.368712    .4906396
             |
        prox |  -.0059497   .0067027    -0.89   0.375    -.0190908    .0071915
   moth_prox |   .0036571   .0004921     7.43   0.000     .0026924    .0046219
       _cons |  -.4920204    .181558    -2.71   0.007    -.8479767   -.1360642
------------------------------------------------------------------------------


Instrumental variables (LIML) regression               Number of obs =    3977
                                                       Wald chi2(25) =  337.22
                                                       Prob > chi2   =  0.0000
                                                       R-squared     =  0.0906
                                                       Root MSE      =  1.1499

------------------------------------------------------------------------------
       lyinc |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ccol |    .074745   .0264997     2.82   0.005     .0228065    .1266835
      female |  -.3230529   .0406657    -7.94   0.000    -.4027561   -.2433496
       black |  -.2033485   .0534269    -3.81   0.000    -.3080633   -.0986336
 multiracial |   .0931275   .1990473     0.47   0.640     -.296998     .483253
    hispanic |   .0141471   .0508615     0.28   0.781    -.0855395    .1138337
       asvab |   .5182655   .1451781     3.57   0.000     .2337216    .8028094
             |
     quarter |
          2  |  -.0128465   .1221979    -0.11   0.916      -.25235     .226657
          3  |  -.2312774   .1238245    -1.87   0.062     -.473969    .0114142
          4  |  -.1333097   .1225418    -1.09   0.277    -.3734872    .1068678
          5  |  -.2265301   .1194051    -1.90   0.058    -.4605598    .0074996
          6  |  -.0606426   .1210396    -0.50   0.616    -.2978758    .1765907
          7  |   -.202304   .1136908    -1.78   0.075    -.4251338    .0205258
          8  |  -.2669459   .1173705    -2.27   0.023    -.4969878    -.036904
          9  |  -.2070863   .1201973    -1.72   0.085    -.4426686    .0284961
         10  |  -.1068851    .119483    -0.89   0.371    -.3410674    .1272973
         11  |  -.1392318   .1168447    -1.19   0.233    -.3682432    .0897795
         12  |  -.3068547   .1197177    -2.56   0.010     -.541497   -.0722124
         13  |  -.1689369   .1187445    -1.42   0.155    -.4016718    .0637981
         14  |  -.2860186   .1202675    -2.38   0.017    -.5217387   -.0502986
         15  |  -.4669383   .1170515    -3.99   0.000     -.696355   -.2375215
         16  |  -.1720196   .1166141    -1.48   0.140    -.4005791    .0565399
         17  |  -.3432307   .1158985    -2.96   0.003    -.5703877   -.1160738
         18  |   -.350335    .119213    -2.94   0.003    -.5839882   -.1166818
         19  |  -.2016756   .1181323    -1.71   0.088    -.4332108    .0298595
         20  |  -.5051611   .1209867    -4.18   0.000    -.7422907   -.2680315
             |
       _cons |   10.04195   .0994224   101.00   0.000      9.84709    10.23682
------------------------------------------------------------------------------
Instrumented:  ccol
Instruments:   female black multiracial hispanic asvab 2.quarter 3.quarter
               4.quarter 5.quarter 6.quarter 7.quarter 8.quarter 9.quarter
               10.quarter 11.quarter 12.quarter 13.quarter 14.quarter
               15.quarter 16.quarter 17.quarter 18.quarter 19.quarter
               20.quarter prox moth_prox

. 
. 
end of do-file

. exit, clear
