------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/practicum_2017/central/lessons/s2-09-adv_reporting/adv_r
> eporting.log
  log type:  text
 opened on:  13 Mar 2018, 14:17:58

. 
. clear

. 
. set more off

. 
. graph drop _all

. 
. global ddir "../../data/"

. 
. use ${ddir}attend, clear

. 
. describe

Contains data from ../../data/attend.dta
  obs:        16,289                          
 vars:            28                          11 Apr 2013 10:46
 size:       961,051                          
------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
------------------------------------------------------------------------------------
stu_id          long    %12.0f                Student ID
f2evratt        byte    %12.0f     F2EVRATT   Whether has ever attended a
                                                postsecondary institution -
                                                composite
sch_id          int     %8.0g                 school id
strat_id        int     %8.0g                 stratum
psu             byte    %8.0g      psu        primary sampling unit
f1sch_id        int     %8.0g                 link to first follow-up school
f1univ1         int     %8.0g      f1univ1    sample member status in by and f1
                                                rounds
f1univ2a        byte    %8.0g      f1univ2a   base year status and how sample member
                                                entered f1 sample
f1univ2b        byte    %8.0g      f1univ2b   sample member f1 status
g10cohrt        byte    %8.0g      g10cohrt   sophomore cohort member in 2001-2002
                                                school year
g12cohrt        byte    %8.0g      g12cohrt   f1 senior cohort member
bystuwt         float   %9.0g                 student weight
bysex           byte    %8.0g      bysex      sex-composite
byrace          byte    %8.0g      byrace     student^s race/ethnicity-composite
bydob_p         long    %12.0g                student^s year and month of birth
bypared         byte    %8.0g      bypared    parents^ highest level of education
bymothed        byte    %8.0g      bymothed   mother^s highest level of
                                                education-composite
byfathed        byte    %8.0g      byfathed   father^s highest level of
                                                education-composite
byincome        byte    %8.0g      byincome   total family income from all sources
                                                2001-composite
byses1          float   %9.0g                 socio-economic status composite, v.1
byses2          float   %9.0g                 socio-economic status composite, v.2
bystexp         byte    %8.0g      bystexp    how far in school student thinks will
                                                get-composite
bynels2m        float   %9.0g                 els-nels 1992 scale equated sophomore
                                                math score
bynels2r        float   %9.0g                 els-nels 1992 scale equated sophomore
                                                reading score
f1qwt           float   %9.0g                 questionnaire weight for f1
f1pnlwt         float   %9.0g                 panel weight, by and f1 (2002 and
                                                2004)
f1psepln        byte    %8.0g      f1psepln   f1 post-secondary plans right after
                                                high school
_merge          byte    %23.0g     _merge     
------------------------------------------------------------------------------------
Sorted by: 

. 
. /* Missing data*/
. 
. foreach myvar of varlist stu_id-f1psepln{ /* Start outer loop */
  2.               foreach i of numlist -3 -4 -8 -9 { /* Start inner loop */
  3.                      replace `myvar'=. if `myvar'== `i'
  4.                                             }  /* End inner loop */
  5.                                           } /* End outer loop */
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(108 real changes made, 108 to missing)
(1,691 real changes made, 1,691 to missing)
(359 real changes made, 359 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(3,825 real changes made, 3,825 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(171 real changes made, 171 to missing)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(276 real changes made, 276 to missing)
(53 real changes made, 53 to missing)
(0 real changes made)
(651 real changes made, 651 to missing)
(171 real changes made, 171 to missing)
(37 real changes made, 37 to missing)
(0 real changes made)
(651 real changes made, 651 to missing)
(171 real changes made, 171 to missing)
(40 real changes made, 40 to missing)
(0 real changes made)
(651 real changes made, 651 to missing)
(171 real changes made, 171 to missing)
(57 real changes made, 57 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(651 real changes made, 651 to missing)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(276 real changes made, 276 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1,164 real changes made, 1,164 to missing)
(785 real changes made, 785 to missing)
(47 real changes made, 47 to missing)

. 
. /* Recodes */
.   
. local race_names amind asian black hispanic_race hispanic_norace multiracial white

. 
. tab(byrace), gen(race_)

     student^s race/ethnicity-composite |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
amer. indian/alaska native, non-hispani |        131        0.85        0.85
asian, hawaii/pac. islander,non-hispani |      1,465        9.56       10.41
black or african american, non-hispanic |      2,027       13.23       23.64
            hispanic, no race specified |        998        6.51       30.15
               hispanic, race specified |      1,229        8.02       38.17
              multiracial, non-hispanic |        740        4.83       43.00
                    white, non-hispanic |      8,735       57.00      100.00
----------------------------------------+-----------------------------------
                                  Total |     15,325      100.00

. 
. local i=1

. 
. foreach val of local race_names{
  2.   rename race_`i' `val'
  3.   local i=`i'+1
  4. }

. 
. gen hispanic=hispanic_race==1|hispanic_norace==1

. 
. label variable byincome "Income"

. label variable amind "American Indian/AK Native"

. label variable asian "Asian/ PI"

. label variable black "African American"

. label variable hispanic "Hispanic"

. label variable white "White"

. label variable multiracial "Multiracial"

. 
. local race amind asian black hispanic multiracial 

. 
. gen female= bysex==2

. replace female=. if bysex==.
(859 real changes made, 859 to missing)

. 
. gen expect_college=.
(16,289 missing values generated)

. 
. replace expect_college=1 if bystexp>=5 & bystexp <.
(11,300 real changes made)

. replace expect_college=0 if bystexp>0 &bystexp <5
(2,566 real changes made)

. 
. // Grouping variable for test scores
. egen test_group=cut(bynels2m), group(4)
(313 missing values generated)

. 
. /* Set locals */
. 
. local y f2evratt

. 
. local x expect_college

. 
. local ses byses1

. 
. local race amind asian black hispanic multiracial 

. 
. local sex female

. 
. local tests bynels2m bynels2r

. 
. local controls "`ses' `race' `sex' `tests'" 

. 
. local gtype pdf

. 
. local ttype rtf

. 
. local mysig=.001

. 
. // Balance test: how different is the key covariate (treatment variable) by levels
>  of the control variables
. 
. foreach test_level of numlist -1(1)3{
  2.     
. //Counter variable
. local counter=1
  3. 
. foreach race_var of local race{
  4. if `test_level'==-1{
  5.      quietly reg `race_var' `x' // Full sample
  6. }
  7. 
. else quietly reg `race_var' `x' if test_group==`test_level'
  8. 
. scalar my_diff = round(_b[`x'], `mysig')
  9. 
. scalar my_t =round(_b[`x']/_se[`x'],`mysig')
 10.      
. mat M= [my_diff\my_t]
 11. 
. mat li M
 12. 
. if `counter'==1{
 13.     mat M_col=M
 14. }
 15.     else mat M_col=(M_col\M)
 16.  local counter=`counter'+1 
 17.  
.  mat li M_col
 18. } //end loop over race variables
 19. 
.     if `test_level'==-1{
 20.        mat results_tab=M_col
 21.     }
 22.     else mat results_tab=(results_tab,M_col)
 23.         
. mat li results_tab
 24. } // End loop over test scores

M[2,1]
       c1
r1  -.004
r2  -1.83

M_col[2,1]
       c1
r1  -.004
r2  -1.83

M[2,1]
       c1
r1   .036
r2  5.681

M_col[4,1]
       c1
r1  -.004
r2  -1.83
r1   .036
r2  5.681

M[2,1]
        c1
r1   -.031
r2  -4.211

M_col[6,1]
        c1
r1   -.004
r2   -1.83
r1    .036
r2   5.681
r1   -.031
r2  -4.211

M[2,1]
        c1
r1   -.065
r2  -8.595

M_col[8,1]
        c1
r1   -.004
r2   -1.83
r1    .036
r2   5.681
r1   -.031
r2  -4.211
r1   -.065
r2  -8.595

M[2,1]
       c1
r1   .005
r2  1.086

M_col[10,1]
        c1
r1   -.004
r2   -1.83
r1    .036
r2   5.681
r1   -.031
r2  -4.211
r1   -.065
r2  -8.595
r1    .005
r2   1.086

results_tab[10,1]
        c1
r1   -.004
r2   -1.83
r1    .036
r2   5.681
r1   -.031
r2  -4.211
r1   -.065
r2  -8.595
r1    .005
r2   1.086

M[2,1]
      c1
r1  .004
r2  .932

M_col[2,1]
      c1
r1  .004
r2  .932

M[2,1]
      c1
r1  .008
r2  .915

M_col[4,1]
      c1
r1  .004
r2  .932
r1  .008
r2  .915

M[2,1]
       c1
r1    .07
r2  4.454

M_col[6,1]
       c1
r1   .004
r2   .932
r1   .008
r2   .915
r1    .07
r2  4.454

M[2,1]
      c1
r1   .01
r2  .665

M_col[8,1]
       c1
r1   .004
r2   .932
r1   .008
r2   .915
r1    .07
r2  4.454
r1    .01
r2   .665

M[2,1]
       c1
r1   .008
r2  1.132

M_col[10,1]
       c1
r1   .004
r2   .932
r1   .008
r2   .915
r1    .07
r2  4.454
r1    .01
r2   .665
r1   .008
r2  1.132

results_tab[10,2]
        c1      c1
r1   -.004    .004
r2   -1.83    .932
r1    .036    .008
r2   5.681    .915
r1   -.031     .07
r2  -4.211   4.454
r1   -.065     .01
r2  -8.595    .665
r1    .005    .008
r2   1.086   1.132

M[2,1]
       c1
r1  -.002
r2  -.475

M_col[2,1]
       c1
r1  -.002
r2  -.475

M[2,1]
       c1
r1   .039
r2  3.499

M_col[4,1]
       c1
r1  -.002
r2  -.475
r1   .039
r2  3.499

M[2,1]
       c1
r1   .066
r2  4.278

M_col[6,1]
       c1
r1  -.002
r2  -.475
r1   .039
r2  3.499
r1   .066
r2  4.278

M[2,1]
        c1
r1   -.015
r2  -1.001

M_col[8,1]
        c1
r1   -.002
r2   -.475
r1    .039
r2   3.499
r1    .066
r2   4.278
r1   -.015
r2  -1.001

M[2,1]
      c1
r1  .003
r2  .328

M_col[10,1]
        c1
r1   -.002
r2   -.475
r1    .039
r2   3.499
r1    .066
r2   4.278
r1   -.015
r2  -1.001
r1    .003
r2    .328

results_tab[10,3]
        c1      c1      c1
r1   -.004    .004   -.002
r2   -1.83    .932   -.475
r1    .036    .008    .039
r2   5.681    .915   3.499
r1   -.031     .07    .066
r2  -4.211   4.454   4.278
r1   -.065     .01   -.015
r2  -8.595    .665  -1.001
r1    .005    .008    .003
r2   1.086   1.132    .328

M[2,1]
       c1
r1  -.004
r2  -.756

M_col[2,1]
       c1
r1  -.004
r2  -.756

M[2,1]
      c1
r1  .003
r2  .204

M_col[4,1]
       c1
r1  -.004
r2  -.756
r1   .003
r2   .204

M[2,1]
      c1
r1  .009
r2  .608

M_col[6,1]
       c1
r1  -.004
r2  -.756
r1   .003
r2   .204
r1   .009
r2   .608

M[2,1]
      c1
r1  .003
r2  .167

M_col[8,1]
       c1
r1  -.004
r2  -.756
r1   .003
r2   .204
r1   .009
r2   .608
r1   .003
r2   .167

M[2,1]
       c1
r1  -.002
r2  -.169

M_col[10,1]
       c1
r1  -.004
r2  -.756
r1   .003
r2   .204
r1   .009
r2   .608
r1   .003
r2   .167
r1  -.002
r2  -.169

results_tab[10,4]
        c1      c1      c1      c1
r1   -.004    .004   -.002   -.004
r2   -1.83    .932   -.475   -.756
r1    .036    .008    .039    .003
r2   5.681    .915   3.499    .204
r1   -.031     .07    .066    .009
r2  -4.211   4.454   4.278    .608
r1   -.065     .01   -.015    .003
r2  -8.595    .665  -1.001    .167
r1    .005    .008    .003   -.002
r2   1.086   1.132    .328   -.169

M[2,1]
        c1
r1   -.011
r2  -2.907

M_col[2,1]
        c1
r1   -.011
r2  -2.907

M[2,1]
       c1
r1   .033
r2  1.198

M_col[4,1]
        c1
r1   -.011
r2  -2.907
r1    .033
r2   1.198

M[2,1]
      c1
r1  .013
r2  .894

M_col[6,1]
        c1
r1   -.011
r2  -2.907
r1    .033
r2   1.198
r1    .013
r2    .894

M[2,1]
       c1
r1  -.055
r2   -2.8

M_col[8,1]
        c1
r1   -.011
r2  -2.907
r1    .033
r2   1.198
r1    .013
r2    .894
r1   -.055
r2    -2.8

M[2,1]
      c1
r1  .028
r2  1.63

M_col[10,1]
        c1
r1   -.011
r2  -2.907
r1    .033
r2   1.198
r1    .013
r2    .894
r1   -.055
r2    -2.8
r1    .028
r2    1.63

results_tab[10,5]
        c1      c1      c1      c1      c1
r1   -.004    .004   -.002   -.004   -.011
r2   -1.83    .932   -.475   -.756  -2.907
r1    .036    .008    .039    .003    .033
r2   5.681    .915   3.499    .204   1.198
r1   -.031     .07    .066    .009    .013
r2  -4.211   4.454   4.278    .608    .894
r1   -.065     .01   -.015    .003   -.055
r2  -8.595    .665  -1.001    .167    -2.8
r1    .005    .008    .003   -.002    .028
r2   1.086   1.132    .328   -.169    1.63

. 
. matrix rownames results_tab= ///
>  "Native American" "t value" ///
>  "Asian"  "t value" ///
>  "African American" "t value" ///
>  "Hispanic" "t value" /// 
>  "Multiracial" "t value" 

. 
. 
. matrix colnames results_tab = "Full Sample" "Lowest Quartile" "2nd Quartile" "3rd 
> Quartile" "4th Quartile" 

. 
.     // Table
.     
. estout matrix(results_tab) using "baseline_tab.`ttype'", style(fixed) replace
(output written to baseline_tab.rtf)

.   
.   
. // Regression results
. 
. foreach test_level of numlist 0(1)3{
  2.     
. quietly reg `y' `x' if test_group==`test_level'
  3. 
. scalar my_coeff = round(_b[`x'], `mysig')
  4. 
. scalar my_se =round(_se[`x'],`mysig')
  5. 
. scalar my_n=round(e(N))
  6.     
. mat M1= [my_coeff\my_se\my_n]
  7.     
. quietly reg `y' `x' `controls' if test_group==`test_level'
  8. 
. scalar my_coeff = round(_b[`x'], `mysig')
  9. 
. scalar my_se =round(_se[`x'],`mysig')
 10. 
. scalar my_n=round(e(N))
 11.     
. mat M2= [my_coeff\my_se\my_n]
 12.     
. mat M=(M1,M2)   
 13. 
.     if `test_level'==0{
 14.         mat reg_results=M
 15.     }
 16.     else mat reg_results=(reg_results,M)
 17.     
. } // end loop over test levels    

. 
.     
. matrix rownames reg_results= "Expect College" "SE" "N"

. matrix colnames reg_results="Lowest Quartile" "2nd Quartile" "3rd Quartile" "4th Q
> uartile" 

. 
. 
. // Table
.     
. estout matrix(reg_results) using "reg_resuts.`ttype'", style(fixed) replace
(note: file reg_resuts.rtf not found)
(output written to reg_resuts.rtf)

. 
. exit 

end of do-file


