----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/practicum_2018/central/lessons/s2-06-model_design/model_design_do.
> log
  log type:  text
 opened on:  19 Feb 2019, 15:56:18

. 
. /* Model specification, interactions, prediction and plots after interaction*/
. /* Will Doyle */
. /* 2019-02-19 */
. /* Practicum Folder */
. 
. clear

. 
. clear matrix

. 
. graph drop _all

. 
. estimates clear /* Clears any estimates hanging around */

. 
. set more off /*Get rid of annoying "more" feature */

. 
. //ssc install bcuse
. 
. ssc install nnest
checking nnest consistency and verifying not already installed...
all files already exist and are up to date.

. 
. bcuse wage2, clear

Contains data from http://fmwww.bc.edu/ec-p/data/wooldridge/wage2.dta
  obs:           935                          
 vars:            17                          26 Jan 2000 12:16
 size:        63,580                          
----------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------
wage            float   %9.0g                 
hours           float   %9.0g                 
IQ              float   %9.0g                 
KWW             float   %9.0g                 
educ            float   %9.0g                 
exper           float   %9.0g                 
tenure          float   %9.0g                 
age             float   %9.0g                 
married         float   %9.0g                 
black           float   %9.0g                 
south           float   %9.0g                 
urban           float   %9.0g                 
sibs            float   %9.0g                 
brthord         float   %9.0g                 
meduc           float   %9.0g                 
feduc           float   %9.0g                 
lwage           float   %9.0g                 
----------------------------------------------------------------------------------------------
Sorted by: 

. 
. label variable wage "Wages from work in last month"

. 
. label variable hours "Weekly hours"

. 
. label variable IQ "IQ test"

. 
. label variable KWW "Knowledge of world of work"

. 
. label variable educ "Years of education"

. 
. label variable tenure "Months in current job"

. 
. label variable age "Age"

. 
. label variable married "Married"

. 
. label variable black "African-American"

. 
. label variable south "South"

. 
. label variable urban "Urban"

. 
. label variable sibs "No. Siblings"

. 
. label variable brthord "Birth order"

. 
. label variable meduc "Mother's years of school"

. 
. label variable feduc "Father's years of education"

. 
. label variable lwage "ln Wage"

. 
. renvars *, lower

. 
. save wage2, replace
file wage2.dta saved

. 
. /*Constants*/
. 
. local sig=.05

. 
. local sigtail=`sig'/2

. 
. /*Plots of data */
. 
. graph twoway scatter wage educ 

. 
. graph export "wage_educ.pdf", replace 
(file /Users/doylewr/practicum_2018/central/lessons/s2-06-model_design/wage_educ.pdf written i
> n PDF format)

. 
. graph twoway qfit wage age||scatter wage age 

. 
. graph export "wage_age.pdf", replace  
(file /Users/doylewr/practicum_2018/central/lessons/s2-06-model_design/wage_age.pdf written in
>  PDF format)

. 
. /*Missing Data */ 
.     
. di _N
935

.   
. reg lwage hours educ age

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(3, 931)       =     46.91
       Model |  21.7514568         3  7.25048559   Prob > F        =    0.0000
    Residual |  143.904838       931   .15457018   R-squared       =    0.1313
-------------+----------------------------------   Adj R-squared   =    0.1285
       Total |  165.656294       934  .177362199   Root MSE        =    .39315

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0047011   .0017887    -2.63   0.009    -.0082115   -.0011906
        educ |   .0616404   .0058814    10.48   0.000     .0500981    .0731827
         age |   .0227339   .0041411     5.49   0.000     .0146069    .0308608
       _cons |   5.403279   .1732026    31.20   0.000     5.063366    5.743191
------------------------------------------------------------------------------

. 
. reg lwage hours educ age meduc

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(4, 852)       =     38.47
       Model |  22.8514162         4  5.71285406   Prob > F        =    0.0000
    Residual |  126.509635       852  .148485487   R-squared       =    0.1530
-------------+----------------------------------   Adj R-squared   =    0.1490
       Total |  149.361051       856  .174487209   Root MSE        =    .38534

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0058052   .0018374    -3.16   0.002    -.0094115   -.0021989
        educ |   .0525597   .0064521     8.15   0.000     .0398957    .0652236
         age |   .0243798   .0042747     5.70   0.000     .0159896      .03277
       meduc |   .0184424   .0049725     3.71   0.000     .0086826    .0282022
       _cons |    5.33402   .1776844    30.02   0.000      4.98527    5.682771
------------------------------------------------------------------------------

. 
. reg lwage hours educ age feduc

      Source |       SS           df       MS      Number of obs   =       741
-------------+----------------------------------   F(4, 736)       =     34.17
       Model |  20.2139719         4  5.05349299   Prob > F        =    0.0000
    Residual |  108.836202       736  .147875274   R-squared       =    0.1566
-------------+----------------------------------   Adj R-squared   =    0.1521
       Total |  129.050173       740  .174392126   Root MSE        =    .38455

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |   -.007041   .0019639    -3.59   0.000    -.0108964   -.0031855
        educ |   .0475258   .0070026     6.79   0.000     .0337785    .0612732
         age |   .0262759   .0045806     5.74   0.000     .0172834    .0352685
       feduc |   .0172076   .0047569     3.62   0.000     .0078689    .0265462
       _cons |   5.421121   .1897058    28.58   0.000     5.048692     5.79355
------------------------------------------------------------------------------

. 
. reg lwage hours educ age feduc meduc 

      Source |       SS           df       MS      Number of obs   =       722
-------------+----------------------------------   F(5, 716)       =     27.64
       Model |   20.519095         5  4.10381899   Prob > F        =    0.0000
    Residual |  106.292836       716  .148453682   R-squared       =    0.1618
-------------+----------------------------------   Adj R-squared   =    0.1560
       Total |  126.811931       721    .1758834   Root MSE        =     .3853

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0071408   .0019821    -3.60   0.000    -.0110321   -.0032495
        educ |    .046006   .0072322     6.36   0.000     .0318071    .0602049
         age |   .0249456   .0046705     5.34   0.000     .0157762     .034115
       feduc |   .0114239   .0055571     2.06   0.040     .0005138     .022334
       meduc |   .0132414   .0063094     2.10   0.036     .0008543    .0256285
       _cons |   5.404781   .1929204    28.02   0.000     5.026024    5.783539
------------------------------------------------------------------------------

. 
. gen analytic_sample_flag=e(sample)

. 
. reg lwage hours educ age if analytic_sample_flag==1 

      Source |       SS           df       MS      Number of obs   =       722
-------------+----------------------------------   F(3, 718)       =     39.52
       Model |   17.972245         3  5.99074834   Prob > F        =    0.0000
    Residual |  108.839686       718  .151587307   R-squared       =    0.1417
-------------+----------------------------------   Adj R-squared   =    0.1381
       Total |  126.811931       721    .1758834   Root MSE        =    .38934

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0067617   .0019997    -3.38   0.001    -.0106877   -.0028357
        educ |   .0593979   .0065158     9.12   0.000     .0466056    .0721902
         age |   .0236215   .0046986     5.03   0.000      .014397    .0328461
       _cons |    5.50891   .1932456    28.51   0.000     5.129516    5.888304
------------------------------------------------------------------------------

. 
. reg lwage hours educ age meduc if analytic_sample_flag==1 

      Source |       SS           df       MS      Number of obs   =       722
-------------+----------------------------------   F(4, 717)       =     33.35
       Model |  19.8917203         4  4.97293007   Prob > F        =    0.0000
    Residual |  106.920211       717  .149121633   R-squared       =    0.1569
-------------+----------------------------------   Adj R-squared   =    0.1522
       Total |  126.811931       721    .1758834   Root MSE        =    .38616

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0071587   .0019865    -3.60   0.000    -.0110588   -.0032587
        educ |    .050238   .0069486     7.23   0.000      .036596    .0638801
         age |   .0240817    .004662     5.17   0.000      .014929    .0332345
       meduc |   .0196873   .0054874     3.59   0.000      .008914    .0304606
       _cons |   5.423663   .1931347    28.08   0.000     5.044485     5.80284
------------------------------------------------------------------------------

. 
. gen meduc_flag=meduc==.

. 
. gen feduc_flag=feduc==.

. 
. tab meduc_flag feduc_flag

           |      feduc_flag
meduc_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |       722        135 |       857 
         1 |        19         59 |        78 
-----------+----------------------+----------
     Total |       741        194 |       935 

. 
. /* Quick digression: log transform */
. 
. preserve

. 
. clear

. 
. di log(0)
.

. di log(1)
0

. di log(10)
2.3025851

. di log(100)
4.6051702

. di log(1000)
6.9077553

. 
. set obs 1000
number of observations (_N) was 0, now 1,000

. 
. egen fakenumber= fill(1(10)1000)

. 
. gen log_fakenumber=log(fakenumber)

. 
. graph twoway line log_fakenumber fakenumber

. 
. restore

. 
. /*NOOOOOOOO!!! Stepwise regression*/
. 
. stepwise, pr(.2): reg lwage hours educ age meduc feduc tenure south married black urban sibs
>  kww iq brthord
                      begin with full model
p = 0.3500 >= 0.2000  removing feduc
p = 0.2712 >= 0.2000  removing sibs
p = 0.2237 >= 0.2000  removing brthord

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(11, 651)      =     23.26
       Model |  31.7400529        11  2.88545936   Prob > F        =    0.0000
    Residual |  80.7431222       651  .124029374   R-squared       =    0.2822
-------------+----------------------------------   Adj R-squared   =    0.2700
       Total |  112.483175       662  .169914162   Root MSE        =    .35218

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0067126   .0019326    -3.47   0.001    -.0105074   -.0029177
        educ |   .0332989   .0078237     4.26   0.000     .0179361    .0486617
         age |   .0157517    .005244     3.00   0.003     .0054545    .0260488
       meduc |   .0134071   .0053659     2.50   0.013     .0028706    .0239437
         kww |   .0034485   .0023844     1.45   0.149    -.0012335    .0081305
      tenure |   .0081709   .0028567     2.86   0.004     .0025613    .0137804
       south |  -.0585439   .0305602    -1.92   0.056    -.1185524    .0014646
     married |   .2077864   .0461308     4.50   0.000     .1172033    .2983696
       black |  -.0938556    .054557    -1.72   0.086    -.2009845    .0132733
       urban |   .1980571   .0312361     6.34   0.000     .1367215    .2593928
          iq |   .0034329    .001223     2.81   0.005     .0010314    .0058343
       _cons |   5.151168   .2180037    23.63   0.000     4.723092    5.579243
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage hours educ age meduc feduc tenure south married black urban sib
> s kww iq brthord
                      begin with full model
p = 0.3500 >= 0.0500  removing feduc
p = 0.2712 >= 0.0500  removing sibs
p = 0.2237 >= 0.0500  removing brthord
p = 0.1486 >= 0.0500  removing kww
p = 0.0689 >= 0.0500  removing south

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(9, 653)       =     27.69
       Model |  31.0680934         9  3.45201038   Prob > F        =    0.0000
    Residual |  81.4150818       653  .124678533   R-squared       =    0.2762
-------------+----------------------------------   Adj R-squared   =    0.2662
       Total |  112.483175       662  .169914162   Root MSE        =     .3531

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0064609   .0019327    -3.34   0.001    -.0102559   -.0026659
        educ |   .0347812   .0076565     4.54   0.000     .0197469    .0498156
         age |   .0195908   .0047192     4.15   0.000     .0103242    .0288574
       meduc |   .0150286   .0053333     2.82   0.005      .004556    .0255011
          iq |   .0040984   .0011802     3.47   0.001     .0017809    .0064159
      tenure |   .0088182   .0028499     3.09   0.002     .0032221    .0144143
       urban |   .2102756   .0308692     6.81   0.000     .1496607    .2708905
     married |   .2095021   .0461979     4.53   0.000     .1187877    .3002164
       black |  -.1163507   .0538301    -2.16   0.031    -.2220516   -.0106498
       _cons |   5.000151    .206967    24.16   0.000      4.59375    5.406552
------------------------------------------------------------------------------

. 
. stepwise, pr(.2) : reg lwage south brthord iq kww sibs feduc tenure  married black urban hou
> rs educ age meduc
                      begin with full model
p = 0.3500 >= 0.2000  removing feduc
p = 0.2712 >= 0.2000  removing sibs
p = 0.2237 >= 0.2000  removing brthord

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(11, 651)      =     23.26
       Model |  31.7400529        11  2.88545936   Prob > F        =    0.0000
    Residual |  80.7431222       651  .124029374   R-squared       =    0.2822
-------------+----------------------------------   Adj R-squared   =    0.2700
       Total |  112.483175       662  .169914162   Root MSE        =    .35218

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.0585439   .0305602    -1.92   0.056    -.1185524    .0014646
        educ |   .0332989   .0078237     4.26   0.000     .0179361    .0486617
          iq |   .0034329    .001223     2.81   0.005     .0010314    .0058343
         kww |   .0034485   .0023844     1.45   0.149    -.0012335    .0081305
         age |   .0157517    .005244     3.00   0.003     .0054545    .0260488
       meduc |   .0134071   .0053659     2.50   0.013     .0028706    .0239437
      tenure |   .0081709   .0028567     2.86   0.004     .0025613    .0137804
     married |   .2077864   .0461308     4.50   0.000     .1172033    .2983696
       black |  -.0938556    .054557    -1.72   0.086    -.2009845    .0132733
       urban |   .1980571   .0312361     6.34   0.000     .1367215    .2593928
       hours |  -.0067126   .0019326    -3.47   0.001    -.0105074   -.0029177
       _cons |   5.151168   .2180037    23.63   0.000     4.723092    5.579243
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage south brthord iq kww sibs feduc tenure  married black urban hou
> rs educ age meduc
                      begin with full model
p = 0.3500 >= 0.0500  removing feduc
p = 0.2712 >= 0.0500  removing sibs
p = 0.2237 >= 0.0500  removing brthord
p = 0.1486 >= 0.0500  removing kww
p = 0.0689 >= 0.0500  removing south

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(9, 653)       =     27.69
       Model |  31.0680934         9  3.45201038   Prob > F        =    0.0000
    Residual |  81.4150818       653  .124678533   R-squared       =    0.2762
-------------+----------------------------------   Adj R-squared   =    0.2662
       Total |  112.483175       662  .169914162   Root MSE        =     .3531

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       urban |   .2102756   .0308692     6.81   0.000     .1496607    .2708905
        educ |   .0347812   .0076565     4.54   0.000     .0197469    .0498156
          iq |   .0040984   .0011802     3.47   0.001     .0017809    .0064159
       hours |  -.0064609   .0019327    -3.34   0.001    -.0102559   -.0026659
         age |   .0195908   .0047192     4.15   0.000     .0103242    .0288574
       meduc |   .0150286   .0053333     2.82   0.005      .004556    .0255011
      tenure |   .0088182   .0028499     3.09   0.002     .0032221    .0144143
     married |   .2095021   .0461979     4.53   0.000     .1187877    .3002164
       black |  -.1163507   .0538301    -2.16   0.031    -.2220516   -.0106498
       _cons |   5.000151    .206967    24.16   0.000      4.59375    5.406552
------------------------------------------------------------------------------

.   
. stepwise, pr(.2) : reg lwage south brthord  kww sibs feduc tenure  married black  hours educ
>  age meduc
                      begin with full model
p = 0.5103 >= 0.2000  removing sibs
p = 0.2146 >= 0.2000  removing brthord

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(10, 652)      =     19.75
       Model |  26.1546559        10  2.61546559   Prob > F        =    0.0000
    Residual |  86.3285193       652  .132405704   R-squared       =    0.2325
-------------+----------------------------------   Adj R-squared   =    0.2207
       Total |  112.483175       662  .169914162   Root MSE        =    .36388

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.0886972   .0312376    -2.84   0.005    -.1500357   -.0273588
         age |   .0120413   .0053403     2.25   0.024     .0015551    .0225275
         kww |   .0066253   .0023708     2.79   0.005       .00197    .0112805
       meduc |   .0106574   .0062851     1.70   0.090    -.0016842    .0229989
       feduc |   .0084136   .0055693     1.51   0.131    -.0025224    .0193497
      tenure |   .0078097   .0029507     2.65   0.008     .0020157    .0136036
     married |   .1987501   .0476411     4.17   0.000     .1052016    .2922985
       black |  -.0799257   .0545557    -1.47   0.143    -.1870519    .0272004
       hours |   -.006741   .0019951    -3.38   0.001    -.0106585   -.0028235
        educ |   .0412033   .0075936     5.43   0.000     .0262926    .0561141
       _cons |   5.508661   .2030461    27.13   0.000     5.109958    5.907365
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage south brthord  kww sibs feduc tenure  married black  hours educ
>  age meduc
                      begin with full model
p = 0.5103 >= 0.0500  removing sibs
p = 0.2146 >= 0.0500  removing brthord
p = 0.1434 >= 0.0500  removing black
p = 0.1099 >= 0.0500  removing feduc

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(8, 654)       =     24.00
       Model |  25.5304974         8  3.19131217   Prob > F        =    0.0000
    Residual |  86.9526778       654  .132955165   R-squared       =    0.2270
-------------+----------------------------------   Adj R-squared   =    0.2175
       Total |  112.483175       662  .169914162   Root MSE        =    .36463

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.1005921   .0307895    -3.27   0.001    -.1610502    -.040134
         age |   .0108531   .0053138     2.04   0.042      .000419    .0212872
         kww |   .0074534   .0023359     3.19   0.001     .0028667    .0120401
       meduc |   .0161784   .0055007     2.94   0.003     .0053773    .0269795
       hours |  -.0066665   .0019986    -3.34   0.001    -.0105909   -.0027422
      tenure |   .0077155    .002955     2.61   0.009     .0019132    .0135178
     married |   .2023529   .0476962     4.24   0.000     .1086967    .2960091
        educ |   .0438651   .0073657     5.96   0.000     .0294018    .0583284
       _cons |     5.4996   .2016607    27.27   0.000      5.10362    5.895581
------------------------------------------------------------------------------

. 
. /*Functional Form */
. 
. /* F Test */
. 
. reg lwage south brthord kww sibs feduc tenure married black hours educ age meduc

      Source |       SS           df       MS      Number of obs   =       663
-------------+----------------------------------   F(12, 650)      =     16.63
       Model |   26.416293        12  2.20135775   Prob > F        =    0.0000
    Residual |  86.0668822       650  .132410588   R-squared       =    0.2348
-------------+----------------------------------   Adj R-squared   =    0.2207
       Total |  112.483175       662  .169914162   Root MSE        =    .36388

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |     -.0838   .0314578    -2.66   0.008    -.1455711   -.0220289
     brthord |  -.0167837   .0119862    -1.40   0.162      -.04032    .0067526
         kww |   .0067305   .0023903     2.82   0.005     .0020369    .0114241
        sibs |   .0053631   .0081421     0.66   0.510    -.0106248     .021351
       feduc |   .0079674   .0055787     1.43   0.154     -.002987    .0189218
      tenure |   .0078633    .002952     2.66   0.008     .0020668    .0136598
     married |   .1967992   .0476677     4.13   0.000     .1031979    .2904005
       black |  -.0846613   .0558859    -1.51   0.130       -.1944    .0250775
       hours |  -.0069189   .0019991    -3.46   0.001    -.0108444   -.0029934
        educ |   .0409417   .0076049     5.38   0.000     .0260086    .0558747
         age |   .0118407   .0053439     2.22   0.027     .0013473    .0223341
       meduc |   .0096308   .0063914     1.51   0.132    -.0029196    .0221812
       _cons |   5.560053   .2098306    26.50   0.000     5.148025     5.97208
------------------------------------------------------------------------------

. 
. test meduc feduc

 ( 1)  meduc = 0
 ( 2)  feduc = 0

       F(  2,   650) =    4.01
            Prob > F =    0.0187

. 
. test meduc=feduc

 ( 1)  - feduc + meduc = 0

       F(  1,   650) =    0.03
            Prob > F =    0.8711

. 
. test educ tenure hours

 ( 1)  educ = 0
 ( 2)  tenure = 0
 ( 3)  hours = 0

       F(  3,   650) =   15.51
            Prob > F =    0.0000

. 
. 
.  /*RESET test */
. 
. reg lwage hours age educ

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(3, 931)       =     46.91
       Model |  21.7514568         3  7.25048559   Prob > F        =    0.0000
    Residual |  143.904838       931   .15457018   R-squared       =    0.1313
-------------+----------------------------------   Adj R-squared   =    0.1285
       Total |  165.656294       934  .177362199   Root MSE        =    .39315

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0047011   .0017887    -2.63   0.009    -.0082115   -.0011906
         age |   .0227339   .0041411     5.49   0.000     .0146069    .0308608
        educ |   .0616404   .0058814    10.48   0.000     .0500981    .0731827
       _cons |   5.403279   .1732026    31.20   0.000     5.063366    5.743191
------------------------------------------------------------------------------

. 
. estat ovtest

Ramsey RESET test using powers of the fitted values of lwage
       Ho:  model has no omitted variables
                 F(3, 928) =      0.32
                  Prob > F =      0.8089

. 
. estat ovtest, rhs

Ramsey RESET test using powers of the independent variables
       Ho:  model has no omitted variables
                 F(9, 922) =      2.12
                  Prob > F =      0.0255

. 
. gen agesq=age^2

. 
. label var agesq "Age squared"

. 
. reg lwage hours educ age agesq

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(4, 930)       =     35.15
       Model |  21.7551592         4  5.43878981   Prob > F        =    0.0000
    Residual |  143.901135       930  .154732403   R-squared       =    0.1313
-------------+----------------------------------   Adj R-squared   =    0.1276
       Total |  165.656294       934  .177362199   Root MSE        =    .39336

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |     -.0047   .0017897    -2.63   0.009    -.0082123   -.0011876
        educ |   .0615585   .0059083    10.42   0.000     .0499634    .0731536
         age |   .0388675   .1043805     0.37   0.710    -.1659811    .2437162
       agesq |  -.0002425   .0015678    -0.15   0.877    -.0033193    .0028343
       _cons |   5.138356   1.721371     2.99   0.003     1.760134    8.516578
------------------------------------------------------------------------------

. 
. test age agesq

 ( 1)  age = 0
 ( 2)  agesq = 0

       F(  2,   930) =   15.07
            Prob > F =    0.0000

. 
. gen educsq=educ^2

. 
. la var educsq "Education squared"

. 
. reg lwage hours age educ educsq

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(4, 930)       =     36.27
       Model |  22.3576551         4  5.58941378   Prob > F        =    0.0000
    Residual |  143.298639       930  .154084558   R-squared       =    0.1350
-------------+----------------------------------   Adj R-squared   =    0.1312
       Total |  165.656294       934  .177362199   Root MSE        =    .39254

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |   -.004608   .0017866    -2.58   0.010    -.0081141   -.0011018
         age |   .0243563   .0042147     5.78   0.000     .0160848    .0326278
        educ |   .2161619   .0781252     2.77   0.006     .0628397     .369484
      educsq |  -.0054912   .0027685    -1.98   0.048    -.0109245    -.000058
       _cons |   4.286926   .5887928     7.28   0.000      3.13141    5.442443
------------------------------------------------------------------------------

. 
. test educ educsq

 ( 1)  educ = 0
 ( 2)  educsq = 0

       F(  2,   930) =   57.06
            Prob > F =    0.0000

. 
. /*Preferred method */
. 
. reg lwage hours age agesq educ educsq

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(5, 929)       =     29.00
       Model |  22.3674226         5  4.47348452   Prob > F        =    0.0000
    Residual |  143.288872       929  .154239905   R-squared       =    0.1350
-------------+----------------------------------   Adj R-squared   =    0.1304
       Total |  165.656294       934  .177362199   Root MSE        =    .39273

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0046056   .0017875    -2.58   0.010    -.0081135   -.0010976
         age |    .050602   .1043806     0.48   0.628     -.154247     .255451
       agesq |  -.0003944   .0015672    -0.25   0.801    -.0034699    .0026812
        educ |   .2169837   .0782328     2.77   0.006     .0634502    .3705171
      educsq |  -.0055252   .0027732    -1.99   0.047    -.0109676   -.0000828
       _cons |   3.849225   1.836393     2.10   0.036     .2452658    7.453184
------------------------------------------------------------------------------

. 
. test age agesq

 ( 1)  age = 0
 ( 2)  agesq = 0

       F(  2,   929) =   16.71
            Prob > F =    0.0000

. 
. test educ educsq

 ( 1)  educ = 0
 ( 2)  educsq = 0

       F(  2,   929) =   56.44
            Prob > F =    0.0000

. 
. /* Davidson-MacKinnon Test:non-nested alternatives */
. 
. reg lwage hours iq 

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(2, 932)       =     54.14
       Model |  17.2420918         2  8.62104588   Prob > F        =    0.0000
    Residual |  148.414203       932  .159242707   R-squared       =    0.1041
-------------+----------------------------------   Adj R-squared   =    0.1022
       Total |  165.656294       934  .177362199   Root MSE        =    .39905

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0041302   .0018124    -2.28   0.023     -.007687   -.0005734
          iq |   .0089535   .0008698    10.29   0.000     .0072465    .0106606
       _cons |   6.053607   .1150416    52.62   0.000     5.827837    6.279378
------------------------------------------------------------------------------

. 
. nnest educ age

                   Competing Models                 
  --------------------------------------------------
  M1 : Y = [lwage]
       X = [hours iq]
  M2 : Y = [lwage]
       Z = [educ age]
  --------------------------------------------------
             J test for non-nested models           
  --------------------------------------------------
                    Dist         Stat      P>|Stat|
  H0:M1 / H1:M2    t(931)        8.18       0.000
  H0:M2 / H1:M1    t(931)        6.77       0.000
  --------------------------------------------------
        Cox-Pesaran test for non-nested models      
  --------------------------------------------------
                    Dist         Stat      P>|Stat|
  H0:M1 / H1:M2    N(0,1)      -12.47       0.000
  H0:M2 / H1:M1    N(0,1)      -10.17       0.000
  --------------------------------------------------

. 
. /* Interactions */
.                                                                 
. /*Binary-binary interaction*/
. 
. gen black_marry=black*married

.   
. eststo black_marry: reg lwage hours age educ i.black##i.married iq meduc south urban

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(10, 846)      =     29.83
       Model |  38.9381574        10  3.89381574   Prob > F        =    0.0000
    Residual |  110.422894       846  .130523515   R-squared       =    0.2607
-------------+----------------------------------   Adj R-squared   =    0.2520
       Total |  149.361051       856  .174487209   Root MSE        =    .36128

-------------------------------------------------------------------------------
        lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        hours |  -.0063301   .0017273    -3.66   0.000    -.0097204   -.0029398
          age |   .0220385   .0040456     5.45   0.000     .0140979    .0299792
         educ |   .0363765   .0068217     5.33   0.000     .0229871    .0497659
      1.black |  -.2750052   .1036788    -2.65   0.008     -.478503   -.0715073
    1.married |   .1817023   .0438419     4.14   0.000     .0956506     .267754
              |
black#married |
         1 1  |    .153022   .1108707     1.38   0.168    -.0645919    .3706359
              |
           iq |   .0039649   .0010438     3.80   0.000     .0019162    .0060137
        meduc |   .0104632   .0047967     2.18   0.029     .0010483    .0198781
        south |  -.0729291   .0276262    -2.64   0.008    -.1271531   -.0187051
        urban |    .179466   .0280946     6.39   0.000     .1243228    .2346092
        _cons |   5.084363   .1866763    27.24   0.000     4.717961    5.450766
-------------------------------------------------------------------------------

. 
. 
. /*Binary-continous interaction*/
. 
. /* PLotting interactions in raw data */
. 
. gen educ_adj=educ+.2

.   
. graph twoway (scatter wage educ if black==0, msize(small) mcolor(red)) ///
>     (scatter wage educ_adj if black==1, msize(small) mcolor(blue))   ///
>         (lfit wage educ if black==0, lcolor(red))  ///
>             (lfit wage educ if black==1, lcolor(blue)), ///
>                         legend(order(1 "White" 2 "Black")) 

.                         
. graph twoway (scatter wage educ if married==0, msize(small) mcolor(red)) ///
>     (scatter wage educ_adj if married==1, msize(small) mcolor(blue))   ///
>         (lfit wage educ if married==0, lcolor(red))  ///
>             (lfit wage educ if married==1, lcolor(blue)), ///
>                 legend(order(1 "Unmarried" 2 "Married"))                        

. 
.                                 
. graph export interact1.pdf, replace
(file /Users/doylewr/practicum_2018/central/lessons/s2-06-model_design/interact1.pdf written i
> n PDF format)

. 
. eststo black_educ: reg lwage hours age i.black##c.educ married  iq meduc south urban

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(10, 846)      =     29.69
       Model |  38.7974052        10  3.87974052   Prob > F        =    0.0000
    Residual |  110.563646       846  .130689889   R-squared       =    0.2598
-------------+----------------------------------   Adj R-squared   =    0.2510
       Total |  149.361051       856  .174487209   Root MSE        =    .36151

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0063045     .00173    -3.64   0.000    -.0097001    -.002909
         age |   .0215072   .0040455     5.32   0.000     .0135669    .0294476
     1.black |   .1034702   .2766783     0.37   0.709    -.4395862    .6465265
        educ |   .0378404   .0069883     5.41   0.000     .0241239    .0515569
             |
black#c.educ |
          1  |  -.0196117   .0215854    -0.91   0.364    -.0619789    .0227554
             |
     married |   .2051596   .0402851     5.09   0.000     .1260892      .28423
          iq |   .0040191   .0010442     3.85   0.000     .0019695    .0060687
       meduc |   .0102747   .0047964     2.14   0.032     .0008604    .0196889
       south |   -.069586   .0276172    -2.52   0.012    -.1237922   -.0153798
       urban |    .179133   .0281112     6.37   0.000     .1239572    .2343088
       _cons |    5.05532    .187864    26.91   0.000     4.686586    5.424055
------------------------------------------------------------------------------

. 
. test 1.black educ 1.black#c.educ

 ( 1)  1.black = 0
 ( 2)  educ = 0
 ( 3)  1.black#c.educ = 0

       F(  3,   846) =   12.94
            Prob > F =    0.0000

. 
. /*Continuous-Continuous interaction*/
. 
. eststo age_educ : reg lwage hours age educ c.age#c.educ black married iq meduc south urban 

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(10, 846)      =     30.08
       Model |  39.1769054        10  3.91769054   Prob > F        =    0.0000
    Residual |  110.184146       846  .130241307   R-squared       =    0.2623
-------------+----------------------------------   Adj R-squared   =    0.2536
       Total |  149.361051       856  .174487209   Root MSE        =    .36089

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0066151   .0017294    -3.83   0.000    -.0100095   -.0032208
         age |  -.0280105   .0260076    -1.08   0.282    -.0790575    .0230364
        educ |  -.0876756   .0645406    -1.36   0.175    -.2143541    .0390029
             |
c.age#c.educ |   .0037019   .0019136     1.93   0.053    -.0000542    .0074579
             |
       black |  -.1466181   .0430343    -3.41   0.001    -.2310847   -.0621515
     married |   .2063299   .0402134     5.13   0.000     .1274003    .2852596
          iq |   .0040003   .0010423     3.84   0.000     .0019545    .0060461
       meduc |   .0100804   .0047844     2.11   0.035     .0006897     .019471
       south |    -.06698   .0276104    -2.43   0.015     -.121173    -.012787
       urban |    .182844     .02813     6.50   0.000     .1276312    .2380569
       _cons |   6.747921   .8848456     7.63   0.000     5.011171    8.484672
------------------------------------------------------------------------------

.   
. /// Margins after interactions
> 
. estimates replay black_marry 

----------------------------------------------------------------------------------------------
Model black_marry
----------------------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(10, 846)      =     29.83
       Model |  38.9381574        10  3.89381574   Prob > F        =    0.0000
    Residual |  110.422894       846  .130523515   R-squared       =    0.2607
-------------+----------------------------------   Adj R-squared   =    0.2520
       Total |  149.361051       856  .174487209   Root MSE        =    .36128

-------------------------------------------------------------------------------
        lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        hours |  -.0063301   .0017273    -3.66   0.000    -.0097204   -.0029398
          age |   .0220385   .0040456     5.45   0.000     .0140979    .0299792
         educ |   .0363765   .0068217     5.33   0.000     .0229871    .0497659
      1.black |  -.2750052   .1036788    -2.65   0.008     -.478503   -.0715073
    1.married |   .1817023   .0438419     4.14   0.000     .0956506     .267754
              |
black#married |
         1 1  |    .153022   .1108707     1.38   0.168    -.0645919    .3706359
              |
           iq |   .0039649   .0010438     3.80   0.000     .0019162    .0060137
        meduc |   .0104632   .0047967     2.18   0.029     .0010483    .0198781
        south |  -.0729291   .0276262    -2.64   0.008    -.1271531   -.0187051
        urban |    .179466   .0280946     6.39   0.000     .1243228    .2346092
        _cons |   5.084363   .1866763    27.24   0.000     4.717961    5.450766
-------------------------------------------------------------------------------

. 
. estimates restore black_marry
(results black_marry are active now)

. 
. local mydf=e(df_r)

. 
. margins , predict(xb) at(black=(1 0) married=(0 1) south=1 urban=1 (mean) hours age educ iq 
> meduc ) post

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.373663   .0962576    66.21   0.000     6.184731    6.562595
          2  |   6.708387   .0442677   151.54   0.000       6.6215    6.795275
          3  |   6.648668   .0467271   142.29   0.000     6.556954    6.740383
          4  |   6.830371   .0259499   263.21   0.000     6.779437    6.881304
------------------------------------------------------------------------------

. 
. mat mypred=e(b)'

. 
. mata: st_matrix("mypred", exp(st_matrix("mypred")))

. 
. svmat mypred

. 
. mat mypred1=e(b)'

. 
. svmat mypred1

. 
. local no_predict=rowsof(mypred)

. 
. di "no of preds is `no_predict'"
no of preds is 4

. 
. egen mycount=fill(1(1)`no_predict')

. 
. graph twoway bar mypred1 mycount in 1/4, barw(.6) base(0) ytick(100(100)1000) ylabel(0(100)1
> 000) 

.       
. estimates restore black_marry
(results black_marry are active now)

. 
. margins , predict(stdp) at((mean) _all black=(1 0) married=(0 1) south=1 urban=1) post nose

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0962576
          2  |   .0442677
          3  |   .0467271
          4  |   .0259499
------------------------------------------------------------------------------

. 
. mat mystdp=e(b)'

. 
. svmat mystdp

. 
. gen ub_log=mypred11+ (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. gen lb_log=mypred11- (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. 
. gen ub=exp(ub_log)
(931 missing values generated)

. gen lb=exp(lb_log)
(931 missing values generated)

. 
. 
. graph twoway (bar mypred1 mycount if mycount==1, barw(.6) base(0) ytick(100(100)1000) ylabel
> (0(100)1000)) ///
>               (bar mypred1 mycount if mycount==2, barw(.6) base(0) ytick(100(100)1000) ylabe
> l(0(100)1000)) ///
>                (bar mypred1 mycount if mycount==3, barw(.6) base(0) ytick(100(100)1000) ylab
> el(0(100)1000)) ///
>                 (bar mypred1 mycount if mycount==4, barw(.6) base(0) ytick(100(100)1000) yla
> bel(0(100)1000)) ///
>                     (rcap ub lb mycount in 1/`no_predict'), ///
>                         xlabel(1 "Unmarried, Black" 2 "Married, Black" 3 "Unmarried, White" 
> 4 "Married, White") ytitle("Predicted Wages")   xtitle("") legend(off)

. 
.        
. /* Clear out prediction variables */    
. drop mypred*

. drop mystdp*

. drop ub*

. drop lb*

. drop mycount    

. 
. eststo urban_south: reg lwage hours age educ black married iq meduc i.south##i.urban 

      Source |       SS           df       MS      Number of obs   =       857
-------------+----------------------------------   F(10, 846)      =     30.26
       Model |  39.3509478        10  3.93509478   Prob > F        =    0.0000
    Residual |  110.010103       846  .130035583   R-squared       =    0.2635
-------------+----------------------------------   Adj R-squared   =    0.2548
       Total |  149.361051       856  .174487209   Root MSE        =     .3606

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0064086   .0017237    -3.72   0.000    -.0097919   -.0030252
         age |   .0223906   .0040422     5.54   0.000     .0144567    .0303244
        educ |   .0366152   .0068088     5.38   0.000     .0232511    .0499793
       black |  -.1413414   .0430185    -3.29   0.001     -.225777   -.0569058
     married |   .2032162   .0401949     5.06   0.000     .1243228    .2821096
          iq |   .0041836   .0010445     4.01   0.000     .0021334    .0062338
       meduc |   .0111274   .0048022     2.32   0.021     .0017018     .020553
     1.south |   .0219466   .0494206     0.44   0.657    -.0750549     .118948
     1.urban |   .2284794   .0355802     6.42   0.000     .1586435    .2983153
             |
 south#urban |
        1 1  |  -.1307251   .0579628    -2.26   0.024    -.2444928   -.0169573
             |
       _cons |   4.985266   .1903604    26.19   0.000     4.611632      5.3589
------------------------------------------------------------------------------

. 
. local mydf=e(df_r)

. 
. margins , predict(xb) at(urban=(1 0) south=(0 1) black=1 married=1 (mean) hours age educ iq 
> meduc ) post

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           0

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.774144   .0430267   157.44   0.000     6.689692    6.858595
          2  |   6.545664   .0520576   125.74   0.000     6.443487    6.647842
          3  |   6.665365   .0433606   153.72   0.000     6.580258    6.750472
          4  |   6.567611   .0535553   122.63   0.000     6.462494    6.672728
------------------------------------------------------------------------------

. 
. mat mypred=e(b)'

. 
. mata: st_matrix("mypred", exp(st_matrix("mypred")))

. 
. svmat mypred

. 
. mat mypred1=e(b)'

. 
. svmat mypred1

. 
. local no_predict=rowsof(mypred)

. 
. di "no of preds is `no_predict'"
no of preds is 4

. 
. egen mycount=fill(1(1)`no_predict')

. 
. graph twoway bar mypred1 mycount in 1/4, barw(.6) base(0) ytick(100(100)1000) ylabel(0(100)1
> 000) 

.       
. estimates restore black_marry
(results black_marry are active now)

. 
. margins , predict(stdp) at((mean) _all urban=(1 0) south=(0 1) black=1 married=1) post nose

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           0

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           0

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0453348
          2  |   .0519674
          3  |   .0442677
          4  |   .0491239
------------------------------------------------------------------------------

. 
. mat mystdp=e(b)'

. 
. svmat mystdp

. 
. gen ub_log=mypred11+ (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. gen lb_log=mypred11- (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. 
. gen ub=exp(ub_log)
(931 missing values generated)

. gen lb=exp(lb_log)
(931 missing values generated)

. 
. 
. graph twoway (bar mypred1 mycount if mycount==1, barw(.6) base(0) ytick(100(100)1000) ylabel
> (0(100)1000)) ///
>               (bar mypred1 mycount if mycount==2, barw(.6) base(0) ytick(100(100)1000) ylabe
> l(0(100)1000)) ///
>                (bar mypred1 mycount if mycount==3, barw(.6) base(0) ytick(100(100)1000) ylab
> el(0(100)1000)) ///
>                 (bar mypred1 mycount if mycount==4, barw(.6) base(0) ytick(100(100)1000) yla
> bel(0(100)1000)) ///
>                     (rcap ub lb mycount in 1/`no_predict'), ///
>                         xlabel(1 "Urban, Non-South" 2 "Urban, South" 3 "Non-Urban, Non-South
> " 4 "Non-Urban, South") ytitle("Predicted Wages")   xtitle("") legend(off)

. 
. /* Clear out prediction variables */    
. drop mypred*

. drop mystdp*

. drop ub*

. drop lb*    

.                                                 
.                                                 
. /* Working with continuous vs. Continuous interactions */
. 
. sum age, detail

                             Age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           29             28
10%           29             28       Obs                 935
25%           30             28       Sum of Wgt.         935

50%           33                      Mean           33.08021
                        Largest       Std. Dev.      3.107803
75%           36             38
90%           38             38       Variance       9.658441
95%           38             38       Skewness       .1185453
99%           38             38       Kurtosis       1.743208

. 
. local mymin=r(min)

. local mymax=r(max)

. 
. /*Step through education in 2 year intervals, get predictions across range of age*/
. 
. foreach myeduc of numlist 10(2)16{
  2. 
. estimates restore age_educ
  3.     
. margins, predict(xb) at((mean) _all age=(`mymin'(1)`mymax') educ=`myeduc') post
  4. mat pred_ed`myeduc'=e(b)'
  5. mat li pred_ed`myeduc'
  6. svmat pred_ed`myeduc'
  7. 
. estimates restore age_educ
  8. 
. margins, predict(stdp) at((mean) _all age=(`mymin'(1)`mymax') educ=`myeduc') nose post
  9. mat pred_se_ed`myeduc'=e(b)'
 10. mat li pred_se_ed`myeduc'
 11. svmat pred_se_ed`myeduc'
 12. }
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    6.62505   .0490705   135.01   0.000     6.528736    6.721365
          2  |   6.634058   .0429044   154.62   0.000     6.549847     6.71827
          3  |   6.643066    .037312   178.04   0.000     6.569831    6.716301
          4  |   6.652074   .0325898   204.12   0.000     6.588108     6.71604
          5  |   6.661082   .0291636   228.40   0.000     6.603841    6.718324
          6  |    6.67009    .027522   242.36   0.000     6.616071    6.724109
          7  |   6.679098   .0279806   238.70   0.000     6.624179    6.734018
          8  |   6.688106   .0304448   219.68   0.000      6.62835    6.747862
          9  |   6.697114   .0344873   194.19   0.000     6.629423    6.764805
         10  |   6.706122    .039628   169.23   0.000     6.628341    6.783903
         11  |    6.71513   .0454962   147.60   0.000     6.625831    6.804429
------------------------------------------------------------------------------

pred_ed10[11,1]
               y1
 1._at  6.6250503
 2._at  6.6340583
 3._at  6.6430662
 4._at  6.6520742
 5._at  6.6610822
 6._at  6.6700901
 7._at  6.6790981
 8._at  6.6881061
 9._at   6.697114
10._at   6.706122
11._at    6.71513
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0490705
          2  |   .0429044
          3  |    .037312
          4  |   .0325898
          5  |   .0291636
          6  |    .027522
          7  |   .0279806
          8  |   .0304448
          9  |   .0344873
         10  |    .039628
         11  |   .0454962
------------------------------------------------------------------------------

pred_se_ed10[11,1]
               y1
 1._at   .0490705
 2._at  .04290443
 3._at  .03731197
 4._at  .03258976
 5._at  .02916363
 6._at  .02752195
 7._at  .02798061
 8._at  .03044483
 9._at  .03448734
10._at  .03962804
11._at  .04549618
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.657003   .0295409   225.35   0.000     6.599021    6.714985
          2  |   6.673414   .0256338   260.34   0.000     6.623101    6.723728
          3  |   6.689826   .0221124   302.54   0.000     6.646425    6.733228
          4  |   6.706238   .0191901   349.46   0.000     6.668572    6.743904
          5  |   6.722649   .0171755   391.41   0.000     6.688938    6.756361
          6  |   6.739061   .0164065   410.76   0.000     6.706859    6.771263
          7  |   6.755473   .0170524   396.16   0.000     6.722003    6.788943
          8  |   6.771884   .0189692   356.99   0.000     6.734652    6.809117
          9  |   6.788296   .0218246   311.04   0.000     6.745459    6.831133
         10  |   6.804708   .0253028   268.93   0.000     6.755044    6.854371
         11  |    6.82112    .029182   233.74   0.000     6.763842    6.878397
------------------------------------------------------------------------------

pred_ed12[11,1]
               y1
 1._at  6.6570028
 2._at  6.6734145
 3._at  6.6898262
 4._at  6.7062378
 5._at  6.7226495
 6._at  6.7390612
 7._at  6.7554728
 8._at  6.7718845
 9._at  6.7882962
10._at  6.8047078
11._at  6.8211195
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0295409
          2  |   .0256338
          3  |   .0221124
          4  |   .0191901
          5  |   .0171755
          6  |   .0164065
          7  |   .0170524
          8  |   .0189692
          9  |   .0218246
         10  |   .0253028
         11  |    .029182
------------------------------------------------------------------------------

pred_se_ed12[11,1]
               y1
 1._at  .02954087
 2._at  .02563382
 3._at   .0221124
 4._at  .01919011
 5._at  .01717552
 6._at  .01640649
 7._at  .01705237
 8._at  .01896919
 9._at   .0218246
10._at  .02530282
11._at  .02918198
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.688955   .0246462   271.40   0.000     6.640581     6.73733
          2  |   6.712771   .0211711   317.07   0.000     6.671217    6.754325
          3  |   6.736586   .0179984   374.29   0.000     6.701259    6.771913
          4  |   6.760401   .0153172   441.36   0.000     6.730337    6.790466
          5  |   6.784217   .0134253   505.33   0.000     6.757866    6.810568
          6  |   6.808032   .0126811   536.86   0.000     6.783142    6.832922
          7  |   6.831848    .013279   514.49   0.000     6.805784    6.857911
          8  |   6.855663   .0150598   455.23   0.000     6.826104    6.885222
          9  |   6.879478   .0176696   389.34   0.000     6.844797     6.91416
         10  |   6.903294   .0207985   331.91   0.000     6.862471    6.944116
         11  |   6.927109   .0242464   285.70   0.000     6.879519    6.974699
------------------------------------------------------------------------------

pred_ed14[11,1]
               y1
 1._at  6.6889553
 2._at  6.7127707
 3._at  6.7365861
 4._at  6.7604014
 5._at  6.7842168
 6._at  6.8080322
 7._at  6.8318475
 8._at  6.8556629
 9._at  6.8794783
10._at  6.9032937
11._at   6.927109
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0246462
          2  |   .0211711
          3  |   .0179984
          4  |   .0153172
          5  |   .0134253
          6  |   .0126811
          7  |    .013279
          8  |   .0150598
          9  |   .0176696
         10  |   .0207985
         11  |   .0242464
------------------------------------------------------------------------------

pred_se_ed14[11,1]
               y1
 1._at  .02464618
 2._at  .02117105
 3._at  .01799835
 4._at  .01531718
 5._at  .01342533
 6._at  .01268113
 7._at  .01327896
 8._at  .01505983
 9._at  .01766958
10._at  .02079851
11._at  .02424644
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.720908   .0401526   167.38   0.000     6.642098    6.799718
          2  |   6.752127   .0348447   193.78   0.000     6.683735    6.820519
          3  |   6.783346   .0299521   226.47   0.000     6.724557    6.842135
          4  |   6.814565    .025713   265.02   0.000     6.764096    6.865034
          5  |   6.845784   .0224998   304.26   0.000     6.801622    6.889946
          6  |   6.877003   .0207936   330.73   0.000      6.83619    6.917816
          7  |   6.908222   .0209656   329.50   0.000     6.867072    6.949373
          8  |   6.939441   .0229737   302.06   0.000     6.894349    6.984534
          9  |    6.97066   .0264023   264.02   0.000     6.918839    7.022482
         10  |   7.001879   .0307801   227.48   0.000     6.941465    7.062294
         11  |   7.033099   .0357604   196.67   0.000     6.962909    7.103288
------------------------------------------------------------------------------

pred_ed16[11,1]
               y1
 1._at  6.7209078
 2._at  6.7521269
 3._at   6.783346
 4._at  6.8145651
 5._at  6.8457841
 6._at  6.8770032
 7._at  6.9082223
 8._at  6.9394413
 9._at  6.9706604
10._at  7.0018795
11._at  7.0330986
(results age_educ are active now)

Adjusted predictions                            Number of obs     =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0401526
          2  |   .0348447
          3  |   .0299521
          4  |    .025713
          5  |   .0224998
          6  |   .0207936
          7  |   .0209656
          8  |   .0229737
          9  |   .0264023
         10  |   .0307801
         11  |   .0357604
------------------------------------------------------------------------------

pred_se_ed16[11,1]
               y1
 1._at  .04015255
 2._at   .0348447
 3._at  .02995214
 4._at  .02571302
 5._at  .02249978
 6._at  .02079357
 7._at   .0209656
 8._at  .02297372
 9._at  .02640225
10._at  .03078015
11._at  .03576042

. 
. foreach myeduc of numlist 10(2)16{
  2.     gen exp_pred`myeduc'=exp(pred_ed`myeduc'1)
  3.     gen ub`myeduc'=exp(pred_ed`myeduc'+(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  4.     gen lb`myeduc'=exp(pred_ed`myeduc'-(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  5. }
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)

. 
. /* Need my at values */
. 
. egen age_levels=fill(`mymin'(1)`mymax')    

. 
. twoway line exp_pred10 exp_pred12 exp_pred14 exp_pred16 age_levels in 1/11, ///
>        legend(order(1 "10 Years" 2 "12 Years" 3 "14 Years" 4 "16 Years"))  ytitle("Wages") x
> title("Age") name(educ_mult)

. 
.            
. /* Plot at different levels with confidence intervals */
. twoway (rarea ub10 lb10 age_levels in 1/11, color(gs14)) ///
>     (rarea ub16 lb16 age_levels in 1/11, color(gs14)) ///
>         (line exp_pred10 age_levels in 1/11, lcolor(blue) ) ///
>             (line lb10 age_levels in 1/11, lcolor(blue) lwidth(thin) lpattern(dash)) ///
>                 (line ub10 age_levels in 1/11, lcolor(blue) lwidth(thin) lpattern(dash)) ///
>                     (line exp_pred16 age_levels in 1/11, lcolor(red) ) ///
>                         (line ub16 age_levels in 1/11, lcolor(red) lwidth(thin) lpattern(das
> h)) ///
>                             (line lb16 age_levels in 1/11, lcolor(red) lwidth(thin) lpattern
> (dash)) , ///
>                                 legend(order( 3 "Less than HS" 6 "College Grad"))  xtitle("A
> ge") name(educ_ci)

. 
. 
. drop lb* ub* exp_pred* pred* pred_ed* pred_se_ed*

. 
. /* Run a regression of log wages as a function of the interaction of
> educ and knowledge of world of work (kww). Include other covariates as you
> see fit. Plot the results of the interaction after generating predictions from the 
> margins command */
. 
. ********************Begin KWW ************************
. 
. eststo wage_kww: reg lwage c.educ##c.kww age hours

      Source |       SS           df       MS      Number of obs   =       935
-------------+----------------------------------   F(5, 929)       =     34.45
       Model |  25.9103449         5  5.18206898   Prob > F        =    0.0000
    Residual |  139.745949       929   .15042621   R-squared       =    0.1564
-------------+----------------------------------   Adj R-squared   =    0.1519
       Total |  165.656294       934  .177362199   Root MSE        =    .38785

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0003363   .0298687     0.01   0.991    -.0582816    .0589543
         kww |  -.0064117   .0102205    -0.63   0.531    -.0264697    .0136463
             |
c.educ#c.kww |   .0012645   .0007713     1.64   0.101    -.0002492    .0027782
             |
         age |   .0117433   .0045902     2.56   0.011      .002735    .0207516
       hours |  -.0054003   .0017707    -3.05   0.002    -.0088754   -.0019252
       _cons |   6.235434    .435491    14.32   0.000     5.380774    7.090094
------------------------------------------------------------------------------

. 
. sum kww, detail

                 Knowledge of world of work
-------------------------------------------------------------
      Percentiles      Smallest
 1%           18             12
 5%           22             13
10%           25             14       Obs                 935
25%           31             15       Sum of Wgt.         935

50%           37                      Mean           35.74439
                        Largest       Std. Dev.      7.638788
75%           41             54
90%           45             54       Variance       58.35108
95%           48             55       Skewness      -.2924614
99%           51             56       Kurtosis       2.678354

. 
. local mymin=r(min)

. local mymax=r(max)

. 
. /*Step through education in 2 year intervals, get predictions across range of age*/
. 
. foreach myeduc of numlist 10(2)16{
  2. 
. estimates restore wage_kww
  3.     
. margins, predict(xb) at((mean) _all kww=(`mymin'(1)`mymax') educ=`myeduc') post
  4. mat pred_ed`myeduc'=e(b)'
  5. mat li pred_ed`myeduc'
  6. svmat pred_ed`myeduc'
  7. 
. estimates restore wage_kww
  8. 
. margins, predict(stdp) at((mean) _all kww=(`mymin'(1)`mymax') educ=`myeduc') nose post
  9. mat pred_se_ed`myeduc'=e(b)'
 10. mat li pred_se_ed`myeduc'
 11. svmat pred_se_ed`myeduc'
 12. }
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : educ            =          10
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          10
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          10
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          10
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          10
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          10
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          10
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          10
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          10
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          10
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          10
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          10
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          10
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          10
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          10
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          10
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          10
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          10
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          10
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          10
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          10
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          10
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          10
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          10
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          10
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          10
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          10
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          10
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          10
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          10
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          10
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          10
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          10
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          10
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          10
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          10
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          10
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          10
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          10
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          10
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          10
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          10
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          10
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          10
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          10
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.464836   .0713865    90.56   0.000     6.324739    6.604934
          2  |   6.471069   .0685291    94.43   0.000      6.33658    6.605559
          3  |   6.477303   .0656897    98.60   0.000     6.348385     6.60622
          4  |   6.483536   .0628709   103.12   0.000      6.36015    6.606921
          5  |   6.489769   .0600755   108.03   0.000      6.37187    6.607669
          6  |   6.496002   .0573069   113.35   0.000     6.383536    6.608468
          7  |   6.502236   .0545692   119.16   0.000     6.395142    6.609329
          8  |   6.508469   .0518674   125.48   0.000     6.406678     6.61026
          9  |   6.514702   .0492073   132.39   0.000     6.418132    6.611273
         10  |   6.520936   .0465961   139.95   0.000      6.42949    6.612381
         11  |   6.527169   .0440424   148.20   0.000     6.440735    6.613603
         12  |   6.533402   .0415569   157.22   0.000     6.451846    6.614958
         13  |   6.539635   .0391525   167.03   0.000     6.462798    6.616473
         14  |   6.545869   .0368452   177.66   0.000     6.473559    6.618178
         15  |   6.552102   .0346544   189.07   0.000     6.484092    6.620112
         16  |   6.558335   .0326034   201.15   0.000      6.49435     6.62232
         17  |   6.564569   .0307205   213.69   0.000     6.504279    6.624858
         18  |   6.570802   .0290382   226.28   0.000     6.513814     6.62779
         19  |   6.577035   .0275932   238.36   0.000     6.522883    6.631187
         20  |   6.583268   .0264246   249.13   0.000     6.531409    6.635127
         21  |   6.589502   .0255703   257.70   0.000     6.539319    6.639684
         22  |   6.595735   .0250624   263.17   0.000     6.546549     6.64492
         23  |   6.601968   .0249221   264.90   0.000     6.553058    6.650878
         24  |   6.608201   .0251556   262.69   0.000     6.558833     6.65757
         25  |   6.614435   .0257527   256.84   0.000     6.563895    6.664975
         26  |   6.620668    .026689   248.07   0.000      6.56829    6.673046
         27  |   6.626901   .0279304   237.26   0.000     6.572087    6.681715
         28  |   6.633135   .0294383   225.32   0.000     6.575361    6.690908
         29  |   6.639368   .0311742   212.98   0.000     6.578188    6.700548
         30  |   6.645601   .0331021   200.76   0.000     6.580638    6.710565
         31  |   6.651834   .0351904   189.02   0.000     6.582772    6.720896
         32  |   6.658068   .0374125   177.96   0.000     6.584645     6.73149
         33  |   6.664301   .0397457   167.67   0.000     6.586299    6.742303
         34  |   6.670534   .0421717   158.18   0.000     6.587771    6.753297
         35  |   6.676767   .0446754   149.45   0.000     6.589091    6.764444
         36  |   6.683001   .0472444   141.46   0.000     6.590283    6.775719
         37  |   6.689234   .0498686   134.14   0.000     6.591366    6.787102
         38  |   6.695467   .0525398   127.44   0.000     6.592357    6.798578
         39  |   6.701701   .0552511   121.30   0.000     6.593269    6.810132
         40  |   6.707934   .0579969   115.66   0.000     6.594114    6.821754
         41  |   6.714167   .0607726   110.48   0.000       6.5949    6.833435
         42  |     6.7204   .0635742   105.71   0.000     6.595635    6.845166
         43  |   6.726634   .0663984   101.31   0.000     6.596325    6.856942
         44  |   6.732867   .0692425    97.24   0.000     6.596977    6.868757
         45  |     6.7391   .0721041    93.46   0.000     6.597594    6.880606
------------------------------------------------------------------------------

pred_ed10[45,1]
               y1
 1._at  6.4648361
 2._at  6.4710694
 3._at  6.4773026
 4._at  6.4835359
 5._at  6.4897692
 6._at  6.4960025
 7._at  6.5022357
 8._at   6.508469
 9._at  6.5147023
10._at  6.5209356
11._at  6.5271689
12._at  6.5334021
13._at  6.5396354
14._at  6.5458687
15._at   6.552102
16._at  6.5583352
17._at  6.5645685
18._at  6.5708018
19._at  6.5770351
20._at  6.5832683
21._at  6.5895016
22._at  6.5957349
23._at  6.6019682
24._at  6.6082014
25._at  6.6144347
26._at   6.620668
27._at  6.6269013
28._at  6.6331345
29._at  6.6393678
30._at  6.6456011
31._at  6.6518344
32._at  6.6580677
33._at  6.6643009
34._at  6.6705342
35._at  6.6767675
36._at  6.6830008
37._at   6.689234
38._at  6.6954673
39._at  6.7017006
40._at  6.7079339
41._at  6.7141671
42._at  6.7204004
43._at  6.7266337
44._at   6.732867
45._at  6.7391002
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935

Expression   : S.E. of the prediction, predict(stdp)

1._at        : educ            =          10
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          10
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          10
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          10
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          10
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          10
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          10
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          10
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          10
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          10
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          10
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          10
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          10
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          10
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          10
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          10
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          10
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          10
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          10
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          10
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          10
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          10
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          10
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          10
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          10
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          10
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          10
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          10
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          10
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          10
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          10
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          10
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          10
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          10
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          10
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          10
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          10
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          10
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          10
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          10
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          10
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          10
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          10
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          10
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          10
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0713865
          2  |   .0685291
          3  |   .0656897
          4  |   .0628709
          5  |   .0600755
          6  |   .0573069
          7  |   .0545692
          8  |   .0518674
          9  |   .0492073
         10  |   .0465961
         11  |   .0440424
         12  |   .0415569
         13  |   .0391525
         14  |   .0368452
         15  |   .0346544
         16  |   .0326034
         17  |   .0307205
         18  |   .0290382
         19  |   .0275932
         20  |   .0264246
         21  |   .0255703
         22  |   .0250624
         23  |   .0249221
         24  |   .0251556
         25  |   .0257527
         26  |    .026689
         27  |   .0279304
         28  |   .0294383
         29  |   .0311742
         30  |   .0331021
         31  |   .0351904
         32  |   .0374125
         33  |   .0397457
         34  |   .0421717
         35  |   .0446754
         36  |   .0472444
         37  |   .0498686
         38  |   .0525398
         39  |   .0552511
         40  |   .0579969
         41  |   .0607726
         42  |   .0635742
         43  |   .0663984
         44  |   .0692425
         45  |   .0721041
------------------------------------------------------------------------------

pred_se_ed10[45,1]
               y1
 1._at  .07138652
 2._at  .06852909
 3._at  .06568974
 4._at   .0628709
 5._at  .06007548
 6._at   .0573069
 7._at  .05456925
 8._at  .05186741
 9._at   .0492073
10._at  .04659606
11._at  .04404237
12._at  .04155686
13._at  .03915252
14._at  .03684522
15._at  .03465436
16._at  .03260343
17._at  .03072047
18._at  .02903815
19._at  .02759322
20._at  .02642464
21._at  .02557032
22._at  .02506242
23._at  .02492214
24._at  .02515562
25._at   .0257527
26._at  .02668899
27._at  .02793039
28._at  .02943834
29._at  .03117417
30._at  .03310205
31._at  .03519044
32._at  .03741246
33._at  .03974572
34._at  .04217174
35._at  .04467543
36._at  .04724443
37._at  .04986865
38._at  .05253982
39._at  .05525113
40._at  .05799694
41._at   .0607726
42._at  .06357417
43._at  .06639839
44._at  .06924248
45._at   .0721041
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : educ            =          12
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          12
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          12
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          12
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          12
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          12
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          12
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          12
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          12
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          12
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          12
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          12
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          12
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          12
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          12
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          12
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          12
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          12
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          12
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          12
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          12
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          12
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          12
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          12
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          12
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          12
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          12
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          12
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          12
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          12
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          12
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          12
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          12
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          12
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          12
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          12
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          12
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          12
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          12
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          12
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          12
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          12
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          12
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          12
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          12
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.495857   .0487907   133.14   0.000     6.400104     6.59161
          2  |   6.504619   .0467574   139.11   0.000     6.412857    6.596381
          3  |   6.513381   .0447347   145.60   0.000     6.425589    6.601174
          4  |   6.522144    .042724   152.66   0.000     6.438297     6.60599
          5  |   6.530906   .0407273   160.36   0.000     6.450978    6.610834
          6  |   6.539668   .0387466   168.78   0.000     6.463627    6.615709
          7  |    6.54843   .0367845   178.02   0.000      6.47624    6.620621
          8  |   6.557193   .0348442   188.19   0.000      6.48881    6.625575
          9  |   6.565955   .0329296   199.39   0.000      6.50133     6.63058
         10  |   6.574717   .0310453   211.78   0.000      6.51379    6.635644
         11  |   6.583479   .0291973   225.48   0.000     6.526179     6.64078
         12  |   6.592242   .0273928   240.66   0.000     6.538483    6.646001
         13  |   6.601004   .0256412   257.44   0.000     6.550683    6.651325
         14  |   6.609766   .0239539   275.94   0.000     6.562756    6.656776
         15  |   6.618528   .0223457   296.19   0.000     6.574675    6.662382
         16  |   6.627291   .0208347   318.09   0.000     6.586402    6.668179
         17  |   6.636053   .0194436   341.30   0.000     6.597894    6.674212
         18  |   6.644815   .0182001   365.10   0.000     6.609097    6.680533
         19  |   6.653578   .0171362   388.28   0.000     6.619947    6.687208
         20  |    6.66234   .0162871   409.06   0.000     6.630376    6.694304
         21  |   6.671102   .0156879   425.24   0.000     6.640314     6.70189
         22  |   6.679864   .0153677   434.67   0.000     6.649705    6.710024
         23  |   6.688627    .015344   435.91   0.000     6.658514     6.71874
         24  |   6.697389   .0156182   428.82   0.000     6.666738     6.72804
         25  |   6.706151   .0161751   414.60   0.000     6.674407    6.737895
         26  |   6.714913    .016987   395.30   0.000     6.681576    6.748251
         27  |   6.723676   .0180194   373.14   0.000     6.688312    6.759039
         28  |   6.732438   .0192368   349.98   0.000     6.694685    6.770191
         29  |     6.7412   .0206065   327.14   0.000      6.70076    6.781641
         30  |   6.749962   .0221002   305.43   0.000      6.70659    6.793335
         31  |   6.758725   .0236944   285.25   0.000     6.712224    6.805226
         32  |   6.767487   .0253703   266.75   0.000     6.717697    6.817277
         33  |   6.776249   .0271126   249.93   0.000      6.72304    6.829458
         34  |   6.785012   .0289093   234.70   0.000     6.728276    6.841747
         35  |   6.793774    .030751   220.93   0.000     6.733424    6.854123
         36  |   6.802536     .03263   208.47   0.000     6.738499    6.866573
         37  |   6.811298   .0345402   197.20   0.000     6.743513    6.879084
         38  |   6.820061   .0364767   186.97   0.000     6.748474    6.891647
         39  |   6.828823   .0384356   177.67   0.000     6.753392    6.904254
         40  |   6.837585   .0404135   169.19   0.000     6.758273    6.916898
         41  |   6.846347   .0424079   161.44   0.000     6.763121    6.929574
         42  |    6.85511   .0444165   154.34   0.000     6.767942    6.942278
         43  |   6.863872   .0464374   147.81   0.000     6.772738    6.955006
         44  |   6.872634   .0484691   141.79   0.000     6.777513    6.967756
         45  |   6.881397   .0505104   136.24   0.000     6.782269    6.980524
------------------------------------------------------------------------------

pred_ed12[45,1]
               y1
 1._at  6.4958567
 2._at   6.504619
 3._at  6.5133812
 4._at  6.5221435
 5._at  6.5309058
 6._at   6.539668
 7._at  6.5484303
 8._at  6.5571926
 9._at  6.5659548
10._at  6.5747171
11._at  6.5834794
12._at  6.5922417
13._at  6.6010039
14._at  6.6097662
15._at  6.6185285
16._at  6.6272907
17._at   6.636053
18._at  6.6448153
19._at  6.6535775
20._at  6.6623398
21._at  6.6711021
22._at  6.6798643
23._at  6.6886266
24._at  6.6973889
25._at  6.7061512
26._at  6.7149134
27._at  6.7236757
28._at   6.732438
29._at  6.7412002
30._at  6.7499625
31._at  6.7587248
32._at   6.767487
33._at  6.7762493
34._at  6.7850116
35._at  6.7937738
36._at  6.8025361
37._at  6.8112984
38._at  6.8200606
39._at  6.8288229
40._at  6.8375852
41._at  6.8463475
42._at  6.8551097
43._at   6.863872
44._at  6.8726343
45._at  6.8813965
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935

Expression   : S.E. of the prediction, predict(stdp)

1._at        : educ            =          12
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          12
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          12
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          12
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          12
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          12
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          12
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          12
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          12
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          12
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          12
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          12
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          12
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          12
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          12
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          12
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          12
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          12
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          12
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          12
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          12
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          12
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          12
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          12
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          12
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          12
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          12
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          12
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          12
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          12
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          12
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          12
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          12
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          12
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          12
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          12
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          12
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          12
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          12
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          12
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          12
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          12
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          12
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          12
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          12
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0487907
          2  |   .0467574
          3  |   .0447347
          4  |    .042724
          5  |   .0407273
          6  |   .0387466
          7  |   .0367845
          8  |   .0348442
          9  |   .0329296
         10  |   .0310453
         11  |   .0291973
         12  |   .0273928
         13  |   .0256412
         14  |   .0239539
         15  |   .0223457
         16  |   .0208347
         17  |   .0194436
         18  |   .0182001
         19  |   .0171362
         20  |   .0162871
         21  |   .0156879
         22  |   .0153677
         23  |    .015344
         24  |   .0156182
         25  |   .0161751
         26  |    .016987
         27  |   .0180194
         28  |   .0192368
         29  |   .0206065
         30  |   .0221002
         31  |   .0236944
         32  |   .0253703
         33  |   .0271126
         34  |   .0289093
         35  |    .030751
         36  |     .03263
         37  |   .0345402
         38  |   .0364767
         39  |   .0384356
         40  |   .0404135
         41  |   .0424079
         42  |   .0444165
         43  |   .0464374
         44  |   .0484691
         45  |   .0505104
------------------------------------------------------------------------------

pred_se_ed12[45,1]
               y1
 1._at  .04879073
 2._at  .04675739
 3._at  .04473465
 4._at  .04272401
 5._at  .04072727
 6._at  .03874657
 7._at   .0367845
 8._at  .03484421
 9._at  .03292956
10._at  .03104528
11._at  .02919725
12._at  .02739282
13._at  .02564119
14._at  .02395395
15._at  .02234568
16._at  .02083468
17._at  .01944365
18._at   .0182001
19._at  .01713619
20._at  .01628714
21._at  .01568789
22._at  .01536768
23._at    .015344
24._at  .01561819
25._at  .01617511
26._at  .01698697
27._at  .01801936
28._at  .01923679
29._at   .0206065
30._at   .0221002
31._at  .02369443
32._at  .02537027
33._at  .02711257
34._at  .02890934
35._at  .03075101
36._at  .03262999
37._at   .0345402
38._at  .03647671
39._at  .03843557
40._at  .04041351
41._at  .04240788
42._at  .04441645
43._at  .04643739
44._at  .04846914
45._at  .05051041
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : educ            =          14
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          14
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          14
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          14
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          14
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          14
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          14
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          14
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          14
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          14
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          14
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          14
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          14
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          14
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          14
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          14
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          14
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          14
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          14
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          14
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          14
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          14
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          14
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          14
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          14
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          14
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          14
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          14
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          14
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          14
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          14
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          14
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          14
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          14
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          14
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          14
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          14
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          14
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          14
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          14
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          14
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          14
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          14
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          14
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          14
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.526877   .0562753   115.98   0.000     6.416436    6.637319
          2  |   6.538169   .0541948   120.64   0.000      6.43181    6.644527
          3  |    6.54946     .05212   125.66   0.000     6.447173    6.651746
          4  |   6.560751   .0500516   131.08   0.000     6.462524    6.658978
          5  |   6.572042   .0479903   136.95   0.000      6.47786    6.666224
          6  |   6.583334   .0459373   143.31   0.000     6.493181    6.673486
          7  |   6.594625   .0438935   150.24   0.000     6.508483    6.680767
          8  |   6.605916   .0418605   157.81   0.000     6.523764    6.688068
          9  |   6.617207   .0398397   166.10   0.000     6.539021    6.695394
         10  |   6.628499   .0378333   175.20   0.000      6.55425    6.702747
         11  |    6.63979   .0358436   185.24   0.000     6.569446    6.710134
         12  |   6.651081   .0338734   196.35   0.000     6.584604    6.717559
         13  |   6.662372   .0319266   208.68   0.000     6.599716    6.725029
         14  |   6.673664   .0300076   222.40   0.000     6.614773    6.732554
         15  |   6.684955    .028122   237.71   0.000     6.629765    6.740145
         16  |   6.696246   .0262772   254.83   0.000     6.644677    6.747816
         17  |   6.707537   .0244822   273.98   0.000     6.659491    6.755584
         18  |   6.718829    .022749   295.35   0.000     6.674183    6.763474
         19  |    6.73012   .0210927   319.07   0.000     6.688725    6.771515
         20  |   6.741411    .019533   345.13   0.000     6.703077    6.779745
         21  |   6.752703   .0180947   373.19   0.000     6.717191    6.788214
         22  |   6.763994   .0168092   402.40   0.000     6.731005    6.796982
         23  |   6.775285   .0157139   431.17   0.000     6.744446    6.806124
         24  |   6.786576    .014851   456.98   0.000     6.757431    6.815722
         25  |   6.797868   .0142628   476.62   0.000     6.769877    6.825859
         26  |   6.809159   .0139839   486.93   0.000     6.781715    6.836602
         27  |    6.82045   .0140328   486.04   0.000      6.79291     6.84799
         28  |   6.831741   .0144061   474.22   0.000     6.803469    6.860014
         29  |   6.843033   .0150799   453.79   0.000     6.813438    6.872627
         30  |   6.854324   .0160162   427.96   0.000     6.822892    6.885756
         31  |   6.865615   .0171721   399.81   0.000     6.831915    6.899316
         32  |   6.876906   .0185065   371.59   0.000     6.840587    6.913226
         33  |   6.888198   .0199837   344.69   0.000     6.848979    6.927416
         34  |   6.899489   .0215744   319.80   0.000     6.857149    6.941829
         35  |    6.91078   .0232553   297.17   0.000     6.865141    6.956419
         36  |   6.922071   .0250082   276.79   0.000     6.872992    6.971151
         37  |   6.933363   .0268191   258.52   0.000      6.88073    6.985996
         38  |   6.944654   .0286768   242.17   0.000     6.888375    7.000933
         39  |   6.955945    .030573   227.52   0.000     6.895945    7.015945
         40  |   6.967237   .0325008   214.37   0.000     6.903453     7.03102
         41  |   6.978528    .034455   202.54   0.000     6.910909    7.046146
         42  |   6.989819   .0364312   191.86   0.000     6.918322    7.061316
         43  |    7.00111   .0384262   182.20   0.000     6.925698    7.076523
         44  |   7.012402   .0404371   173.41   0.000     6.933043     7.09176
         45  |   7.023693   .0424617   165.41   0.000     6.940361    7.107025
------------------------------------------------------------------------------

pred_ed14[45,1]
               y1
 1._at  6.5268773
 2._at  6.5381686
 3._at  6.5494598
 4._at  6.5607511
 5._at  6.5720423
 6._at  6.5833336
 7._at  6.5946249
 8._at  6.6059161
 9._at  6.6172074
10._at  6.6284987
11._at  6.6397899
12._at  6.6510812
13._at  6.6623724
14._at  6.6736637
15._at   6.684955
16._at  6.6962462
17._at  6.7075375
18._at  6.7188288
19._at    6.73012
20._at  6.7414113
21._at  6.7527025
22._at  6.7639938
23._at  6.7752851
24._at  6.7865763
25._at  6.7978676
26._at  6.8091588
27._at  6.8204501
28._at  6.8317414
29._at  6.8430326
30._at  6.8543239
31._at  6.8656152
32._at  6.8769064
33._at  6.8881977
34._at  6.8994889
35._at  6.9107802
36._at  6.9220715
37._at  6.9333627
38._at   6.944654
39._at  6.9559453
40._at  6.9672365
41._at  6.9785278
42._at   6.989819
43._at  7.0011103
44._at  7.0124016
45._at  7.0236928
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935

Expression   : S.E. of the prediction, predict(stdp)

1._at        : educ            =          14
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          14
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          14
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          14
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          14
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          14
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          14
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          14
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          14
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          14
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          14
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          14
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          14
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          14
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          14
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          14
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          14
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          14
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          14
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          14
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          14
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          14
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          14
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          14
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          14
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          14
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          14
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          14
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          14
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          14
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          14
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          14
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          14
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          14
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          14
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          14
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          14
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          14
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          14
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          14
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          14
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          14
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          14
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          14
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          14
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0562753
          2  |   .0541948
          3  |     .05212
          4  |   .0500516
          5  |   .0479903
          6  |   .0459373
          7  |   .0438935
          8  |   .0418605
          9  |   .0398397
         10  |   .0378333
         11  |   .0358436
         12  |   .0338734
         13  |   .0319266
         14  |   .0300076
         15  |    .028122
         16  |   .0262772
         17  |   .0244822
         18  |    .022749
         19  |   .0210927
         20  |    .019533
         21  |   .0180947
         22  |   .0168092
         23  |   .0157139
         24  |    .014851
         25  |   .0142628
         26  |   .0139839
         27  |   .0140328
         28  |   .0144061
         29  |   .0150799
         30  |   .0160162
         31  |   .0171721
         32  |   .0185065
         33  |   .0199837
         34  |   .0215744
         35  |   .0232553
         36  |   .0250082
         37  |   .0268191
         38  |   .0286768
         39  |    .030573
         40  |   .0325008
         41  |    .034455
         42  |   .0364312
         43  |   .0384262
         44  |   .0404371
         45  |   .0424617
------------------------------------------------------------------------------

pred_se_ed14[45,1]
               y1
 1._at  .05627528
 2._at   .0541948
 3._at  .05211999
 4._at  .05005156
 5._at  .04799033
 6._at  .04593727
 7._at  .04389354
 8._at  .04186048
 9._at  .03983975
10._at  .03783331
11._at  .03584356
12._at  .03387344
13._at   .0319266
14._at  .03000756
15._at  .02812201
16._at  .02627716
17._at  .02448221
18._at  .02274899
19._at  .02109271
20._at  .01953296
21._at  .01809471
22._at  .01680917
23._at  .01571389
24._at  .01485101
25._at  .01426277
26._at  .01398387
27._at  .01403278
28._at  .01440615
29._at   .0150799
30._at  .01601617
31._at  .01717207
32._at  .01850649
33._at  .01998371
34._at  .02157441
35._at  .02325531
36._at  .02500824
37._at  .02681907
38._at  .02867684
39._at  .03057299
40._at  .03250081
41._at  .03445497
42._at  .03643125
43._at  .03842622
44._at  .04043713
45._at  .04246171
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : educ            =          16
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          16
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          16
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          16
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          16
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          16
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          16
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          16
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          16
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          16
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          16
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          16
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          16
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          16
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          16
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          16
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          16
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          16
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          16
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          16
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          16
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          16
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          16
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          16
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          16
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          16
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          16
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          16
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          16
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          16
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          16
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          16
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          16
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          16
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          16
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          16
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          16
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          16
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          16
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          16
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          16
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          16
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          16
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          16
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          16
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.557898   .0863432    75.95   0.000     6.388448    6.727348
          2  |   6.571718   .0833589    78.84   0.000     6.408125    6.735312
          3  |   6.585538   .0803807    81.93   0.000      6.42779    6.743287
          4  |   6.599359   .0774093    85.25   0.000     6.447441    6.751276
          5  |   6.613179   .0744456    88.83   0.000     6.467078     6.75928
          6  |   6.626999   .0714905    92.70   0.000     6.486698    6.767301
          7  |   6.640819   .0685451    96.88   0.000     6.506298    6.775341
          8  |    6.65464   .0656108   101.43   0.000     6.525877    6.783402
          9  |    6.66846    .062689   106.37   0.000     6.545432    6.791488
         10  |    6.68228   .0597816   111.78   0.000     6.564958    6.799603
         11  |     6.6961   .0568909   117.70   0.000     6.584451     6.80775
         12  |   6.709921   .0540195   124.21   0.000     6.603906    6.815935
         13  |   6.723741   .0511706   131.40   0.000     6.623318    6.824164
         14  |   6.737561   .0483483   139.35   0.000     6.642677    6.832446
         15  |   6.751381   .0455574   148.19   0.000     6.661974    6.840789
         16  |   6.765202   .0428042   158.05   0.000     6.681198    6.849206
         17  |   6.779022   .0400963   169.07   0.000     6.700332    6.857712
         18  |   6.792842   .0374437   181.41   0.000     6.719358    6.866326
         19  |   6.806662    .034859   195.26   0.000     6.738251    6.875074
         20  |   6.820483   .0323583   210.78   0.000     6.756979    6.883987
         21  |   6.834303   .0299628   228.09   0.000       6.7755    6.893106
         22  |   6.848123   .0276997   247.23   0.000     6.793762    6.902484
         23  |   6.861944   .0256042   268.00   0.000     6.811695    6.912192
         24  |   6.875764   .0237209   289.86   0.000     6.829211    6.922316
         25  |   6.889584   .0221038   311.69   0.000     6.846205    6.932963
         26  |   6.903404   .0208153   331.65   0.000     6.862554    6.944255
         27  |   6.917225   .0199191   347.27   0.000     6.878133    6.956316
         28  |   6.931045   .0194696   355.99   0.000     6.892835    6.969254
         29  |   6.944865   .0194975   356.19   0.000     6.906601    6.983129
         30  |   6.958685   .0200011   347.92   0.000     6.919433    6.997938
         31  |   6.972506   .0209458   332.88   0.000     6.931399    7.013612
         32  |   6.986326   .0222758   313.63   0.000     6.942609    7.030043
         33  |   7.000146   .0239268   292.56   0.000     6.953189    7.047103
         34  |   7.013966   .0258374   271.47   0.000      6.96326    7.064673
         35  |   7.027787   .0279544   251.40   0.000     6.972925    7.082648
         36  |   7.041607   .0302345   232.90   0.000     6.982271    7.100943
         37  |   7.055427   .0326434   216.14   0.000     6.991364    7.119491
         38  |   7.069247   .0351549   201.09   0.000     7.000255    7.138239
         39  |   7.083068   .0377483   187.64   0.000     7.008986    7.157149
         40  |   7.096888   .0404079   175.63   0.000     7.017587    7.176189
         41  |   7.110708   .0431214   164.90   0.000     7.026081    7.195335
         42  |   7.124528   .0458794   155.29   0.000     7.034489    7.214568
         43  |   7.138349   .0486742   146.66   0.000     7.042824    7.233873
         44  |   7.152169   .0514998   138.88   0.000     7.051099    7.253238
         45  |   7.165989   .0543515   131.85   0.000     7.059323    7.272655
------------------------------------------------------------------------------

pred_ed16[45,1]
               y1
 1._at  6.5578979
 2._at  6.5717182
 3._at  6.5855384
 4._at  6.5993587
 5._at  6.6131789
 6._at  6.6269992
 7._at  6.6408194
 8._at  6.6546397
 9._at  6.6684599
10._at  6.6822802
11._at  6.6961005
12._at  6.7099207
13._at   6.723741
14._at  6.7375612
15._at  6.7513815
16._at  6.7652017
17._at   6.779022
18._at  6.7928422
19._at  6.8066625
20._at  6.8204827
21._at   6.834303
22._at  6.8481233
23._at  6.8619435
24._at  6.8757638
25._at   6.889584
26._at  6.9034043
27._at  6.9172245
28._at  6.9310448
29._at   6.944865
30._at  6.9586853
31._at  6.9725055
32._at  6.9863258
33._at  7.0001461
34._at  7.0139663
35._at  7.0277866
36._at  7.0416068
37._at  7.0554271
38._at  7.0692473
39._at  7.0830676
40._at  7.0968878
41._at  7.1107081
42._at  7.1245284
43._at  7.1383486
44._at  7.1521689
45._at  7.1659891
(results wage_kww are active now)

Adjusted predictions                            Number of obs     =        935

Expression   : S.E. of the prediction, predict(stdp)

1._at        : educ            =          16
               kww             =          12
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

2._at        : educ            =          16
               kww             =          13
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

3._at        : educ            =          16
               kww             =          14
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

4._at        : educ            =          16
               kww             =          15
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

5._at        : educ            =          16
               kww             =          16
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

6._at        : educ            =          16
               kww             =          17
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

7._at        : educ            =          16
               kww             =          18
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

8._at        : educ            =          16
               kww             =          19
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

9._at        : educ            =          16
               kww             =          20
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

10._at       : educ            =          16
               kww             =          21
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

11._at       : educ            =          16
               kww             =          22
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

12._at       : educ            =          16
               kww             =          23
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

13._at       : educ            =          16
               kww             =          24
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

14._at       : educ            =          16
               kww             =          25
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

15._at       : educ            =          16
               kww             =          26
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

16._at       : educ            =          16
               kww             =          27
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

17._at       : educ            =          16
               kww             =          28
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

18._at       : educ            =          16
               kww             =          29
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

19._at       : educ            =          16
               kww             =          30
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

20._at       : educ            =          16
               kww             =          31
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

21._at       : educ            =          16
               kww             =          32
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

22._at       : educ            =          16
               kww             =          33
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

23._at       : educ            =          16
               kww             =          34
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

24._at       : educ            =          16
               kww             =          35
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

25._at       : educ            =          16
               kww             =          36
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

26._at       : educ            =          16
               kww             =          37
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

27._at       : educ            =          16
               kww             =          38
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

28._at       : educ            =          16
               kww             =          39
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

29._at       : educ            =          16
               kww             =          40
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

30._at       : educ            =          16
               kww             =          41
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

31._at       : educ            =          16
               kww             =          42
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

32._at       : educ            =          16
               kww             =          43
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

33._at       : educ            =          16
               kww             =          44
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

34._at       : educ            =          16
               kww             =          45
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

35._at       : educ            =          16
               kww             =          46
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

36._at       : educ            =          16
               kww             =          47
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

37._at       : educ            =          16
               kww             =          48
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

38._at       : educ            =          16
               kww             =          49
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

39._at       : educ            =          16
               kww             =          50
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

40._at       : educ            =          16
               kww             =          51
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

41._at       : educ            =          16
               kww             =          52
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

42._at       : educ            =          16
               kww             =          53
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

43._at       : educ            =          16
               kww             =          54
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

44._at       : educ            =          16
               kww             =          55
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

45._at       : educ            =          16
               kww             =          56
               age             =    33.08021 (mean)
               hours           =    43.92941 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0863432
          2  |   .0833589
          3  |   .0803807
          4  |   .0774093
          5  |   .0744456
          6  |   .0714905
          7  |   .0685451
          8  |   .0656108
          9  |    .062689
         10  |   .0597816
         11  |   .0568909
         12  |   .0540195
         13  |   .0511706
         14  |   .0483483
         15  |   .0455574
         16  |   .0428042
         17  |   .0400963
         18  |   .0374437
         19  |    .034859
         20  |   .0323583
         21  |   .0299628
         22  |   .0276997
         23  |   .0256042
         24  |   .0237209
         25  |   .0221038
         26  |   .0208153
         27  |   .0199191
         28  |   .0194696
         29  |   .0194975
         30  |   .0200011
         31  |   .0209458
         32  |   .0222758
         33  |   .0239268
         34  |   .0258374
         35  |   .0279544
         36  |   .0302345
         37  |   .0326434
         38  |   .0351549
         39  |   .0377483
         40  |   .0404079
         41  |   .0431214
         42  |   .0458794
         43  |   .0486742
         44  |   .0514998
         45  |   .0543515
------------------------------------------------------------------------------

pred_se_ed16[45,1]
               y1
 1._at  .08634322
 2._at  .08335888
 3._at  .08038068
 4._at  .07740932
 5._at   .0744456
 6._at   .0714905
 7._at  .06854511
 8._at  .06561076
 9._at  .06268898
10._at  .05978162
11._at   .0568909
12._at  .05401948
13._at  .05117061
14._at  .04834828
15._at  .04555742
16._at   .0428042
17._at  .04009635
18._at  .03744373
19._at  .03485895
20._at  .03235827
21._at  .02996275
22._at   .0276997
23._at  .02560425
24._at  .02372086
25._at  .02210382
26._at  .02081529
27._at  .01991912
28._at  .01946957
29._at  .01949755
30._at  .02000106
31._at  .02094584
32._at  .02227581
33._at  .02392682
34._at  .02583741
35._at   .0279544
36._at  .03023446
37._at  .03264345
38._at  .03515486
39._at  .03774827
40._at  .04040788
41._at  .04312145
42._at   .0458794
43._at   .0486742
44._at  .05149984
45._at  .05435151

. 
. foreach myeduc of numlist 10(2)16{
  2.     gen exp_pred`myeduc'=exp(pred_ed`myeduc'1)
  3.     gen ub`myeduc'=exp(pred_ed`myeduc'+(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  4.     gen lb`myeduc'=exp(pred_ed`myeduc'-(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  5. }
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)
(890 missing values generated)

. 
. egen kww_levels=fill(`mymin'(1)`mymax')    

. 
. twoway line exp_pred10 exp_pred12 exp_pred14 exp_pred16 kww_levels in 1/45, ///
>        legend(order(1 "10 Years" 2 "12 Years" 3 "14 Years" 4 "16 Years")) ///
>            ytitle("Wages") xtitle("Knowledge of World of Work") name(educ_mult_kww)

. 
. 
. exit 

end of do-file


