--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/model_design/model_design
> _do.log
  log type:  text
 opened on:  14 Feb 2017, 16:56:57

. 
. /* Model specification, interactions, prediction and plots after interaction*/
. /* Will Doyle */
. /* 1170214 */
. /* Practicum Folder */
. 
. clear

. 
. clear matrix

. 
. graph drop _all

. 
. estimates clear /* Clears any estimates hanging around */

. 
. set more off /*Get rid of annoying "more" feature */

. 
. ssc install bcuse
checking bcuse consistency and verifying not already installed...
all files already exist and are up to date.

. 
. ssc install nnest
checking nnest consistency and verifying not already installed...
all files already exist and are up to date.

. 
. bcuse wage2, clear

Contains data from http://fmwww.bc.edu/ec-p/data/wooldridge/wage2.dta
  obs:           935                          
 vars:            17                          26 Jan 2000 12:16
 size:        63,580                          
--------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------------------------
wage            float   %9.0g                 
hours           float   %9.0g                 
IQ              float   %9.0g                 
KWW             float   %9.0g                 
educ            float   %9.0g                 
exper           float   %9.0g                 
tenure          float   %9.0g                 
age             float   %9.0g                 
married         float   %9.0g                 
black           float   %9.0g                 
south           float   %9.0g                 
urban           float   %9.0g                 
sibs            float   %9.0g                 
brthord         float   %9.0g                 
meduc           float   %9.0g                 
feduc           float   %9.0g                 
lwage           float   %9.0g                 
--------------------------------------------------------------------------------------------------
Sorted by:  

. 
. label variable wage "Wages from work in last month"

. 
. label variable hours "Weekly hours"

. 
. label variable IQ "IQ test"

. 
. label variable KWW "Knowledge of world of work"

. 
. label variable educ "Years of education"

. 
. label variable tenure "Months in current job"

. 
. label variable age "Age"

. 
. label variable married "Married"

. 
. label variable black "African-American"

. 
. label variable south "South"

. 
. label variable urban "Urban"

. 
. label variable sibs "No. Siblings"

. 
. label variable brthord "Birth order"

. 
. label variable meduc "Mother's years of school"

. 
. label variable feduc "Father's years of education"

. 
. label variable lwage "ln Wage"

. 
. renvars *, lower

. 
. save wage2, replace
file wage2.dta saved

. 
. /*Constants*/
. 
.     local sig=.05

. 
. local sigtail=`sig'/2

. 
. /*Plots of data */
. 
. graph twoway scatter wage educ 

. 
. graph export "wage_educ.pdf", replace 
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/model_design/wage_educ.pdf writt
> en in PDF format)

. 
. graph twoway qfit wage age||scatter wage age 

. 
. graph export "wage_age.pdf", replace  
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/model_design/wage_age.pdf writte
> n in PDF format)

. 
. /*Missing Data */ 
.     
. di _N
935

.   
. reg lwage hours educ age

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  3,   931) =   46.91
       Model |  21.7514568     3  7.25048559           Prob > F      =  0.0000
    Residual |  143.904838   931   .15457018           R-squared     =  0.1313
-------------+------------------------------           Adj R-squared =  0.1285
       Total |  165.656294   934  .177362199           Root MSE      =  .39315

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0047011   .0017887    -2.63   0.009    -.0082115   -.0011906
        educ |   .0616404   .0058814    10.48   0.000     .0500981    .0731827
         age |   .0227339   .0041411     5.49   0.000     .0146069    .0308608
       _cons |   5.403279   .1732026    31.20   0.000     5.063366    5.743191
------------------------------------------------------------------------------

. 
. reg lwage hours educ age meduc

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F(  4,   852) =   38.47
       Model |  22.8514162     4  5.71285406           Prob > F      =  0.0000
    Residual |  126.509635   852  .148485487           R-squared     =  0.1530
-------------+------------------------------           Adj R-squared =  0.1490
       Total |  149.361051   856  .174487209           Root MSE      =  .38534

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0058052   .0018374    -3.16   0.002    -.0094115   -.0021989
        educ |   .0525597   .0064521     8.15   0.000     .0398957    .0652236
         age |   .0243798   .0042747     5.70   0.000     .0159896      .03277
       meduc |   .0184424   .0049725     3.71   0.000     .0086826    .0282022
       _cons |    5.33402   .1776844    30.02   0.000      4.98527    5.682771
------------------------------------------------------------------------------

. 
. reg lwage hours educ age feduc

      Source |       SS       df       MS              Number of obs =     741
-------------+------------------------------           F(  4,   736) =   34.17
       Model |  20.2139719     4  5.05349299           Prob > F      =  0.0000
    Residual |  108.836202   736  .147875274           R-squared     =  0.1566
-------------+------------------------------           Adj R-squared =  0.1521
       Total |  129.050173   740  .174392126           Root MSE      =  .38455

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |   -.007041   .0019639    -3.59   0.000    -.0108964   -.0031855
        educ |   .0475258   .0070026     6.79   0.000     .0337785    .0612732
         age |   .0262759   .0045806     5.74   0.000     .0172834    .0352685
       feduc |   .0172076   .0047569     3.62   0.000     .0078689    .0265462
       _cons |   5.421121   .1897058    28.58   0.000     5.048692     5.79355
------------------------------------------------------------------------------

. 
. reg lwage hours educ age feduc meduc 

      Source |       SS       df       MS              Number of obs =     722
-------------+------------------------------           F(  5,   716) =   27.64
       Model |   20.519095     5  4.10381899           Prob > F      =  0.0000
    Residual |  106.292836   716  .148453682           R-squared     =  0.1618
-------------+------------------------------           Adj R-squared =  0.1560
       Total |  126.811931   721    .1758834           Root MSE      =   .3853

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0071408   .0019821    -3.60   0.000    -.0110321   -.0032495
        educ |    .046006   .0072322     6.36   0.000     .0318071    .0602049
         age |   .0249456   .0046705     5.34   0.000     .0157762     .034115
       feduc |   .0114239   .0055571     2.06   0.040     .0005138     .022334
       meduc |   .0132414   .0063094     2.10   0.036     .0008543    .0256285
       _cons |   5.404781   .1929204    28.02   0.000     5.026024    5.783539
------------------------------------------------------------------------------

. 
. gen analytic_sample_flag=e(sample)

. 
. reg lwage hours educ age if analytic_sample_flag==1 

      Source |       SS       df       MS              Number of obs =     722
-------------+------------------------------           F(  3,   718) =   39.52
       Model |   17.972245     3  5.99074834           Prob > F      =  0.0000
    Residual |  108.839686   718  .151587307           R-squared     =  0.1417
-------------+------------------------------           Adj R-squared =  0.1381
       Total |  126.811931   721    .1758834           Root MSE      =  .38934

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0067617   .0019997    -3.38   0.001    -.0106877   -.0028357
        educ |   .0593979   .0065158     9.12   0.000     .0466056    .0721902
         age |   .0236215   .0046986     5.03   0.000      .014397    .0328461
       _cons |    5.50891   .1932456    28.51   0.000     5.129516    5.888304
------------------------------------------------------------------------------

. 
. reg lwage hours educ age meduc if analytic_sample_flag==1 

      Source |       SS       df       MS              Number of obs =     722
-------------+------------------------------           F(  4,   717) =   33.35
       Model |  19.8917203     4  4.97293007           Prob > F      =  0.0000
    Residual |  106.920211   717  .149121633           R-squared     =  0.1569
-------------+------------------------------           Adj R-squared =  0.1522
       Total |  126.811931   721    .1758834           Root MSE      =  .38616

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0071587   .0019865    -3.60   0.000    -.0110588   -.0032587
        educ |    .050238   .0069486     7.23   0.000      .036596    .0638801
         age |   .0240817    .004662     5.17   0.000      .014929    .0332345
       meduc |   .0196873   .0054874     3.59   0.000      .008914    .0304606
       _cons |   5.423663   .1931347    28.08   0.000     5.044485     5.80284
------------------------------------------------------------------------------

. 
. gen meduc_flag=meduc==.

. 
. gen feduc_flag=feduc==.

. 
. tab meduc_flag feduc_flag

           |      feduc_flag
meduc_flag |         0          1 |     Total
-----------+----------------------+----------
         0 |       722        135 |       857 
         1 |        19         59 |        78 
-----------+----------------------+----------
     Total |       741        194 |       935 


.   
. /*NOOOOOOOO!!! Stepwise regression*/
. 
. stepwise, pr(.2): reg lwage hours educ age meduc feduc tenure south married black urban sibs kww
>  iq brthord
                      begin with full model
p = 0.3500 >= 0.2000  removing feduc
p = 0.2712 >= 0.2000  removing sibs
p = 0.2237 >= 0.2000  removing brthord

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F( 11,   651) =   23.26
       Model |  31.7400529    11  2.88545936           Prob > F      =  0.0000
    Residual |  80.7431222   651  .124029374           R-squared     =  0.2822
-------------+------------------------------           Adj R-squared =  0.2700
       Total |  112.483175   662  .169914162           Root MSE      =  .35218

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0067126   .0019326    -3.47   0.001    -.0105074   -.0029177
        educ |   .0332989   .0078237     4.26   0.000     .0179361    .0486617
         age |   .0157517    .005244     3.00   0.003     .0054545    .0260488
       meduc |   .0134071   .0053659     2.50   0.013     .0028706    .0239437
         kww |   .0034485   .0023844     1.45   0.149    -.0012335    .0081305
      tenure |   .0081709   .0028567     2.86   0.004     .0025613    .0137804
       south |  -.0585439   .0305602    -1.92   0.056    -.1185524    .0014646
     married |   .2077864   .0461308     4.50   0.000     .1172033    .2983696
       black |  -.0938556    .054557    -1.72   0.086    -.2009845    .0132733
       urban |   .1980571   .0312361     6.34   0.000     .1367215    .2593928
          iq |   .0034329    .001223     2.81   0.005     .0010314    .0058343
       _cons |   5.151168   .2180037    23.63   0.000     4.723092    5.579243
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage hours educ age meduc feduc tenure south married black urban sibs kw
> w iq brthord
                      begin with full model
p = 0.3500 >= 0.0500  removing feduc
p = 0.2712 >= 0.0500  removing sibs
p = 0.2237 >= 0.0500  removing brthord
p = 0.1486 >= 0.0500  removing kww
p = 0.0689 >= 0.0500  removing south

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F(  9,   653) =   27.69
       Model |  31.0680934     9  3.45201038           Prob > F      =  0.0000
    Residual |  81.4150818   653  .124678533           R-squared     =  0.2762
-------------+------------------------------           Adj R-squared =  0.2662
       Total |  112.483175   662  .169914162           Root MSE      =   .3531

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0064609   .0019327    -3.34   0.001    -.0102559   -.0026659
        educ |   .0347812   .0076565     4.54   0.000     .0197469    .0498156
         age |   .0195908   .0047192     4.15   0.000     .0103242    .0288574
       meduc |   .0150286   .0053333     2.82   0.005      .004556    .0255011
          iq |   .0040984   .0011802     3.47   0.001     .0017809    .0064159
      tenure |   .0088182   .0028499     3.09   0.002     .0032221    .0144143
       urban |   .2102756   .0308692     6.81   0.000     .1496607    .2708905
     married |   .2095021   .0461979     4.53   0.000     .1187877    .3002164
       black |  -.1163507   .0538301    -2.16   0.031    -.2220516   -.0106498
       _cons |   5.000151    .206967    24.16   0.000      4.59375    5.406552
------------------------------------------------------------------------------

. 
. stepwise, pr(.2) : reg lwage south brthord iq kww sibs feduc tenure  married black urban hours e
> duc age meduc
                      begin with full model
p = 0.3500 >= 0.2000  removing feduc
p = 0.2712 >= 0.2000  removing sibs
p = 0.2237 >= 0.2000  removing brthord

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F( 11,   651) =   23.26
       Model |  31.7400529    11  2.88545936           Prob > F      =  0.0000
    Residual |  80.7431222   651  .124029374           R-squared     =  0.2822
-------------+------------------------------           Adj R-squared =  0.2700
       Total |  112.483175   662  .169914162           Root MSE      =  .35218

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.0585439   .0305602    -1.92   0.056    -.1185524    .0014646
        educ |   .0332989   .0078237     4.26   0.000     .0179361    .0486617
          iq |   .0034329    .001223     2.81   0.005     .0010314    .0058343
         kww |   .0034485   .0023844     1.45   0.149    -.0012335    .0081305
         age |   .0157517    .005244     3.00   0.003     .0054545    .0260488
       meduc |   .0134071   .0053659     2.50   0.013     .0028706    .0239437
      tenure |   .0081709   .0028567     2.86   0.004     .0025613    .0137804
     married |   .2077864   .0461308     4.50   0.000     .1172033    .2983696
       black |  -.0938556    .054557    -1.72   0.086    -.2009845    .0132733
       urban |   .1980571   .0312361     6.34   0.000     .1367215    .2593928
       hours |  -.0067126   .0019326    -3.47   0.001    -.0105074   -.0029177
       _cons |   5.151168   .2180037    23.63   0.000     4.723092    5.579243
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage south brthord iq kww sibs feduc tenure  married black urban hours e
> duc age meduc
                      begin with full model
p = 0.3500 >= 0.0500  removing feduc
p = 0.2712 >= 0.0500  removing sibs
p = 0.2237 >= 0.0500  removing brthord
p = 0.1486 >= 0.0500  removing kww
p = 0.0689 >= 0.0500  removing south

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F(  9,   653) =   27.69
       Model |  31.0680934     9  3.45201038           Prob > F      =  0.0000
    Residual |  81.4150818   653  .124678533           R-squared     =  0.2762
-------------+------------------------------           Adj R-squared =  0.2662
       Total |  112.483175   662  .169914162           Root MSE      =   .3531

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       urban |   .2102756   .0308692     6.81   0.000     .1496607    .2708905
        educ |   .0347812   .0076565     4.54   0.000     .0197469    .0498156
          iq |   .0040984   .0011802     3.47   0.001     .0017809    .0064159
       hours |  -.0064609   .0019327    -3.34   0.001    -.0102559   -.0026659
         age |   .0195908   .0047192     4.15   0.000     .0103242    .0288574
       meduc |   .0150286   .0053333     2.82   0.005      .004556    .0255011
      tenure |   .0088182   .0028499     3.09   0.002     .0032221    .0144143
     married |   .2095021   .0461979     4.53   0.000     .1187877    .3002164
       black |  -.1163507   .0538301    -2.16   0.031    -.2220516   -.0106498
       _cons |   5.000151    .206967    24.16   0.000      4.59375    5.406552
------------------------------------------------------------------------------

.   
. stepwise, pr(.2) : reg lwage south brthord  kww sibs feduc tenure  married black  hours educ age
>  meduc
                      begin with full model
p = 0.5103 >= 0.2000  removing sibs
p = 0.2146 >= 0.2000  removing brthord

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F( 10,   652) =   19.75
       Model |  26.1546559    10  2.61546559           Prob > F      =  0.0000
    Residual |  86.3285193   652  .132405704           R-squared     =  0.2325
-------------+------------------------------           Adj R-squared =  0.2207
       Total |  112.483175   662  .169914162           Root MSE      =  .36388

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.0886972   .0312376    -2.84   0.005    -.1500357   -.0273588
         age |   .0120413   .0053403     2.25   0.024     .0015551    .0225275
         kww |   .0066253   .0023708     2.79   0.005       .00197    .0112805
       meduc |   .0106574   .0062851     1.70   0.090    -.0016842    .0229989
       feduc |   .0084136   .0055693     1.51   0.131    -.0025224    .0193497
      tenure |   .0078097   .0029507     2.65   0.008     .0020157    .0136036
     married |   .1987501   .0476411     4.17   0.000     .1052016    .2922985
       black |  -.0799257   .0545557    -1.47   0.143    -.1870519    .0272004
       hours |   -.006741   .0019951    -3.38   0.001    -.0106585   -.0028235
        educ |   .0412033   .0075936     5.43   0.000     .0262926    .0561141
       _cons |   5.508661   .2030461    27.13   0.000     5.109958    5.907365
------------------------------------------------------------------------------

. 
. stepwise, pr(.05): reg lwage south brthord  kww sibs feduc tenure  married black  hours educ age
>  meduc
                      begin with full model
p = 0.5103 >= 0.0500  removing sibs
p = 0.2146 >= 0.0500  removing brthord
p = 0.1434 >= 0.0500  removing black
p = 0.1099 >= 0.0500  removing feduc

      Source |       SS       df       MS              Number of obs =     663
-------------+------------------------------           F(  8,   654) =   24.00
       Model |  25.5304974     8  3.19131217           Prob > F      =  0.0000
    Residual |  86.9526778   654  .132955165           R-squared     =  0.2270
-------------+------------------------------           Adj R-squared =  0.2175
       Total |  112.483175   662  .169914162           Root MSE      =  .36463

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       south |  -.1005921   .0307895    -3.27   0.001    -.1610502    -.040134
         age |   .0108531   .0053138     2.04   0.042      .000419    .0212872
         kww |   .0074534   .0023359     3.19   0.001     .0028667    .0120401
       meduc |   .0161784   .0055007     2.94   0.003     .0053773    .0269795
       hours |  -.0066665   .0019986    -3.34   0.001    -.0105909   -.0027422
      tenure |   .0077155    .002955     2.61   0.009     .0019132    .0135178
     married |   .2023529   .0476962     4.24   0.000     .1086967    .2960091
        educ |   .0438651   .0073657     5.96   0.000     .0294018    .0583284
       _cons |     5.4996   .2016607    27.27   0.000      5.10362    5.895581
------------------------------------------------------------------------------

. 
. /*Functional Form */
. 
. 
.  /*RESET test */
. 
. reg lwage hours age educ

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  3,   931) =   46.91
       Model |  21.7514568     3  7.25048559           Prob > F      =  0.0000
    Residual |  143.904838   931   .15457018           R-squared     =  0.1313
-------------+------------------------------           Adj R-squared =  0.1285
       Total |  165.656294   934  .177362199           Root MSE      =  .39315

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0047011   .0017887    -2.63   0.009    -.0082115   -.0011906
         age |   .0227339   .0041411     5.49   0.000     .0146069    .0308608
        educ |   .0616404   .0058814    10.48   0.000     .0500981    .0731827
       _cons |   5.403279   .1732026    31.20   0.000     5.063366    5.743191
------------------------------------------------------------------------------

. 
. estat ovtest

Ramsey RESET test using powers of the fitted values of lwage
       Ho:  model has no omitted variables
                 F(3, 928) =      0.32
                  Prob > F =      0.8089

. 
. estat ovtest, rhs

Ramsey RESET test using powers of the independent variables
       Ho:  model has no omitted variables
                 F(9, 922) =      2.12
                  Prob > F =      0.0255

. 
. gen agesq=age^2

. 
. label var agesq "Age squared"

. 
. reg lwage hours educ age agesq

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  4,   930) =   35.15
       Model |  21.7551592     4  5.43878981           Prob > F      =  0.0000
    Residual |  143.901135   930  .154732403           R-squared     =  0.1313
-------------+------------------------------           Adj R-squared =  0.1276
       Total |  165.656294   934  .177362199           Root MSE      =  .39336

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |     -.0047   .0017897    -2.63   0.009    -.0082123   -.0011876
        educ |   .0615585   .0059083    10.42   0.000     .0499634    .0731536
         age |   .0388675   .1043805     0.37   0.710    -.1659811    .2437162
       agesq |  -.0002425   .0015678    -0.15   0.877    -.0033193    .0028343
       _cons |   5.138356   1.721371     2.99   0.003     1.760134    8.516578
------------------------------------------------------------------------------

. 
. test age agesq

 ( 1)  age = 0
 ( 2)  agesq = 0

       F(  2,   930) =   15.07
            Prob > F =    0.0000

. 
. gen educsq=educ^2

. 
. la var educsq "Education squared"

. 
. reg lwage hours age educ educsq

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  4,   930) =   36.27
       Model |  22.3576551     4  5.58941378           Prob > F      =  0.0000
    Residual |  143.298639   930  .154084558           R-squared     =  0.1350
-------------+------------------------------           Adj R-squared =  0.1312
       Total |  165.656294   934  .177362199           Root MSE      =  .39254

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |   -.004608   .0017866    -2.58   0.010    -.0081141   -.0011018
         age |   .0243563   .0042147     5.78   0.000     .0160848    .0326278
        educ |   .2161619   .0781252     2.77   0.006     .0628397     .369484
      educsq |  -.0054912   .0027685    -1.98   0.048    -.0109245    -.000058
       _cons |   4.286926   .5887928     7.28   0.000      3.13141    5.442443
------------------------------------------------------------------------------

. 
. test educ educsq

 ( 1)  educ = 0
 ( 2)  educsq = 0

       F(  2,   930) =   57.06
            Prob > F =    0.0000

. 
. /*Preferred method */
. 
. reg lwage hours age agesq educ educsq

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  5,   929) =   29.00
       Model |  22.3674226     5  4.47348452           Prob > F      =  0.0000
    Residual |  143.288872   929  .154239905           R-squared     =  0.1350
-------------+------------------------------           Adj R-squared =  0.1304
       Total |  165.656294   934  .177362199           Root MSE      =  .39273

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0046056   .0017875    -2.58   0.010    -.0081135   -.0010976
         age |    .050602   .1043806     0.48   0.628     -.154247     .255451
       agesq |  -.0003944   .0015672    -0.25   0.801    -.0034699    .0026812
        educ |   .2169837   .0782328     2.77   0.006     .0634502    .3705171
      educsq |  -.0055252   .0027732    -1.99   0.047    -.0109676   -.0000828
       _cons |   3.849225   1.836393     2.10   0.036     .2452658    7.453184
------------------------------------------------------------------------------

. 
. test age agesq

 ( 1)  age = 0
 ( 2)  agesq = 0

       F(  2,   929) =   16.71
            Prob > F =    0.0000

. 
. test educ educsq

 ( 1)  educ = 0
 ( 2)  educsq = 0

       F(  2,   929) =   56.44
            Prob > F =    0.0000

. 
. /* Davidson-MacKinnon Test:non-nested alternatives */
. 
. reg lwage hours iq 

      Source |       SS       df       MS              Number of obs =     935
-------------+------------------------------           F(  2,   932) =   54.14
       Model |  17.2420918     2  8.62104588           Prob > F      =  0.0000
    Residual |  148.414203   932  .159242707           R-squared     =  0.1041
-------------+------------------------------           Adj R-squared =  0.1022
       Total |  165.656294   934  .177362199           Root MSE      =  .39905

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0041302   .0018124    -2.28   0.023     -.007687   -.0005734
          iq |   .0089535   .0008698    10.29   0.000     .0072465    .0106606
       _cons |   6.053607   .1150416    52.62   0.000     5.827837    6.279378
------------------------------------------------------------------------------

. 
. nnest educ age

                   Competing Models                 
  --------------------------------------------------
  M1 : Y = [lwage]
       X = [hours iq]
  M2 : Y = [lwage]
       Z = [educ age]
  --------------------------------------------------
             J test for non-nested models           
  --------------------------------------------------
                    Dist         Stat      P>|Stat|
  H0:M1 / H1:M2    t(931)        8.18       0.000
  H0:M2 / H1:M1    t(931)        6.77       0.000
  --------------------------------------------------
        Cox-Pesaran test for non-nested models      
  --------------------------------------------------
                    Dist         Stat      P>|Stat|
  H0:M1 / H1:M2    N(0,1)      -12.47       0.000
  H0:M2 / H1:M1    N(0,1)      -10.17       0.000
  --------------------------------------------------

. 
. /* Interactions */
. 
. gen educ_adj=educ+.2

.   
. graph twoway (scatter wage educ if black==0, msize(small) mcolor(red)) ///
>     (scatter wage educ_adj if black==1, msize(small) mcolor(blue))   ///
>         (lfit wage educ if black==0, lcolor(red))  ///
>             (lfit wage educ if black==1, lcolor(blue)), ///
>                 legend(order(1 "White" 2 "Black")) 

. 
.                                                                 
. /*Binary-binary interaction*/
. 
. gen black_marry=black*married

.   
. eststo black_marry: reg lwage hours age educ i.black##i.married iq meduc south urban

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F( 10,   846) =   29.83
       Model |  38.9381574    10  3.89381574           Prob > F      =  0.0000
    Residual |  110.422894   846  .130523515           R-squared     =  0.2607
-------------+------------------------------           Adj R-squared =  0.2520
       Total |  149.361051   856  .174487209           Root MSE      =  .36128

-------------------------------------------------------------------------------
        lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        hours |  -.0063301   .0017273    -3.66   0.000    -.0097204   -.0029398
          age |   .0220385   .0040456     5.45   0.000     .0140979    .0299792
         educ |   .0363765   .0068217     5.33   0.000     .0229871    .0497659
      1.black |  -.2750052   .1036788    -2.65   0.008     -.478503   -.0715073
    1.married |   .1817023   .0438419     4.14   0.000     .0956506     .267754
              |
black#married |
         1 1  |    .153022   .1108707     1.38   0.168    -.0645919    .3706359
              |
           iq |   .0039649   .0010438     3.80   0.000     .0019162    .0060137
        meduc |   .0104632   .0047967     2.18   0.029     .0010483    .0198781
        south |  -.0729291   .0276262    -2.64   0.008    -.1271531   -.0187051
        urban |    .179466   .0280946     6.39   0.000     .1243228    .2346092
        _cons |   5.084363   .1866763    27.24   0.000     4.717961    5.450766
-------------------------------------------------------------------------------

. 
. /*Binary-continous interaction*/
. 
. eststo black_educ: reg lwage hours age i.black##c.educ married  iq meduc south urban

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F( 10,   846) =   29.69
       Model |  38.7974052    10  3.87974052           Prob > F      =  0.0000
    Residual |  110.563646   846  .130689889           R-squared     =  0.2598
-------------+------------------------------           Adj R-squared =  0.2510
       Total |  149.361051   856  .174487209           Root MSE      =  .36151

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0063045     .00173    -3.64   0.000    -.0097001    -.002909
         age |   .0215072   .0040455     5.32   0.000     .0135669    .0294476
     1.black |   .1034702   .2766783     0.37   0.709    -.4395862    .6465265
        educ |   .0378404   .0069883     5.41   0.000     .0241239    .0515569
             |
black#c.educ |
          1  |  -.0196117   .0215854    -0.91   0.364    -.0619789    .0227554
             |
     married |   .2051596   .0402851     5.09   0.000     .1260892      .28423
          iq |   .0040191   .0010442     3.85   0.000     .0019695    .0060687
       meduc |   .0102747   .0047964     2.14   0.032     .0008604    .0196889
       south |   -.069586   .0276172    -2.52   0.012    -.1237922   -.0153798
       urban |    .179133   .0281112     6.37   0.000     .1239572    .2343088
       _cons |    5.05532    .187864    26.91   0.000     4.686586    5.424055
------------------------------------------------------------------------------

. 
. /*Continuous-Continuous interaction*/
. 
. eststo age_educ : reg lwage hours age educ c.age#c.educ black married iq meduc south urban 

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F( 10,   846) =   30.08
       Model |  39.1769054    10  3.91769054           Prob > F      =  0.0000
    Residual |  110.184146   846  .130241307           R-squared     =  0.2623
-------------+------------------------------           Adj R-squared =  0.2536
       Total |  149.361051   856  .174487209           Root MSE      =  .36089

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0066151   .0017294    -3.83   0.000    -.0100095   -.0032208
         age |  -.0280105   .0260076    -1.08   0.282    -.0790575    .0230364
        educ |  -.0876756   .0645406    -1.36   0.175    -.2143541    .0390029
             |
c.age#c.educ |   .0037019   .0019136     1.93   0.053    -.0000542    .0074579
             |
       black |  -.1466181   .0430343    -3.41   0.001    -.2310847   -.0621515
     married |   .2063299   .0402134     5.13   0.000     .1274003    .2852596
          iq |   .0040003   .0010423     3.84   0.000     .0019545    .0060461
       meduc |   .0100804   .0047844     2.11   0.035     .0006897     .019471
       south |    -.06698   .0276104    -2.43   0.015     -.121173    -.012787
       urban |    .182844     .02813     6.50   0.000     .1276312    .2380569
       _cons |   6.747921   .8848456     7.63   0.000     5.011171    8.484672
------------------------------------------------------------------------------

.  
. 
. /// Margins after interactions
> 
. estimates replay black_marry 

--------------------------------------------------------------------------------------------------
Model black_marry
--------------------------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F( 10,   846) =   29.83
       Model |  38.9381574    10  3.89381574           Prob > F      =  0.0000
    Residual |  110.422894   846  .130523515           R-squared     =  0.2607
-------------+------------------------------           Adj R-squared =  0.2520
       Total |  149.361051   856  .174487209           Root MSE      =  .36128

-------------------------------------------------------------------------------
        lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        hours |  -.0063301   .0017273    -3.66   0.000    -.0097204   -.0029398
          age |   .0220385   .0040456     5.45   0.000     .0140979    .0299792
         educ |   .0363765   .0068217     5.33   0.000     .0229871    .0497659
      1.black |  -.2750052   .1036788    -2.65   0.008     -.478503   -.0715073
    1.married |   .1817023   .0438419     4.14   0.000     .0956506     .267754
              |
black#married |
         1 1  |    .153022   .1108707     1.38   0.168    -.0645919    .3706359
              |
           iq |   .0039649   .0010438     3.80   0.000     .0019162    .0060137
        meduc |   .0104632   .0047967     2.18   0.029     .0010483    .0198781
        south |  -.0729291   .0276262    -2.64   0.008    -.1271531   -.0187051
        urban |    .179466   .0280946     6.39   0.000     .1243228    .2346092
        _cons |   5.084363   .1866763    27.24   0.000     4.717961    5.450766
-------------------------------------------------------------------------------

. 
. estimates restore black_marry
(results black_marry are active now)

. 
. local mydf=e(df_r)

. 
. margins , predict(xb) at(black=(1 0) married=(0 1) south=1 urban=1 (mean) hours age educ iq medu
> c ) post

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.373663   .0962576    66.21   0.000     6.184731    6.562595
          2  |   6.708387   .0442677   151.54   0.000       6.6215    6.795275
          3  |   6.648668   .0467271   142.29   0.000     6.556954    6.740383
          4  |   6.830371   .0259499   263.21   0.000     6.779437    6.881304
------------------------------------------------------------------------------

. 
. mat mypred=e(b)'

. 
. mata: st_matrix("mypred", exp(st_matrix("mypred")))

. 
. svmat mypred

. 
. mat mypred1=e(b)'

. 
. svmat mypred1

. 
. local no_predict=rowsof(mypred)

. 
. di "no of preds is `no_predict'"
no of preds is 4

. 
. egen mycount=fill(1(1)`no_predict')

. 
. graph twoway bar mypred1 mycount in 1/4, barw(.6) base(0) ytick(100(100)1000) ylabel(0(100)1000)
>  

.       
. estimates restore black_marry
(results black_marry are active now)

. 
. margins , predict(stdp) at((mean) _all black=(1 0) married=(0 1) south=1 urban=1) post nose

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           0
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           0
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0962576
          2  |   .0442677
          3  |   .0467271
          4  |   .0259499
------------------------------------------------------------------------------

. 
. mat mystdp=e(b)'

. 
. svmat mystdp

. 
. gen ub_log=mypred11+ (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. gen lb_log=mypred11- (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. 
. gen ub=exp(ub_log)
(931 missing values generated)

. gen lb=exp(lb_log)
(931 missing values generated)

. 
. 
. graph twoway (bar mypred1 mycount if mycount==1, barw(.6) base(0) ytick(100(100)1000) ylabel(0(1
> 00)1000)) ///
>               (bar mypred1 mycount if mycount==2, barw(.6) base(0) ytick(100(100)1000) ylabel(0(
> 100)1000)) ///
>                (bar mypred1 mycount if mycount==3, barw(.6) base(0) ytick(100(100)1000) ylabel(0
> (100)1000)) ///
>                 (bar mypred1 mycount if mycount==4, barw(.6) base(0) ytick(100(100)1000) ylabel(
> 0(100)1000)) ///
>                     (rcap ub lb mycount in 1/`no_predict'), ///
>                         xlabel(1 "Unmarried, Black" 2 "Married, Black" 3 "Unmarried, White" 4 "M
> arried, White") ytitle("Predicted Wages")   xtitle("") legend(off)

. 
.        
. /* Clear out prediction variables */    
. drop mypred*

. drop mystdp*

. drop ub*

. drop lb*

. drop mycount    

. 
. eststo urban_south: reg lwage hours age educ black married iq meduc i.south##i.urban 

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F( 10,   846) =   30.26
       Model |  39.3509478    10  3.93509478           Prob > F      =  0.0000
    Residual |  110.010103   846  .130035583           R-squared     =  0.2635
-------------+------------------------------           Adj R-squared =  0.2548
       Total |  149.361051   856  .174487209           Root MSE      =   .3606

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       hours |  -.0064086   .0017237    -3.72   0.000    -.0097919   -.0030252
         age |   .0223906   .0040422     5.54   0.000     .0144567    .0303244
        educ |   .0366152   .0068088     5.38   0.000     .0232511    .0499793
       black |  -.1413414   .0430185    -3.29   0.001     -.225777   -.0569058
     married |   .2032162   .0401949     5.06   0.000     .1243228    .2821096
          iq |   .0041836   .0010445     4.01   0.000     .0021334    .0062338
       meduc |   .0111274   .0048022     2.32   0.021     .0017018     .020553
     1.south |   .0219466   .0494206     0.44   0.657    -.0750549     .118948
     1.urban |   .2284794   .0355802     6.42   0.000     .1586435    .2983153
             |
 south#urban |
        1 1  |  -.1307251   .0579628    -2.26   0.024    -.2444928   -.0169573
             |
       _cons |   4.985266   .1903604    26.19   0.000     4.611632      5.3589
------------------------------------------------------------------------------

. 
. local mydf=e(df_r)

. 
. margins , predict(xb) at(urban=(1 0) south=(0 1) black=1 married=1 (mean) hours age educ iq medu
> c ) post

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           0

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           0

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.774144   .0430267   157.44   0.000     6.689692    6.858595
          2  |   6.545664   .0520576   125.74   0.000     6.443487    6.647842
          3  |   6.665365   .0433606   153.72   0.000     6.580258    6.750472
          4  |   6.567611   .0535553   122.63   0.000     6.462494    6.672728
------------------------------------------------------------------------------

. 
. mat mypred=e(b)'

. 
. mata: st_matrix("mypred", exp(st_matrix("mypred")))

. 
. svmat mypred

. 
. mat mypred1=e(b)'

. 
. svmat mypred1

. 
. local no_predict=rowsof(mypred)

. 
. di "no of preds is `no_predict'"
no of preds is 4

. 
. egen mycount=fill(1(1)`no_predict')

. 
. graph twoway bar mypred1 mycount in 1/4, barw(.6) base(0) ytick(100(100)1000) ylabel(0(100)1000)
>  

.       
. estimates restore black_marry
(results black_marry are active now)

. 
. margins , predict(stdp) at((mean) _all urban=(1 0) south=(0 1) black=1 married=1) post nose

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           1

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           0
               urban           =           0

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           1

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               educ            =    13.57526 (mean)
               black           =           1
               married         =           1
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =           1
               urban           =           0

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0453348
          2  |   .0519674
          3  |   .0442677
          4  |   .0491239
------------------------------------------------------------------------------

. 
. mat mystdp=e(b)'

. 
. svmat mystdp

. 
. gen ub_log=mypred11+ (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. gen lb_log=mypred11- (invttail(`mydf',`sigtail')*mystdp)
(931 missing values generated)

. 
. gen ub=exp(ub_log)
(931 missing values generated)

. gen lb=exp(lb_log)
(931 missing values generated)

. 
. 
. graph twoway (bar mypred1 mycount if mycount==1, barw(.6) base(0) ytick(100(100)1000) ylabel(0(1
> 00)1000)) ///
>               (bar mypred1 mycount if mycount==2, barw(.6) base(0) ytick(100(100)1000) ylabel(0(
> 100)1000)) ///
>                (bar mypred1 mycount if mycount==3, barw(.6) base(0) ytick(100(100)1000) ylabel(0
> (100)1000)) ///
>                 (bar mypred1 mycount if mycount==4, barw(.6) base(0) ytick(100(100)1000) ylabel(
> 0(100)1000)) ///
>                     (rcap ub lb mycount in 1/`no_predict'), ///
>                         xlabel(1 "Urban, Non-South" 2 "Urban, South" 3 "Non-Urban, Non-South" 4 
> "Non-Urban, South") ytitle("Predicted Wages")   xtitle("") legend(off)

. 
. /* Clear out prediction variables */    
. drop mypred*

. drop mystdp*

. drop ub*

. drop lb*    

.                                                 
.                                                 
. /* Working with continuous vs. Continuous interactions */
. sum age, detail

                             Age
-------------------------------------------------------------
      Percentiles      Smallest
 1%           28             28
 5%           29             28
10%           29             28       Obs                 935
25%           30             28       Sum of Wgt.         935

50%           33                      Mean           33.08021
                        Largest       Std. Dev.      3.107803
75%           36             38
90%           38             38       Variance       9.658441
95%           38             38       Skewness       .1185453
99%           38             38       Kurtosis       1.743208

. 
. local mymin=r(min)

. local mymax=r(max)

. 
. /*Step through education in 2 year intervals, get predictions across range of age*/
. 
. foreach myeduc of numlist 10(2)16{
  2. 
. estimates restore age_educ
  3.     
. margins, predict(xb) at((mean) _all age=(`mymin'(1)`mymax') educ=`myeduc') post
  4. mat pred_ed`myeduc'=e(b)'
  5. mat li pred_ed`myeduc'
  6. svmat pred_ed`myeduc'
  7. 
. estimates restore age_educ
  8. 
. margins, predict(stdp) at((mean) _all age=(`mymin'(1)`mymax') educ=`myeduc') nose post
  9. mat pred_se_ed`myeduc'=e(b)'
 10. mat li pred_se_ed`myeduc'
 11. svmat pred_se_ed`myeduc'
 12. }
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    6.62505   .0490705   135.01   0.000     6.528736    6.721365
          2  |   6.634058   .0429044   154.62   0.000     6.549847     6.71827
          3  |   6.643066    .037312   178.04   0.000     6.569831    6.716301
          4  |   6.652074   .0325898   204.12   0.000     6.588108     6.71604
          5  |   6.661082   .0291636   228.40   0.000     6.603841    6.718324
          6  |    6.67009    .027522   242.36   0.000     6.616071    6.724109
          7  |   6.679098   .0279806   238.70   0.000     6.624179    6.734018
          8  |   6.688106   .0304448   219.68   0.000      6.62835    6.747862
          9  |   6.697114   .0344873   194.19   0.000     6.629423    6.764805
         10  |   6.706122    .039628   169.23   0.000     6.628341    6.783903
         11  |    6.71513   .0454962   147.60   0.000     6.625831    6.804429
------------------------------------------------------------------------------

pred_ed10[11,1]
               y1
 1._at  6.6250503
 2._at  6.6340583
 3._at  6.6430662
 4._at  6.6520742
 5._at  6.6610822
 6._at  6.6700901
 7._at  6.6790981
 8._at  6.6881061
 9._at   6.697114
10._at   6.706122
11._at    6.71513
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          10
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0490705
          2  |   .0429044
          3  |    .037312
          4  |   .0325898
          5  |   .0291636
          6  |    .027522
          7  |   .0279806
          8  |   .0304448
          9  |   .0344873
         10  |    .039628
         11  |   .0454962
------------------------------------------------------------------------------

pred_se_ed10[11,1]
               y1
 1._at   .0490705
 2._at  .04290443
 3._at  .03731197
 4._at  .03258976
 5._at  .02916363
 6._at  .02752195
 7._at  .02798061
 8._at  .03044483
 9._at  .03448734
10._at  .03962804
11._at  .04549618
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.657003   .0295409   225.35   0.000     6.599021    6.714985
          2  |   6.673414   .0256338   260.34   0.000     6.623101    6.723728
          3  |   6.689826   .0221124   302.54   0.000     6.646425    6.733228
          4  |   6.706238   .0191901   349.46   0.000     6.668572    6.743904
          5  |   6.722649   .0171755   391.41   0.000     6.688938    6.756361
          6  |   6.739061   .0164065   410.76   0.000     6.706859    6.771263
          7  |   6.755473   .0170524   396.16   0.000     6.722003    6.788943
          8  |   6.771884   .0189692   356.99   0.000     6.734652    6.809117
          9  |   6.788296   .0218246   311.04   0.000     6.745459    6.831133
         10  |   6.804708   .0253028   268.93   0.000     6.755044    6.854371
         11  |    6.82112    .029182   233.74   0.000     6.763842    6.878397
------------------------------------------------------------------------------

pred_ed12[11,1]
               y1
 1._at  6.6570028
 2._at  6.6734145
 3._at  6.6898262
 4._at  6.7062378
 5._at  6.7226495
 6._at  6.7390612
 7._at  6.7554728
 8._at  6.7718845
 9._at  6.7882962
10._at  6.8047078
11._at  6.8211195
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          12
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0295409
          2  |   .0256338
          3  |   .0221124
          4  |   .0191901
          5  |   .0171755
          6  |   .0164065
          7  |   .0170524
          8  |   .0189692
          9  |   .0218246
         10  |   .0253028
         11  |    .029182
------------------------------------------------------------------------------

pred_se_ed12[11,1]
               y1
 1._at  .02954087
 2._at  .02563382
 3._at   .0221124
 4._at  .01919011
 5._at  .01717552
 6._at  .01640649
 7._at  .01705237
 8._at  .01896919
 9._at   .0218246
10._at  .02530282
11._at  .02918198
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.688955   .0246462   271.40   0.000     6.640581     6.73733
          2  |   6.712771   .0211711   317.07   0.000     6.671217    6.754325
          3  |   6.736586   .0179984   374.29   0.000     6.701259    6.771913
          4  |   6.760401   .0153172   441.36   0.000     6.730337    6.790466
          5  |   6.784217   .0134253   505.33   0.000     6.757866    6.810568
          6  |   6.808032   .0126811   536.86   0.000     6.783142    6.832922
          7  |   6.831848    .013279   514.49   0.000     6.805784    6.857911
          8  |   6.855663   .0150598   455.23   0.000     6.826104    6.885222
          9  |   6.879478   .0176696   389.34   0.000     6.844797     6.91416
         10  |   6.903294   .0207985   331.91   0.000     6.862471    6.944116
         11  |   6.927109   .0242464   285.70   0.000     6.879519    6.974699
------------------------------------------------------------------------------

pred_ed14[11,1]
               y1
 1._at  6.6889553
 2._at  6.7127707
 3._at  6.7365861
 4._at  6.7604014
 5._at  6.7842168
 6._at  6.8080322
 7._at  6.8318475
 8._at  6.8556629
 9._at  6.8794783
10._at  6.9032937
11._at   6.927109
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          14
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0246462
          2  |   .0211711
          3  |   .0179984
          4  |   .0153172
          5  |   .0134253
          6  |   .0126811
          7  |    .013279
          8  |   .0150598
          9  |   .0176696
         10  |   .0207985
         11  |   .0242464
------------------------------------------------------------------------------

pred_se_ed14[11,1]
               y1
 1._at  .02464618
 2._at  .02117105
 3._at  .01799835
 4._at  .01531718
 5._at  .01342533
 6._at  .01268113
 7._at  .01327896
 8._at  .01505983
 9._at  .01766958
10._at  .02079851
11._at  .02424644
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.720908   .0401526   167.38   0.000     6.642098    6.799718
          2  |   6.752127   .0348447   193.78   0.000     6.683735    6.820519
          3  |   6.783346   .0299521   226.47   0.000     6.724557    6.842135
          4  |   6.814565    .025713   265.02   0.000     6.764096    6.865034
          5  |   6.845784   .0224998   304.26   0.000     6.801622    6.889946
          6  |   6.877003   .0207936   330.73   0.000      6.83619    6.917816
          7  |   6.908222   .0209656   329.50   0.000     6.867072    6.949373
          8  |   6.939441   .0229737   302.06   0.000     6.894349    6.984534
          9  |    6.97066   .0264023   264.02   0.000     6.918839    7.022482
         10  |   7.001879   .0307801   227.48   0.000     6.941465    7.062294
         11  |   7.033099   .0357604   196.67   0.000     6.962909    7.103288
------------------------------------------------------------------------------

pred_ed16[11,1]
               y1
 1._at  6.7209078
 2._at  6.7521269
 3._at   6.783346
 4._at  6.8145651
 5._at  6.8457841
 6._at  6.8770032
 7._at  6.9082223
 8._at  6.9394413
 9._at  6.9706604
10._at  7.0018795
11._at  7.0330986
(results age_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =          28
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

2._at        : hours           =    43.94866 (mean)
               age             =          29
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

3._at        : hours           =    43.94866 (mean)
               age             =          30
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

4._at        : hours           =    43.94866 (mean)
               age             =          31
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

5._at        : hours           =    43.94866 (mean)
               age             =          32
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

6._at        : hours           =    43.94866 (mean)
               age             =          33
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

7._at        : hours           =    43.94866 (mean)
               age             =          34
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

8._at        : hours           =    43.94866 (mean)
               age             =          35
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

9._at        : hours           =    43.94866 (mean)
               age             =          36
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

10._at       : hours           =    43.94866 (mean)
               age             =          37
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

11._at       : hours           =    43.94866 (mean)
               age             =          38
               educ            =          16
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               south           =    .3325554 (mean)
               urban           =    .7246208 (mean)

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0401526
          2  |   .0348447
          3  |   .0299521
          4  |    .025713
          5  |   .0224998
          6  |   .0207936
          7  |   .0209656
          8  |   .0229737
          9  |   .0264023
         10  |   .0307801
         11  |   .0357604
------------------------------------------------------------------------------

pred_se_ed16[11,1]
               y1
 1._at  .04015255
 2._at   .0348447
 3._at  .02995214
 4._at  .02571302
 5._at  .02249978
 6._at  .02079357
 7._at   .0209656
 8._at  .02297372
 9._at  .02640225
10._at  .03078015
11._at  .03576042

. 
. foreach myeduc of numlist 10(2)16{
  2.     gen exp_pred`myeduc'=exp(pred_ed`myeduc'1)
  3.     gen ub`myeduc'=exp(pred_ed`myeduc'+(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  4.     gen lb`myeduc'=exp(pred_ed`myeduc'-(invttail(`mydf',`sigtail')*pred_se_ed`myeduc'1))
  5. }
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)
(924 missing values generated)

. 
. /* Need my at values */
. 
. egen age_levels=fill(`mymin'(1)`mymax')    

. 
. twoway line exp_pred10 exp_pred12 exp_pred14 exp_pred16 age_levels in 1/11, ///
>        legend(order(1 "10 Years" 2 "12 Years" 3 "14 Years" 4 "16 Years"))  ytitle("Wages") xtitl
> e("Age") name(educ_mult)

. 
.            
. /* Plot at different levels with confidence intervals */
. twoway (rarea ub10 lb10 age_levels in 1/11, color(gs14)) ///
>     (rarea ub16 lb16 age_levels in 1/11, color(gs14)) ///
>         (line exp_pred10 age_levels in 1/11, lcolor(blue) ) ///
>             (line lb10 age_levels in 1/11, lcolor(blue) lwidth(thin) lpattern(dash)) ///
>                 (line ub10 age_levels in 1/11, lcolor(blue) lwidth(thin) lpattern(dash)) ///
>                     (line exp_pred16 age_levels in 1/11, lcolor(red) ) ///
>                         (line ub16 age_levels in 1/11, lcolor(red) lwidth(thin) lpattern(dash)) 
> ///
>                             (line lb16 age_levels in 1/11, lcolor(red) lwidth(thin) lpattern(das
> h)) , ///
>                                 legend(order( 3 "Less than HS" 6 "College Grad")) name(educ_ci)

. 
. 
. drop lb* ub* exp_pred* pred* pred_ed* pred_se_ed*

. 
. eststo ten_educ: reg lwage hours age black married iq meduc c.tenure##c.educ 

      Source |       SS       df       MS              Number of obs =     857
-------------+------------------------------           F(  9,   847) =   27.24
       Model |  33.5243055     9  3.72492283           Prob > F      =  0.0000
    Residual |  115.836746   847  .136761211           R-squared     =  0.2245
-------------+------------------------------           Adj R-squared =  0.2162
       Total |  149.361051   856  .174487209           Root MSE      =  .36981

---------------------------------------------------------------------------------
          lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          hours |  -.0059456   .0017729    -3.35   0.001    -.0094254   -.0024658
            age |   .0185637   .0042976     4.32   0.000     .0101285    .0269989
          black |  -.1269117   .0433577    -2.93   0.004    -.2120129   -.0418105
        married |   .1838169   .0412587     4.46   0.000     .1028355    .2647982
             iq |   .0043803   .0010608     4.13   0.000     .0022983    .0064623
          meduc |   .0118471   .0048859     2.42   0.016     .0022572    .0214371
         tenure |   .0056798   .0165314     0.34   0.731    -.0267674    .0381271
           educ |   .0375757   .0115939     3.24   0.001     .0148194    .0603319
                |
c.tenure#c.educ |   .0002596   .0012336     0.21   0.833    -.0021617    .0026809
                |
          _cons |    5.14412   .2228437    23.08   0.000     4.706729     5.58151
---------------------------------------------------------------------------------

.                                                 
. /* Working with continuous vs. Continuous interactions */
. sum educ, detail

                     Years of education
-------------------------------------------------------------
      Percentiles      Smallest
 1%            9              9
 5%           11              9
10%           12              9       Obs                 935
25%           12              9       Sum of Wgt.         935

50%           12                      Mean           13.46845
                        Largest       Std. Dev.      2.196654
75%           16             18
90%           17             18       Variance       4.825288
95%           18             18       Skewness       .5477959
99%           18             18       Kurtosis       2.262651

. 
. local mymin=r(min)

. local mymax=r(max)

. 
. /*Step through tenure in 5 year intervals */
. 
. foreach mytenure of numlist 0(5)20{
  2. 
. estimates restore ten_educ
  3.     
. margins, predict(xb) at((mean) _all educ=(`mymin'(1)`mymax') tenure=`mytenure') post
  4. mat pred_ed`mytenure'=e(b)'
  5. mat li pred_ed`mytenure'
  6. svmat pred_ed`mytenure'
  7. 
. estimates restore ten_educ
  8. 
. margins, predict(stdp) at((mean) _all educ=(`mymin'(1)`mymax') tenure=`mytenure') nose post
  9. mat pred_se_ed`mytenure'=e(b)'
 10. mat li pred_se_ed`mytenure'
 11. svmat pred_se_ed`mytenure'
 12. }
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          18

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.555056    .056583   115.85   0.000     6.443997    6.666116
          2  |   6.592632   .0462318   142.60   0.000      6.50189    6.683374
          3  |   6.630208   .0366328   180.99   0.000     6.558306    6.702109
          4  |   6.667783   .0285549   233.51   0.000     6.611737     6.72383
          5  |   6.705359   .0236145   283.95   0.000     6.659009    6.751709
          6  |   6.742935   .0238484   282.74   0.000     6.696126    6.789744
          7  |    6.78051   .0291322   232.75   0.000      6.72333     6.83769
          8  |   6.818086   .0373827   182.39   0.000     6.744712     6.89146
          9  |   6.855662   .0470647   145.66   0.000     6.763284    6.948039
         10  |   6.893237   .0574591   119.97   0.000     6.780458    7.006016
------------------------------------------------------------------------------

pred_ed0[10,1]
               y1
 1._at  6.5550563
 2._at  6.5926319
 3._at  6.6302076
 4._at  6.6677833
 5._at   6.705359
 6._at  6.7429346
 7._at  6.7805103
 8._at   6.818086
 9._at  6.8556616
10._at  6.8932373
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           0
               educ            =          18

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |    .056583
          2  |   .0462318
          3  |   .0366328
          4  |   .0285549
          5  |   .0236145
          6  |   .0238484
          7  |   .0291322
          8  |   .0373827
          9  |   .0470647
         10  |   .0574591
------------------------------------------------------------------------------

pred_se_ed0[10,1]
               y1
 1._at  .05658295
 2._at  .04623175
 3._at  .03663276
 4._at   .0285549
 5._at   .0236145
 6._at  .02384841
 7._at  .02913224
 8._at  .03738273
 9._at  .04706472
10._at  .05745909
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          18

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.595137   .0377445   174.73   0.000     6.521053    6.669221
          2  |   6.634011   .0307804   215.53   0.000     6.573596    6.694425
          3  |   6.672884   .0242229   275.48   0.000      6.62534    6.720428
          4  |   6.711758   .0185093   362.62   0.000     6.675428    6.748087
          5  |   6.750632   .0146618   460.42   0.000     6.721854    6.779409
          6  |   6.789505   .0142784   475.51   0.000      6.76148     6.81753
          7  |   6.828379   .0175871   388.26   0.000     6.793859    6.862898
          8  |   6.867253   .0230493   297.94   0.000     6.822012    6.912493
          9  |   6.906126   .0294917   234.17   0.000     6.848241    6.964012
         10  |      6.945   .0363976   190.81   0.000      6.87356     7.01644
------------------------------------------------------------------------------

pred_ed5[10,1]
               y1
 1._at   6.595137
 2._at  6.6340107
 3._at  6.6728843
 4._at  6.7117579
 5._at  6.7506316
 6._at  6.7895052
 7._at  6.8283789
 8._at  6.8672525
 9._at  6.9061262
10._at  6.9449998
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =           5
               educ            =          18

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0377445
          2  |   .0307804
          3  |   .0242229
          4  |   .0185093
          5  |   .0146618
          6  |   .0142784
          7  |   .0175871
          8  |   .0230493
          9  |   .0294917
         10  |   .0363976
------------------------------------------------------------------------------

pred_se_ed5[10,1]
               y1
 1._at   .0377445
 2._at   .0307804
 3._at   .0242229
 4._at  .01850929
 5._at   .0146618
 6._at  .01427838
 7._at  .01758708
 8._at  .02304926
 9._at   .0294917
10._at  .03639756
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          18

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.635218   .0368474   180.07   0.000     6.562895    6.707541
          2  |   6.675389   .0300032   222.49   0.000       6.6165    6.734279
          3  |   6.715561   .0236441   284.03   0.000     6.669153    6.761969
          4  |   6.755733   .0182836   369.50   0.000     6.719846    6.791619
          5  |   6.795904   .0150311   452.12   0.000     6.766402    6.825407
          6  |   6.836076   .0152961   446.92   0.000     6.806053    6.866099
          7  |   6.876247   .0189316   363.22   0.000     6.839089    6.913406
          8  |   6.916419   .0244792   282.54   0.000     6.868372    6.964466
          9  |   6.956591   .0309266   224.94   0.000     6.895889    7.017292
         10  |   6.996762   .0378163   185.02   0.000     6.922538    7.070987
------------------------------------------------------------------------------

pred_ed10[10,1]
               y1
 1._at  6.6352178
 2._at  6.6753894
 3._at   6.715561
 4._at  6.7557326
 5._at  6.7959042
 6._at  6.8360758
 7._at  6.8762474
 8._at   6.916419
 9._at  6.9565907
10._at  6.9967623
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          10
               educ            =          18

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0368474
          2  |   .0300032
          3  |   .0236441
          4  |   .0182836
          5  |   .0150311
          6  |   .0152961
          7  |   .0189316
          8  |   .0244792
          9  |   .0309266
         10  |   .0378163
------------------------------------------------------------------------------

pred_se_ed10[10,1]
               y1
 1._at  .03684742
 2._at  .03000316
 3._at  .02364407
 4._at  .01828359
 5._at  .01503106
 6._at   .0152961
 7._at  .01893156
 8._at  .02447922
 9._at  .03092662
10._at  .03781633
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          18

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.675299   .0547803   121.86   0.000     6.567777     6.78282
          2  |   6.716768   .0446726   150.36   0.000     6.629086     6.80445
          3  |   6.758238   .0354801   190.48   0.000     6.688598    6.827877
          4  |   6.799707   .0281153   241.85   0.000     6.744523    6.854891
          5  |   6.841177    .024301   281.52   0.000      6.79348    6.888874
          6  |   6.882646   .0256718   268.10   0.000     6.832259    6.933034
          7  |   6.924116   .0315592   219.40   0.000     6.862173    6.986059
          8  |   6.965586    .040017   174.07   0.000     6.887041     7.04413
          9  |   7.007055   .0497511   140.84   0.000     6.909405    7.104705
         10  |   7.048525    .060145   117.19   0.000     6.930474    7.166576
------------------------------------------------------------------------------

pred_ed15[10,1]
               y1
 1._at  6.6752985
 2._at  6.7167681
 3._at  6.7582377
 4._at  6.7997073
 5._at  6.8411769
 6._at  6.8826464
 7._at   6.924116
 8._at  6.9655856
 9._at  7.0070552
10._at  7.0485247
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          15
               educ            =          18

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0547803
          2  |   .0446726
          3  |   .0354801
          4  |   .0281153
          5  |    .024301
          6  |   .0256718
          7  |   .0315592
          8  |    .040017
          9  |   .0497511
         10  |    .060145
------------------------------------------------------------------------------

pred_se_ed15[10,1]
               y1
 1._at  .05478035
 2._at  .04467264
 3._at  .03548012
 4._at   .0281153
 5._at  .02430098
 6._at  .02567181
 7._at   .0315592
 8._at    .040017
 9._at  .04975113
10._at  .06014504
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857
Model VCE    : OLS

Expression   : Linear prediction, predict(xb)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          18

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   6.715379   .0797127    84.24   0.000     6.558922    6.871837
          2  |   6.758147   .0650676   103.86   0.000     6.630434     6.88586
          3  |   6.800914    .051828   131.22   0.000     6.699188    6.902641
          4  |   6.843682   .0413659   165.44   0.000      6.76249    6.924874
          5  |   6.886449   .0361771   190.35   0.000     6.815442    6.957457
          6  |   6.929217   .0384589   180.17   0.000     6.853731    7.004703
          7  |   6.971985   .0471385   147.90   0.000     6.879463    7.064507
          8  |   7.014752   .0594782   117.94   0.000      6.89801    7.131494
          9  |    7.05752   .0736608    95.81   0.000     6.912941    7.202099
         10  |   7.100287   .0888078    79.95   0.000     6.925978    7.274596
------------------------------------------------------------------------------

pred_ed20[10,1]
               y1
 1._at  6.7153793
 2._at  6.7581468
 3._at  6.8009144
 4._at  6.8436819
 5._at  6.8864495
 6._at   6.929217
 7._at  6.9719846
 8._at  7.0147521
 9._at  7.0575197
10._at  7.1002872
(results ten_educ are active now)

Adjusted predictions                              Number of obs   =        857

Expression   : S.E. of the prediction, predict(stdp)

1._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =           9

2._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          10

3._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          11

4._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          12

5._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          13

6._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          14

7._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          15

8._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          16

9._at        : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          17

10._at       : hours           =    43.94866 (mean)
               age             =     32.9755 (mean)
               black           =    .1155193 (mean)
               married         =    .8926488 (mean)
               iq              =    101.8028 (mean)
               meduc           =    10.68261 (mean)
               tenure          =          20
               educ            =          18

------------------------------------------------------------------------------
             |     Margin
-------------+----------------------------------------------------------------
         _at |
          1  |   .0797127
          2  |   .0650676
          3  |    .051828
          4  |   .0413659
          5  |   .0361771
          6  |   .0384589
          7  |   .0471385
          8  |   .0594782
          9  |   .0736608
         10  |   .0888078
------------------------------------------------------------------------------

pred_se_ed20[10,1]
               y1
 1._at  .07971267
 2._at  .06506764
 3._at  .05182797
 4._at  .04136586
 5._at  .03617711
 6._at  .03845888
 7._at  .04713854
 8._at  .05947817
 9._at  .07366082
10._at  .08880785

. 
. foreach mytenure of numlist 0(5)20{
  2.     gen exp_pred`mytenure'=exp(pred_ed`mytenure'1)
  3.     gen ub`mytenure'=exp(pred_ed`mytenure'+(invttail(`mydf',`sigtail')*pred_se_ed`mytenure'1)
> )
  4.     gen lb`mytenure'=exp(pred_ed`mytenure'-(invttail(`mydf',`sigtail')*pred_se_ed`mytenure'1)
> )
  5. }
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)
(925 missing values generated)

. 
. /* Need my at values */
. 
. egen educ_levels=fill(`mymin'(1)`mymax')    

. 
. twoway line exp_pred0 exp_pred5 exp_pred10 exp_pred15 exp_pred15 educ_levels in 1/20, ///
>        legend(order(1 "0 Years" 2 "5 Years" 3 "10 Years" 4 "15 Years" 5 "20 Years"))  ytitle("Wa
> ges") xtitle("Education") name(tenure_mult)

. exit 

end of do-file


. exit, clear
