---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/panel.log
  log type:  text
 opened on:  11 Apr 2017, 16:11:17

.     
. /* Panel data */
. /* Working with panel datasets, xt commands*/
. /* Will Doyle */
. /* 170411 */
. /* Practicum Folder */
. 
. clear

. clear mata /* Clears any fluff that might be in mata */

. estimates clear /* Clears any estimates hanging around */

. set more off /*Get rid of annoying "more" feature */ 

. 
. graph drop _all

. 
. use diss, clear
(Written by R.              )

. 
. order state year

. sort state year

. 
. li if _n <10

     +-----------------------------------------------------------------------------------------------------------------+
  1. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1984 | 19753.82 | 12.06921 | 73539.69 | 31.08308 |  28.5234 | 4.554178 | 6158.481 | 70579.71 | 76966.31 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |              38.5          |          28.21498          |          gball          |          1395.343           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  2. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1985 |  25937.5 | 11.64328 | 75224.55 | 31.27586 | 26.46807 | 4.575117 | 5480.974 | 66418.59 |  74319.7 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          38.41667          |          27.87713          |          gball          |          1347.362           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  3. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1986 | 20161.46 | 11.39143 | 52050.73 | 29.94336 | 23.32024 | 5.302693 | 5183.568 | 62766.85 | 71139.42 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |             49.75          |          37.79125          |          gball          |          1306.067           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  4. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1987 | 16157.03 | 11.12533 | 59892.73 | 28.35402 | 23.42419 | 4.918142 | 2887.904 | 69083.27 | 68634.51 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          34.42857          |          38.51671          |          gball          |          1559.095           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  5. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1988 |  13370.6 | 10.70142 | 55485.95 | 27.99957 | 18.43513 |  8.24132 | 3250.582 |  66537.2 | 31179.41 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          40.94643          |          45.02991          |          gball          |          1531.616           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  6. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1989 | 13292.23 | 10.60019 | 56314.31 | 28.92177 | 17.21723 | 8.796088 | 3462.247 | 65042.52 | 29746.16 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          31.73214          |          37.47217          |          gball          |           1690.88           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  7. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1990 | 12531.32 | 10.12164 | 57074.58 | 28.95049 | 31.97714 | 7.617863 |  3561.69 | 65694.19 |  28221.3 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          29.28572          |          33.83577          |          gball          |          1755.956           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  8. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1991 | 11423.46 |  9.81387 | 47240.34 | 28.41009 | 29.89455 | 6.569116 | 3874.305 | 60818.79 | 27081.67 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          33.01786          |          39.80915          |          gball          |          1850.204           |
     +-----------------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------------+
  9. | state | year | approp~i | perc1824 |  gsppc_i | incpcp_i | ttld_ft_ | percpriv | taxcpc_i | income_i | legcom~i |
     |    AK | 1992 | 10545.08 | 9.858748 | 45123.37 |  28.3155 |  29.9786 | 6.798592 | 3206.962 | 58095.07 | 28513.18 |
     |-----------------------------------------------------------------------------------------------------------------|
     |           legideo          |           citideo          |          board          |          pub4tu~i           |
     |          34.57143          |          39.62203          |          gball          |          2012.586           |
     +-----------------------------------------------------------------------------------------------------------------+

.         *bysort year: gen x1 = _n
. di _N
800

.         *bysort year: gen x2 = _N
. *other underscore commands?
. 
. /* Reshaping, long to wide and back again */
. 
. reshape wide approps_i perc1824 gsppc_i incpcp_i ttld_ft_ percpriv taxcpc_i income_i legcomp_i legideo citideo board pub4
> tuit_i, i(state)   j(year)
(note: j = 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      800   ->      50
Number of variables                  15   ->     209
j variable (16 values)             year   ->   (dropped)
xij variables:
                              approps_i   ->   approps_i1984 approps_i1985 ... approps_i1999
                               perc1824   ->   perc18241984 perc18241985 ... perc18241999
                                gsppc_i   ->   gsppc_i1984 gsppc_i1985 ... gsppc_i1999
                               incpcp_i   ->   incpcp_i1984 incpcp_i1985 ... incpcp_i1999
                               ttld_ft_   ->   ttld_ft_1984 ttld_ft_1985 ... ttld_ft_1999
                               percpriv   ->   percpriv1984 percpriv1985 ... percpriv1999
                               taxcpc_i   ->   taxcpc_i1984 taxcpc_i1985 ... taxcpc_i1999
                               income_i   ->   income_i1984 income_i1985 ... income_i1999
                              legcomp_i   ->   legcomp_i1984 legcomp_i1985 ... legcomp_i1999
                                legideo   ->   legideo1984 legideo1985 ... legideo1999
                                citideo   ->   citideo1984 citideo1985 ... citideo1999
                                  board   ->   board1984 board1985 ... board1999
                             pub4tuit_i   ->   pub4tuit_i1984 pub4tuit_i1985 ... pub4tuit_i1999
-----------------------------------------------------------------------------

. 
. reshape long approps_i perc1824 gsppc_i incpcp_i ttld_ft_ percpriv taxcpc_i income_i legcomp_i legideo citideo board pub4
> tuit_i, i(state)   j(year) 
(note: j = 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       50   ->     800
Number of variables                 209   ->      15
j variable (16 values)                    ->   year
xij variables:
approps_i1984 approps_i1985 ... approps_i1999->approps_i
perc18241984 perc18241985 ... perc18241999->   perc1824
gsppc_i1984 gsppc_i1985 ... gsppc_i1999   ->   gsppc_i
incpcp_i1984 incpcp_i1985 ... incpcp_i1999->   incpcp_i
ttld_ft_1984 ttld_ft_1985 ... ttld_ft_1999->   ttld_ft_
percpriv1984 percpriv1985 ... percpriv1999->   percpriv
taxcpc_i1984 taxcpc_i1985 ... taxcpc_i1999->   taxcpc_i
income_i1984 income_i1985 ... income_i1999->   income_i
legcomp_i1984 legcomp_i1985 ... legcomp_i1999->legcomp_i
legideo1984 legideo1985 ... legideo1999   ->   legideo
citideo1984 citideo1985 ... citideo1999   ->   citideo
      board1984 board1985 ... board1999   ->   board
pub4tuit_i1984 pub4tuit_i1985 ... pub4tuit_i1999->pub4tuit_i
-----------------------------------------------------------------------------

. 
. drop if state == 1 /* The Alaska problem */
(16 observations deleted)

.     
. /* Set up data as panel data */
. xtset state year, yearly
       panel variable:  state (strongly balanced)
        time variable:  year, 1984 to 1999
                delta:  1 year

. 
. 
. // help tsvarlist
. 
. // what is the correlation between appropriations in the current year and appropriations in the prior year?
. 
. corr approps_i L.approps_i
(obs=735)

             |                 L.
             | approp~i approp~i
-------------+------------------
   approps_i |
         --. |   1.0000
         L1. |   0.9326   1.0000


. 
. // what is the correlation between appropriations in the current year and appropriations two years ago?
. 
. corr approps_i L2.approps_i
(obs=686)

             |                L2.
             | approp~i approp~i
-------------+------------------
   approps_i |
         --. |   1.0000
         L2. |   0.8962   1.0000


. 
. // what is the average year-to-year difference in public 4-year tuition during the 1990's?
. 
. sum D.pub4tuit_i if year>=1990 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  pub4tuit_i |
         D1. |       489     98.0542    151.8189  -556.7407   1272.844

. 
. sum approps_i L.F.approps_i

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   approps_i |       784    5106.147    1341.746   643.8942   10140.69
   approps_i |       784    5106.147    1341.746   643.8942   10140.69

. 
. /* Some plots */
. // xtline approps_i
. 
. // graph export app_line.pdf, replace
. 
. // xtline pub4tuit_i
. 
. // graph export tuit_line.pdf, replace
. 
. egen pub4_med= median(pub4tuit_i), by(state)

. 
. sort pub4_med

. 
. #delimit ;
delimiter now ;
. graph hbox pub4tuit_i,
> over(state, sort(1) descending label(labsize(tiny) )) name(tuit) /*This was a giant pain*/
> ;

. graph export tuit_box.pdf, replace;
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/tuit_box.pdf written in PDF format)

. #delimit ;
delimiter now ;
. graph hbox approps,
> over(state, sort(1) descending label(labsize(tiny) ))  name(approps)
> ;

. #delimit ;
delimiter now ;
. graph hbox approps,
> over(year, sort(1) descending label(labsize(tiny) )) name(approps_2)
> ;

. graph export approps_box.pdf, replace;
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/approps_box.pdf written in PDF format)

.  #delimit cr
delimiter now cr
. 
. 
. /*Ordinary Least Squares */  
. 
. local y approps_i

. 
. local controls perc1824 incpcp_i percpriv taxcpc_i  legcomp_i i.board 

. 
. reg `y'  legideo `controls'

      Source |       SS       df       MS              Number of obs =     784
-------------+------------------------------           F( 10,   773) =  111.00
       Model |   830964034    10  83096403.4           Prob > F      =  0.0000
    Residual |   578657976   773   748587.29           R-squared     =  0.5895
-------------+------------------------------           Adj R-squared =  0.5842
       Total |  1.4096e+09   783  1800283.54           Root MSE      =  865.21

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   1.954075   1.373991     1.42   0.155    -.7431209    4.651272
    perc1824 |   267.1039   29.04555     9.20   0.000     210.0865    324.1214
    incpcp_i |  -12.65837   12.94071    -0.98   0.328    -38.06147    12.74473
    percpriv |  -57.78148   2.810894   -20.56   0.000    -63.29937   -52.26359
    taxcpc_i |   1.939732   .1145756    16.93   0.000     1.714816    2.164649
   legcomp_i |  -.0008065   .0020159    -0.40   0.689    -.0047638    .0031508
             |
       board |
     cbweak  |   110.3047   100.8765     1.09   0.275    -87.71972    308.3291
      gball  |  -28.19471   94.82565    -0.30   0.766     -214.341    157.9516
     gbfour  |   -29.0085   87.02584    -0.33   0.739    -199.8435    141.8265
       plan  |  -1538.795   143.7325   -10.71   0.000    -1820.947   -1256.643
             |
       _cons |   944.5651   466.3937     2.03   0.043     29.01674    1860.113
------------------------------------------------------------------------------

. 
. predict e, resid

. 
. graph box e, over(state, sort(1) descending label(labsize(tiny))) name(unit_error) /*Horrible*/

. 
. graph export resid_state.pdf, replace
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/resid_state.pdf written in PDF format)

. 
. graph box e, over(year, sort(1) descending label(labsize(tiny))) name(time_error)/* Not too bad */

. 
. graph export resid_year.pdf, replace
(file /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/resid_year.pdf written in PDF format)

. 
. 
. /* Fixed Effects for Units (states) */
. 
. xtreg `y'  legideo `controls', fe
note: 5.board omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       784
Group variable: state                           Number of groups   =        49

R-sq:  within  = 0.2281                         Obs per group: min =        16
       between = 0.0860                                        avg =      16.0
       overall = 0.1015                                        max =        16

                                                F(9,726)           =     23.83
corr(u_i, Xb)  = -0.2562                        Prob > F           =    0.0000

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   3.508206   1.188178     2.95   0.003     1.175531    5.840881
    perc1824 |   269.2799   24.15645    11.15   0.000     221.8551    316.7048
    incpcp_i |   12.85631   20.06298     0.64   0.522    -26.53207    52.24468
    percpriv |  -3.949699   10.39503    -0.38   0.704    -24.35761    16.45821
    taxcpc_i |   1.436178   .1566408     9.17   0.000     1.128655    1.743701
   legcomp_i |   .0022197    .001997     1.11   0.267    -.0017009    .0061402
             |
       board |
     cbweak  |  -41.50431   108.1897    -0.38   0.701    -253.9063    170.8977
      gball  |  -597.6449   204.1981    -2.93   0.004    -998.5342   -196.7557
     gbfour  |  -942.1278   183.3558    -5.14   0.000    -1302.099   -582.1569
       plan  |          0  (omitted)
             |
       _cons |  -38.59943   659.1182    -0.06   0.953    -1332.605    1255.406
-------------+----------------------------------------------------------------
     sigma_u |  1232.7514
     sigma_e |  492.51715
         rho |  .86235025   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(48, 726) =    41.94             Prob > F = 0.0000

. 
. estimates store fe1

. 
. reg `y' legideo `controls' i.state
note: 46.state omitted because of collinearity

      Source |       SS       df       MS              Number of obs =     784
-------------+------------------------------           F( 57,   726) =   89.21
       Model |  1.2335e+09    57  21640594.9           Prob > F      =  0.0000
    Residual |   176108102   726  242573.144           R-squared     =  0.8751
-------------+------------------------------           Adj R-squared =  0.8653
       Total |  1.4096e+09   783  1800283.54           Root MSE      =  492.52

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   3.508206   1.188178     2.95   0.003     1.175531    5.840881
    perc1824 |   269.2799   24.15645    11.15   0.000     221.8551    316.7048
    incpcp_i |   12.85631   20.06298     0.64   0.522    -26.53207    52.24468
    percpriv |  -3.949699   10.39503    -0.38   0.704    -24.35761    16.45821
    taxcpc_i |   1.436178   .1566408     9.17   0.000     1.128655    1.743701
   legcomp_i |   .0022197    .001997     1.11   0.267    -.0017009    .0061402
             |
       board |
     cbweak  |  -41.50431   108.1897    -0.38   0.701    -253.9063    170.8977
      gball  |  -597.6449   204.1981    -2.93   0.004    -998.5342   -196.7557
     gbfour  |  -942.1278   183.3558    -5.14   0.000    -1302.099   -582.1569
       plan  |   -3989.46   380.1414   -10.49   0.000    -4735.767   -3243.152
             |
       state |
         AR  |   276.3964   184.0882     1.50   0.134    -85.01223    637.8051
         AZ  |  -933.8803   259.3431    -3.60   0.000    -1443.032   -424.7282
         CA  |  -1411.393   269.3331    -5.24   0.000    -1940.157    -882.628
         CO  |  -1816.209   207.3388    -8.76   0.000    -2223.264   -1409.154
         CT  |  -1861.488   393.4888    -4.73   0.000        -2634   -1088.976
         DE  |   1331.884   377.6382     3.53   0.000     590.4912    2073.278
         FL  |    467.329   282.6797     1.65   0.099    -87.63815    1022.296
         GA  |   194.9863   300.6685     0.65   0.517    -395.2971    785.2698
         HI  |    1240.45   328.2148     3.78   0.000     596.0868    1884.813
         IA  |  -144.1136   301.7942    -0.48   0.633    -736.6072      448.38
         ID  |  -205.9452   284.4838    -0.72   0.469    -764.4542    352.5639
         IL  |  -1783.663   277.1406    -6.44   0.000    -2327.755    -1239.57
         IN  |  -1363.602   221.8388    -6.15   0.000    -1799.124   -928.0798
         KS  |  -376.2822    252.916    -1.49   0.137    -872.8163    120.2518
         KY  |  -874.4442   219.3189    -3.99   0.000    -1305.019   -443.8693
         LA  |  -1520.363   178.4794    -8.52   0.000     -1870.76   -1169.965
         MA  |  -4062.166   549.3788    -7.39   0.000    -5140.726   -2983.605
         MD  |  -970.0364   242.1703    -4.01   0.000    -1445.474   -494.5986
         ME  |  -843.0102   332.2508    -2.54   0.011    -1495.297   -190.7231
         MI  |   2112.838   363.4989     5.81   0.000     1399.203    2826.472
         MN  |   -729.271   267.6883    -2.72   0.007    -1254.807   -203.7355
         MO  |   -2054.87   292.4484    -7.03   0.000    -2629.016   -1480.725
         MS  |   684.6067     261.75     2.62   0.009     170.7294    1198.484
         MT  |   -1410.95    196.211    -7.19   0.000    -1796.159   -1025.741
         NC  |   1433.099   266.2147     5.38   0.000     910.4563    1955.742
         ND  |  -872.4157   275.0053    -3.17   0.002    -1412.316   -332.5152
         NE  |  -935.1519    205.951    -4.54   0.000    -1339.482   -530.8213
         NH  |  -2208.515   466.7628    -4.73   0.000    -3124.881   -1292.149
         NJ  |  -145.0329    269.189    -0.54   0.590    -673.5148    383.4489
         NM  |   302.1105    243.245     1.24   0.215    -175.4371    779.6581
         NV  |   412.1262     306.44     1.34   0.179    -189.4882    1013.741
         NY  |  -2395.727   429.5776    -5.58   0.000     -3239.09   -1552.364
         OH  |  -1719.576   242.5297    -7.09   0.000    -2195.719   -1243.432
         OK  |  -1448.657   187.7791    -7.71   0.000    -1817.312   -1080.002
         OR  |  -1255.809   187.2421    -6.71   0.000     -1623.41   -888.2084
         PA  |  -2409.755   404.5793    -5.96   0.000     -3204.04    -1615.47
         RI  |  -3094.107   502.0847    -6.16   0.000    -4079.818   -2108.396
         SC  |  -178.5121   205.6287    -0.87   0.386    -582.2098    225.1857
         SD  |  -800.3775   287.0668    -2.79   0.005    -1363.958   -236.7974
         TN  |  -648.4198   239.2871    -2.71   0.007    -1118.197   -178.6426
         TX  |   -685.685   186.1197    -3.68   0.000    -1051.082    -320.288
         UT  |  -1609.813   330.0932    -4.88   0.000    -2257.864   -961.7619
         VA  |  -1355.092   224.6543    -6.03   0.000    -1796.141   -914.0421
         VT  |          0  (omitted)
         WA  |  -1613.243   204.9033    -7.87   0.000    -2015.516   -1210.969
         WI  |  -1282.554   271.5905    -4.72   0.000     -1815.75   -749.3572
         WV  |   -318.971   248.7797    -1.28   0.200    -807.3845    169.4425
         WY  |   1831.606   278.4658     6.58   0.000     1284.912    2378.301
             |
       _cons |   961.8097   599.0746     1.61   0.109    -214.3156    2137.935
------------------------------------------------------------------------------

. 
. 
. /* Fixed Effects for Units and Time (state and year) */
. 
.  xtreg `y' legideo  `controls'  i.year , fe
note: 5.board omitted because of collinearity

Fixed-effects (within) regression               Number of obs      =       784
Group variable: state                           Number of groups   =        49

R-sq:  within  = 0.3942                         Obs per group: min =        16
       between = 0.0321                                        avg =      16.0
       overall = 0.0576                                        max =        16

                                                F(24,711)          =     19.27
corr(u_i, Xb)  = -0.4822                        Prob > F           =    0.0000

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   1.145978   1.140491     1.00   0.315    -1.093154    3.385111
    perc1824 |   44.91926   30.75181     1.46   0.145    -15.45595    105.2945
    incpcp_i |   139.2413   28.45662     4.89   0.000     83.37225    195.1104
    percpriv |  -3.777036   10.16795    -0.37   0.710    -23.73984    16.18577
    taxcpc_i |   1.501035   .1425019    10.53   0.000      1.22126     1.78081
   legcomp_i |   .0016732   .0018213     0.92   0.359    -.0019025     .005249
             |
       board |
     cbweak  |  -24.88159   97.00964    -0.26   0.798    -215.3412     165.578
      gball  |  -454.4452   183.9582    -2.47   0.014    -815.6115   -93.27897
     gbfour  |  -711.7997   165.6897    -4.30   0.000    -1037.099   -386.5002
       plan  |          0  (omitted)
             |
        year |
       1985  |   220.3299   90.99408     2.42   0.016     41.68063    398.9791
       1986  |   113.4229     97.881     1.16   0.247    -78.74752    305.5932
       1987  |  -19.38342   105.0826    -0.18   0.854    -225.6928     186.926
       1988  |  -67.57019   113.1309    -0.60   0.551    -289.6807    154.5403
       1989  |  -274.3213   122.1241    -2.25   0.025    -514.0883   -34.55431
       1990  |  -399.1526   125.7373    -3.17   0.002    -646.0135   -152.2917
       1991  |  -657.3481   125.0003    -5.26   0.000    -902.7619   -411.9343
       1992  |  -678.0808   134.1735    -5.05   0.000    -941.5044   -414.6571
       1993  |   -936.106   136.6561    -6.85   0.000    -1204.404   -667.8083
       1994  |  -968.5213   145.4102    -6.66   0.000    -1254.006   -683.0365
       1995  |  -1031.559   153.3461    -6.73   0.000    -1332.624   -730.4935
       1996  |  -1044.886   162.4511    -6.43   0.000    -1363.827   -725.9445
       1997  |  -1058.236   171.5086    -6.17   0.000     -1394.96   -721.5123
       1998  |  -1197.384   189.6214    -6.31   0.000    -1569.669   -825.0989
       1999  |  -1194.228   195.1562    -6.12   0.000    -1577.379   -811.0763
             |
       _cons |  -163.0829   776.2306    -0.21   0.834    -1687.061    1360.895
-------------+----------------------------------------------------------------
     sigma_u |   1421.003
     sigma_e |  440.90254
         rho |  .91218326   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(48, 711) =    52.77             Prob > F = 0.0000

. 
.  reg `y' legideo `controls' i.state i.year
note: 46.state omitted because of collinearity

      Source |       SS       df       MS              Number of obs =     784
-------------+------------------------------           F( 72,   711) =   90.84
       Model |  1.2714e+09    72  17658432.4           Prob > F      =  0.0000
    Residual |   138214880   711  194395.049           R-squared     =  0.9019
-------------+------------------------------           Adj R-squared =  0.8920
       Total |  1.4096e+09   783  1800283.54           Root MSE      =   440.9

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   1.145978   1.140491     1.00   0.315    -1.093154    3.385111
    perc1824 |   44.91926   30.75181     1.46   0.145    -15.45595    105.2945
    incpcp_i |   139.2413   28.45662     4.89   0.000     83.37225    195.1104
    percpriv |  -3.777036   10.16795    -0.37   0.710    -23.73984    16.18577
    taxcpc_i |   1.501035   .1425019    10.53   0.000      1.22126     1.78081
   legcomp_i |   .0016732   .0018213     0.92   0.359    -.0019025     .005249
             |
       board |
     cbweak  |  -24.88159   97.00964    -0.26   0.798    -215.3412     165.578
      gball  |  -454.4452   183.9582    -2.47   0.014    -815.6115   -93.27897
     gbfour  |  -711.7997   165.6897    -4.30   0.000    -1037.099   -386.5002
       plan  |  -4414.536   381.3193   -11.58   0.000    -5163.183    -3665.89
             |
       state |
         AR  |   220.2078   166.1736     1.33   0.186    -106.0418    546.4575
         AZ  |  -1496.756   239.6941    -6.24   0.000    -1967.349   -1026.163
         CA  |  -2350.401   296.6171    -7.92   0.000    -2932.751   -1768.051
         CO  |  -2713.919   231.7994   -11.71   0.000    -3169.013   -2258.826
         CT  |  -3816.437   515.0621    -7.41   0.000    -4827.662   -2805.213
         DE  |   797.4843   352.0069     2.27   0.024      106.387    1488.582
         FL  |  -733.7339   295.2001    -2.49   0.013    -1313.302   -154.1656
         GA  |  -260.8271   290.6157    -0.90   0.370    -831.3947    309.7404
         HI  |   226.9197   345.8506     0.66   0.512     -452.091    905.9304
         IA  |  -886.2184   296.1617    -2.99   0.003    -1467.674   -304.7623
         ID  |  -471.0367   261.2894    -1.80   0.072    -984.0277    41.95435
         IL  |  -2759.462   316.9144    -8.71   0.000    -3381.662   -2137.262
         IN  |  -1750.722   220.9685    -7.92   0.000    -2184.551   -1316.893
         KS  |  -1229.311   245.7182    -5.00   0.000    -1711.731   -746.8908
         KY  |  -849.1865   198.5304    -4.28   0.000    -1238.962   -459.4105
         LA  |  -1411.357   160.2947    -8.80   0.000    -1726.065    -1096.65
         MA  |  -5324.105   607.7828    -8.76   0.000    -6517.368   -4130.841
         MD  |  -2243.625   299.4675    -7.49   0.000    -2831.571   -1655.679
         ME  |  -1351.977   317.5386    -4.26   0.000    -1975.403   -728.5515
         MI  |   1870.524   341.4901     5.48   0.000     1200.074    2540.974
         MN  |  -1737.374   294.3878    -5.90   0.000    -2315.347   -1159.401
         MO  |  -2640.304   297.5808    -8.87   0.000    -3224.546   -2056.062
         MS  |   976.2368   244.1678     4.00   0.000     496.8606    1455.613
         MT  |  -1754.085   179.1855    -9.79   0.000    -2105.881   -1402.289
         NC  |   907.0247   252.7312     3.59   0.000      410.836    1403.213
         ND  |  -1043.422   247.3218    -4.22   0.000    -1528.991   -557.8539
         NE  |  -1575.906    210.761    -7.48   0.000    -1989.695   -1162.118
         NH  |  -3487.277   488.2969    -7.14   0.000    -4445.954   -2528.601
         NJ  |  -1790.374   363.1741    -4.93   0.000    -2503.396   -1077.353
         NM  |   281.4606    222.125     1.27   0.206    -154.6387    717.5599
         NV  |  -856.4496   314.7057    -2.72   0.007    -1474.313    -238.586
         NY  |  -3730.427   489.6773    -7.62   0.000    -4691.814   -2769.041
         OH  |  -2355.119   253.5934    -9.29   0.000        -2853   -1857.237
         OK  |  -1667.052   171.0197    -9.75   0.000    -2002.816   -1331.288
         OR  |  -1946.544   191.3764   -10.17   0.000    -2322.275   -1570.814
         PA  |  -3249.377   420.3737    -7.73   0.000    -4074.699   -2424.054
         RI  |  -3880.886   515.7906    -7.52   0.000    -4893.541   -2868.232
         SC  |  -118.2189   187.5478    -0.63   0.529    -486.4328    249.9949
         SD  |  -1219.727   265.9126    -4.59   0.000    -1741.795   -697.6593
         TN  |  -921.1278   229.3865    -4.02   0.000    -1371.484   -470.7719
         TX  |  -1024.036    178.126    -5.75   0.000    -1373.752   -674.3205
         UT  |  -1513.079    312.037    -4.85   0.000    -2125.703   -900.4543
         VA  |  -1987.449   245.1084    -8.11   0.000    -2468.672   -1506.226
         VT  |          0  (omitted)
         WA  |  -2490.384   225.8296   -11.03   0.000    -2933.757   -2047.012
         WI  |  -2039.508   263.1032    -7.75   0.000    -2556.061   -1522.956
         WV  |  -471.9215   224.7202    -2.10   0.036     -913.116   -30.72687
         WY  |   976.0974   262.8169     3.71   0.000     460.1074    1492.087
             |
        year |
       1985  |   220.3299   90.99408     2.42   0.016     41.68063    398.9791
       1986  |   113.4229     97.881     1.16   0.247    -78.74752    305.5932
       1987  |  -19.38342   105.0826    -0.18   0.854    -225.6928     186.926
       1988  |  -67.57019   113.1309    -0.60   0.551    -289.6807    154.5403
       1989  |  -274.3213   122.1241    -2.25   0.025    -514.0883   -34.55431
       1990  |  -399.1526   125.7373    -3.17   0.002    -646.0135   -152.2917
       1991  |  -657.3481   125.0003    -5.26   0.000    -902.7619   -411.9343
       1992  |  -678.0808   134.1735    -5.05   0.000    -941.5044   -414.6571
       1993  |   -936.106   136.6561    -6.85   0.000    -1204.404   -667.8083
       1994  |  -968.5213   145.4102    -6.66   0.000    -1254.006   -683.0365
       1995  |  -1031.559   153.3461    -6.73   0.000    -1332.624   -730.4935
       1996  |  -1044.886   162.4511    -6.43   0.000    -1363.827   -725.9445
       1997  |  -1058.236   171.5086    -6.17   0.000     -1394.96   -721.5123
       1998  |  -1197.384   189.6214    -6.31   0.000    -1569.669   -825.0989
       1999  |  -1194.228   195.1562    -6.12   0.000    -1577.379   -811.0763
             |
       _cons |   1472.362   678.9079     2.17   0.030     139.4574    2805.266
------------------------------------------------------------------------------

. 
.  
. /* Fixed effects with AR1 error terms */
. 
.  xtregar `y' legideo `controls', fe rhotype (tsc) twostep lbi

FE (within) regression with AR(1) disturbances  Number of obs      =       735
Group variable: state                           Number of groups   =        49

R-sq:  within  = 0.1475                         Obs per group: min =        15
       between = 0.0584                                        avg =      15.0
       overall = 0.0235                                        max =        15

                                                F(9,677)           =     13.02
corr(u_i, Xb)  = -0.6379                        Prob > F           =    0.0000

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   2.203477   1.328746     1.66   0.098    -.4054819    4.812437
    perc1824 |   308.6154   33.12758     9.32   0.000     243.5702    373.6605
    incpcp_i |   16.72646   23.96317     0.70   0.485    -30.32461    63.77753
    percpriv |   39.45439   12.99704     3.04   0.002     13.93505    64.97374
    taxcpc_i |   .9035681   .1776652     5.09   0.000     .5547272    1.252409
   legcomp_i |   .0015629   .0019213     0.81   0.416    -.0022095    .0053352
             |
       board |
     cbweak  |  -88.92507   136.4487    -0.65   0.515    -356.8385    178.9884
      gball  |  -444.8078   257.5141    -1.73   0.085    -950.4301     60.8145
     gbfour  |  -797.8778   234.5891    -3.40   0.001    -1258.488    -337.268
       plan  |          0  (omitted)
             |
       _cons |  -630.4428   486.6708    -1.30   0.196    -1586.008    325.1228
-------------+----------------------------------------------------------------
      rho_ar |  .38558457
     sigma_u |  1626.9651
     sigma_e |  422.42905
     rho_fov |  .93684349   (fraction of variance because of u_i)
------------------------------------------------------------------------------
F test that all u_i=0:     F(48,677) =    22.21              Prob > F = 0.0000
modified Bhargava et al. Durbin-Watson = 1.0483739
Baltagi-Wu LBI = 1.2288309

. 
.  xtpcse `y' legideo `controls' i.state, correlation (psar1) independent
note: 46.state omitted because of collinearity
(note: estimates of rho outside [-1,1] bounded to be in the range [-1,1])

Prais-Winsten regression, independent panels corrected standard errors

Group variable:   state                         Number of obs      =       784
Time variable:    year                          Number of groups   =        49
Panels:           independent (balanced)        Obs per group: min =        16
Autocorrelation:  panel-specific AR(1)                         avg =        16
                                                               max =        16
Estimated covariances      =         1          R-squared          =    0.9520
Estimated autocorrelations =        49          Wald chi2(56)      =   2177.81
Estimated coefficients     =        57          Prob > chi2        =    0.0000

------------------------------------------------------------------------------
             |           Indep-corrected
   approps_i |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   1.941346   1.113935     1.74   0.081    -.2419273    4.124619
    perc1824 |     263.31   28.58896     9.21   0.000     207.2767    319.3434
    incpcp_i |   124.4886   21.42011     5.81   0.000     82.50597    166.4712
    percpriv |   1.636201   10.40599     0.16   0.875    -18.75916    22.03156
    taxcpc_i |   .5548492   .1564309     3.55   0.000     .2482503    .8614482
   legcomp_i |   .0029899   .0017338     1.72   0.085    -.0004084    .0063881
             |
       board |
     cbweak  |  -103.2285   116.8174    -0.88   0.377    -332.1863    125.7294
      gball  |  -1015.286   183.3439    -5.54   0.000    -1374.634   -655.9389
     gbfour  |  -809.2099   194.6451    -4.16   0.000    -1190.707   -427.7125
       plan  |   -4170.79   401.9689   -10.38   0.000    -4958.635   -3382.945
             |
       state |
         AR  |   464.7565   182.0463     2.55   0.011     107.9524    821.5607
         AZ  |  -1001.257    251.001    -3.99   0.000     -1493.21   -509.3041
         CA  |  -1663.225   346.7369    -4.80   0.000    -2342.816   -983.6328
         CO  |  -2514.459   260.1853    -9.66   0.000    -3024.413   -2004.506
         CT  |  -2703.628   400.1035    -6.76   0.000    -3487.817    -1919.44
         DE  |   1658.883   415.0751     4.00   0.000     845.3511    2472.416
         FL  |  -156.3263   412.3661    -0.38   0.705     -964.549    651.8964
         GA  |   423.7722   403.0694     1.05   0.293    -366.2293    1213.774
         HI  |   1685.538   628.5517     2.68   0.007     453.5993    2917.477
         IA  |  -451.2312    448.891    -1.01   0.315    -1331.041     428.579
         ID  |   262.6297   562.0428     0.47   0.640    -838.9539    1364.213
         IL  |  -2456.681   271.5257    -9.05   0.000    -2988.861     -1924.5
         IN  |  -1601.346   233.5058    -6.86   0.000    -2059.009   -1143.683
         KS  |  -717.2223   260.4395    -2.75   0.006    -1227.674   -206.7703
         KY  |  -368.7782   640.3234    -0.58   0.565    -1623.789    886.2326
         LA  |  -1421.791   246.8791    -5.76   0.000    -1905.665   -937.9167
         MA  |  -4631.115   616.9509    -7.51   0.000    -5840.316   -3421.913
         MD  |  -1552.477   298.0026    -5.21   0.000    -2136.551   -968.4028
         ME  |  -407.3003   351.5597    -1.16   0.247    -1096.345     281.744
         MI  |   2167.416   375.6989     5.77   0.000     1431.059    2903.772
         MN  |  -673.7928   277.9195    -2.42   0.015    -1218.505   -129.0806
         MO  |  -2517.038   289.5847    -8.69   0.000    -3084.614   -1949.463
         MS  |   979.3506   280.4491     3.49   0.000     429.6805    1529.021
         MT  |  -1125.975   185.5466    -6.07   0.000     -1489.64   -762.3107
         NC  |     1273.1   361.0313     3.53   0.000      565.492    1980.709
         ND  |  -210.5392   278.6373    -0.76   0.450    -756.6583      335.58
         NE  |  -1258.339   280.5536    -4.49   0.000    -1808.214   -708.4642
         NH  |  -3701.244   540.9161    -6.84   0.000     -4761.42   -2641.068
         NJ  |  -875.7776   267.4838    -3.27   0.001    -1400.036    -351.519
         NM  |   1004.612   251.9471     3.99   0.000     510.8047    1498.419
         NV  |   606.1886   292.0628     2.08   0.038     33.75605    1178.621
         NY  |  -2953.211   510.5102    -5.78   0.000    -3953.793    -1952.63
         OH  |  -2152.081   294.8436    -7.30   0.000    -2729.963   -1574.198
         OK  |  -1374.107   215.1329    -6.39   0.000     -1795.76   -952.4541
         OR  |  -1520.708   180.4122    -8.43   0.000     -1874.31   -1167.107
         PA  |  -2847.256   438.1859    -6.50   0.000    -3706.085   -1988.428
         RI  |  -3069.405   568.0289    -5.40   0.000    -4182.721   -1956.089
         SC  |  -78.36156   411.0782    -0.19   0.849      -884.06    727.3369
         SD  |  -888.3857   314.1025    -2.83   0.005    -1504.015   -272.7562
         TN  |  -1032.815   266.7754    -3.87   0.000    -1555.685    -509.945
         TX  |  -1066.714   181.1555    -5.89   0.000    -1421.772    -711.656
         UT  |          0  (omitted)
         VA  |  -1742.474   490.8217    -3.55   0.000    -2704.467   -780.4812
         VT  |          0  (omitted)
         WA  |  -1631.866   366.7788    -4.45   0.000    -2350.739   -912.9925
         WI  |  -1287.638   284.4787    -4.53   0.000    -1845.206   -730.0703
         WV  |   228.3151   492.7451     0.46   0.643    -737.4476    1194.078
         WY  |   1975.837    649.661     3.04   0.002     702.5248    3249.149
             |
       _cons |  -160.2852   672.1295    -0.24   0.812    -1477.635    1157.064
------------------------------------------------------------------------------
        rhos =  .3034047  .1076646 -.4736346  .6385079  .5236709 ...   .196412
------------------------------------------------------------------------------

.  
. /*Random effects */
. 
. xtreg `y' legideo `controls', re

Random-effects GLS regression                   Number of obs      =       784
Group variable: state                           Number of groups   =        49

R-sq:  within  = 0.2136                         Obs per group: min =        16
       between = 0.5704                                        avg =      16.0
       overall = 0.5107                                        max =        16

                                                Wald chi2(10)      =    259.34
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
   approps_i |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |   3.660395   1.172635     3.12   0.002     1.362072    5.958717
    perc1824 |   246.8909   23.12238    10.68   0.000     201.5719      292.21
    incpcp_i |  -7.714237   18.40243    -0.42   0.675    -43.78234    28.35386
    percpriv |   -37.4791   6.978047    -5.37   0.000    -51.15582   -23.80238
    taxcpc_i |   1.569975   .1473129    10.66   0.000     1.281247    1.858703
   legcomp_i |   .0018243   .0019544     0.93   0.351    -.0020062    .0056548
             |
       board |
     cbweak  |  -26.06821   105.3905    -0.25   0.805    -232.6298    180.4933
      gball  |  -362.6452   173.9324    -2.08   0.037    -703.5464   -21.74391
     gbfour  |  -635.6635   159.6952    -3.98   0.000    -948.6603   -322.6667
       plan  |  -1734.711   485.8972    -3.57   0.000    -2687.052   -782.3702
             |
       _cons |   1230.292   581.2082     2.12   0.034     91.14439    2369.439
-------------+----------------------------------------------------------------
     sigma_u |  782.15356
     sigma_e |  492.51715
         rho |  .71606866   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. estimates store re1

. 
. /*Hausman test */
. 
. hausman fe1 re1,  sigmamore

Note: the rank of the differenced variance matrix (7) does not equal the number of coefficients being tested (9); be sure
        this is what you expect, or there may be problems computing the test.  Examine the output of your estimators for
        anything unexpected and possibly consider scaling your variables so that the coefficients are on a similar scale.

                 ---- Coefficients ----
             |      (b)          (B)            (b-B)     sqrt(diag(V_b-V_B))
             |      fe1          re1         Difference          S.E.
-------------+----------------------------------------------------------------
     legideo |    3.508206     3.660395       -.1521887        .2686468
    perc1824 |    269.2799     246.8909        22.38899        7.972059
    incpcp_i |    12.85631    -7.714237        20.57055        8.601668
    percpriv |   -3.949699     -37.4791         33.5294         7.87902
    taxcpc_i |    1.436178     1.569975       -.1337973        .0587522
   legcomp_i |    .0022197     .0018243        .0003954        .0005183
       board |
          2  |   -41.50431    -26.06821        -15.4361        29.86623
          3  |   -597.6449    -362.6452       -234.9998        111.7685
          4  |   -942.1278    -635.6635       -306.4643        94.66588
------------------------------------------------------------------------------
                           b = consistent under Ho and Ha; obtained from xtreg
            B = inconsistent under Ha, efficient under Ho; obtained from xtreg

    Test:  Ho:  difference in coefficients not systematic

                  chi2(7) = (b-B)'[(V_b-V_B)^(-1)](b-B)
                          =       27.11
                Prob>chi2 =      0.0003

. 
. /* First differenced model*/
. 
. sort state year 

. 
. xtreg D.approps D.legideo D.perc1824 D.incpcp_i D.percpriv D.taxcpc_i  D.legcomp_i 

Random-effects GLS regression                   Number of obs      =       735
Group variable: state                           Number of groups   =        49

R-sq:  within  = 0.0933                         Obs per group: min =        15
       between = 0.0435                                        avg =      15.0
       overall = 0.0904                                        max =        15

                                                Wald chi2(6)       =     72.39
corr(u_i, X)   = 0 (assumed)                    Prob > chi2        =    0.0000

------------------------------------------------------------------------------
 D.approps_i |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |
         D1. |  -.6431784    1.46816    -0.44   0.661    -3.520718    2.234361
             |
    perc1824 |
         D1. |    -44.658   86.35905    -0.52   0.605    -213.9186    124.6026
             |
    incpcp_i |
         D1. |   221.0694   38.56684     5.73   0.000     145.4798     296.659
             |
    percpriv |
         D1. |   82.98699   15.51366     5.35   0.000     52.58077    113.3932
             |
    taxcpc_i |
         D1. |   .3440062   .1841561     1.87   0.062    -.0169331    .7049455
             |
   legcomp_i |
         D1. |    .001685   .0018231     0.92   0.355    -.0018881    .0052582
             |
       _cons |  -104.6579   30.00955    -3.49   0.000    -163.4756   -45.84029
-------------+----------------------------------------------------------------
     sigma_u |          0
     sigma_e |  484.01371
         rho |          0   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. 
. xtpcse D.approps D.legideo D.perc1824 D.incpcp_i D.percpriv D.taxcpc_i  D.legcomp_i, correlation (ar1) independent

Prais-Winsten regression, independent panels corrected standard errors

Group variable:   state                         Number of obs      =       735
Time variable:    year                          Number of groups   =        49
Panels:           independent (balanced)        Obs per group: min =        15
Autocorrelation:  common AR(1)                                 avg =        15
                                                               max =        15
Estimated covariances      =         1          R-squared          =    0.1091
Estimated autocorrelations =         1          Wald chi2(6)       =     90.14
Estimated coefficients     =         7          Prob > chi2        =    0.0000

------------------------------------------------------------------------------
             |           Indep-corrected
 D.approps_i |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     legideo |
         D1. |  -.9857381    1.41749    -0.70   0.487    -3.763968    1.792492
             |
    perc1824 |
         D1. |  -49.15948   74.62122    -0.66   0.510    -195.4144    97.09542
             |
    incpcp_i |
         D1. |   245.3998    35.9307     6.83   0.000     174.9769    315.8227
             |
    percpriv |
         D1. |   74.01852   15.15216     4.89   0.000     44.32083    103.7162
             |
    taxcpc_i |
         D1. |   .4236832   .1812494     2.34   0.019     .0684409    .7789255
             |
   legcomp_i |
         D1. |   .0018879   .0017351     1.09   0.277    -.0015129    .0052886
             |
       _cons |   -119.541   26.37282    -4.53   0.000    -171.2307   -67.85118
-------------+----------------------------------------------------------------
         rho |   -.148569
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/doylewr/practicum/lpo_prac_2016-2017/central/lessons/panel_data/panel.log
  log type:  text
 closed on:  11 Apr 2017, 16:11:25
---------------------------------------------------------------------------------------------------------------------------
